#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MassCrowdAnimSharingTransitionInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_MassCrowdAnimSharingTransitionInstance_structs.hpp"
#include "AnimationSharing_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MassCrowdAnimSharingTransitionInstance.ABP_MassCrowdAnimSharingTransitionInstance_C
// 0x0350 (0x06D0 - 0x0380)
class UABP_MassCrowdAnimSharingTransitionInstance_C final : public UAnimSharingTransitionInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MassCrowdAnimSharingTransitionInstance::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0388(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x03D8(0x0158)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0530(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0578(0x0158)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABP_MassCrowdAnimSharingTransitionInstance(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_MassCrowdAnimSharingTransitionInstance_C">();
	}
	static class UABP_MassCrowdAnimSharingTransitionInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MassCrowdAnimSharingTransitionInstance_C>();
	}
};

}

