#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MassCrowdAnimSharingStateInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_MassCrowdAnimSharingStateInstance_structs.hpp"
#include "AnimationSharing_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MassCrowdAnimSharingStateInstance.ABP_MassCrowdAnimSharingStateInstance_C
// 0x0090 (0x0420 - 0x0390)
class UABP_MassCrowdAnimSharingStateInstance_C final : public UAnimSharingStateInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MassCrowdAnimSharingStateInstance::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0398(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03D0(0x0048)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_ABP_MassCrowdAnimSharingStateInstance(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_MassCrowdAnimSharingStateInstance_C">();
	}
	static class UABP_MassCrowdAnimSharingStateInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MassCrowdAnimSharingStateInstance_C>();
	}
};

}

