#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueNPC_Sub_Base

#include "Basic.hpp"

#include "BP_NPC_Sub_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogueNPC_Sub_Base.BP_DialogueNPC_Sub_Base_C
// 0x0020 (0x2230 - 0x2210)
class ABP_DialogueNPC_Sub_Base_C : public ABP_NPC_Sub_Base_C
{
public:
	uint8                                         Pad_576D[0x4];                                     // 0x2204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       GreetTriggerSphere;                                // 0x2208(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterHeadUpComp_BP_C*              CharacterHeadUpComp_BP;                            // 0x2210(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Dlg_Sphere;                                        // 0x2218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x2220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Dlgloop;                                           // 0x2228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DialogueNPC_Sub_Base_C">();
	}
	static class ABP_DialogueNPC_Sub_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogueNPC_Sub_Base_C>();
	}
};

}

