#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DialogueNPC_Sub_001_EibonTransfer

#include "Basic.hpp"

#include "BP_DialogueNPC_Sub_001_classes.hpp"
#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DialogueNPC_Sub_001_EibonTransfer.BP_DialogueNPC_Sub_001_EibonTransfer_C
// 0x0040 (0x2270 - 0x2230)
class ABP_DialogueNPC_Sub_001_EibonTransfer_C final : public ABP_DialogueNPC_Sub_001_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x2238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Anomaly_044_skin;                                  // 0x2240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_49FF808946FCAB4105AB5FBAD9EAF528; // 0x2248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_49FF808946FCAB4105AB5FBAD9EAF528; // 0x224C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F0F[0x3];                                     // 0x224D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x2250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      Msg_Arr;                                           // 0x2258(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   In_Un_Lock_ID;                                     // 0x2268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DialogueNPC_Sub_001_EibonTransfer(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ThrowOut();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DialogueNPC_Sub_001_EibonTransfer_C">();
	}
	static class ABP_DialogueNPC_Sub_001_EibonTransfer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DialogueNPC_Sub_001_EibonTransfer_C>();
	}
};

}

