#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxInteractionComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BS_InteractionSource_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FluxInteractionComponent.BP_FluxInteractionComponent_C
// 0x00A8 (0x0150 - 0x00A8)
class UBP_FluxInteractionComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_FluxDataComponent_C*                FluxData;                                          // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   OwnerComponentTag;                                 // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBS_InteractionSource>          Sources;                                           // 0x00C0(0x0010)(Edit, BlueprintVisible)
	double                                        OwnerScale;                                        // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OwnerMinSpeed;                                     // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SourceSpeedLimit;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CurrentLocation;                                   // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        PreviousLocations;                                 // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<bool>                                  SplashState;                                       // 0x0108(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanInteract;                                       // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5979[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SplashDetection;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597A[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        OwnerComponent;                                    // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CanSpawnSplashes;                                  // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_597B[0x7];                                     // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FluxSurface_Simple_C*               FluxSurface_Simple;                                // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ForeverTouch;                                      // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DrawDebugInteractions();
	void ExecuteUbergraph_BP_FluxInteractionComponent(int32 EntryPoint);
	void GetInteractions(double Ratio, int32 Iteration, TArray<struct FBS_FluxInteractionData>* Interactions);
	void OnComponentActivatedEvent(class UActorComponent* Component, bool bReset);
	void OnComponentDeactivatedEvent(class UActorComponent* Component);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ResizeArrays(int32 Size);
	void Set_Sources(TArray<struct FBS_InteractionSource>& Param_Sources);
	void UpdateAttachmentsAndSplashes();

	void CalculateInteractionData(double TimeRatio, int32 Iteration, TArray<struct FBS_FluxInteractionData>* Interactions) const;
	void GetLocation(struct FBS_InteractionSource& Source, struct FVector* Location) const;
	void GetOwnerComponent(class USceneComponent** SceneComponent) const;
	bool IsOwnerTouchingFluid() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FluxInteractionComponent_C">();
	}
	static class UBP_FluxInteractionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FluxInteractionComponent_C>();
	}
};

}

