#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FluxSurface_Simple

#include "Basic.hpp"

#include "FluidFlux_classes.hpp"
#include "Engine_structs.hpp"
#include "BS_FluxSplashData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BE_SurfaceMesh_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FluxSurface_Simple.BP_FluxSurface_Simple_C
// 0x0420 (0x06C0 - 0x02A0)
class ABP_FluxSurface_Simple_C : public AFluidFluxActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialBillboardComponent*            MaterialBillboard;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProceduralMeshComponent*               SurfaceProceduralMesh;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SurfaceSectionMesh;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SurfaceOverMesh;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluxDataComponent_C*                BP_FluxDataComponent;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluxMeshGenerator_C*                BP_FluxMeshGenerator;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DomainSize;                                        // 0x02E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_FluxSimulationState_C*             SimulationState;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPDA_FluxCoastlineState_C*              CoastlineState;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_FluxSurfaceCutMask_C> CutMaskActor;                                      // 0x0308(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class BP_FluxOceanWave::ABP_FluxOceanWave_C*  OceanWaveActor;                                    // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  ScenePainterActor;                                 // 0x0338(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EBE_SurfaceMesh                               SurfaceMeshMode;                                   // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_SurfaceMesh                               SurfaceMeshMode_ES3_1;                             // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA5[0x6];                                     // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ES3_1AreaSizeScale;                                // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_SurfaceMesh                               CurrentSurfaceMeshMode;                            // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA6[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ExternalMeshActor;                                 // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             SurfaceMeshTransform;                              // 0x0380(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SurfaceOverMaterial;                               // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SurfaceSectionInstance;                            // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SurfaceOverMaterial_ES3_1;                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     SurfaceOverMaterial_Default;                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Interp, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SurfaceUnderMaterial;                              // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SurfaceSectionMaterial;                            // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     SurfaceDistantMaterial;                            // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     CausticsWetMaterial;                               // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     PostProcessMaterial;                               // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInterface*                     VolumeAbsorptionMaterial;                          // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     VolumeScatteringMaterial;                          // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       MaterialInstances;                                 // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       InteractionInstances;                              // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               SurfaceOverInstance;                               // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SurfaceUnderInstance;                              // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CausticsInstance;                                  // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PostprocessInstance;                               // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               VolumeAbsorptionInstance;                          // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          GenerateProceduralMeshView;                        // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA7[0x7];                                     // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     GeneratedSurfaceOverMaterial;                      // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         GenerateEdgePadding;                               // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA8[0x3];                                     // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GenerateLOD;                                       // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AudiFalloffDistance;                               // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AudioExtendDistance;                               // 0x04A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioAmbient;                                      // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               VolumeScatteringInstance;                          // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                UnderSurfaceComponents;                            // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               SurfaceDistantInstance;                            // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentCameraBlur;                                 // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCameraVolumeRendered;                            // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InitVolumeRendered;                                // 0x04E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA9[0x6];                                     // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStaticMeshActor*>               DistantMeshes;                                     // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<int32, struct FBS_FluxSplashData>        InteractionSplashes;                               // 0x0500(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	class USceneComponent*                        CameraComponent;                                   // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<EBE_SurfaceMesh, TSoftObjectPtr<class UStaticMesh>> SurfaceMeshes;                                     // 0x0558(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 GeneratedMeshStats;                                // 0x05A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, HasGetValueTypeHash)
	TMap<EBE_SurfaceMesh, TSoftObjectPtr<class UStaticMesh>> SectionMeshes;                                     // 0x05B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FIntVector                             WorldOriginLocation;                               // 0x0608(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AAA[0x4];                                     // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      InfiniteOverPlane;                                 // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      InfiniteUnderPlane;                                // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ExtendVolumeSize;                                  // 0x0628(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_FluxSurfacePreset_C*               BaseColorPreset;                                   // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  SkyLight;                                          // 0x0648(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         InfiniteGridLevelsOver;                            // 0x0670(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InfiniteGridLevelsUnder;                           // 0x0674(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InfiniteGridMeshScale;                             // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPDA_FluxSurfacePreset_C*               ShoreColorPreset;                                  // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPDA_FluxSurfacePreset_C*               PainterColorPreset;                                // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          NS_InfiniteSurfaceMesh;                            // 0x0690(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AddToUnderSurfaceList(const class USceneComponent*& Item);
	void ApplyColor();
	void ApplyColorProfiles();
	void ApplyMask();
	void ApplyMaterialData(TArray<class UMaterialInstanceDynamic*>& Materials);
	void ApplyPainter();
	void ApplySurfaceBoundsZ();
	void ApplySurfaceMaterialData(const TArray<class UMaterialInstanceDynamic*>& Materials);
	void ApplySurfaceNiagaraData(class UNiagaraComponent* ParticleSystem, bool RequiredGround, bool RequiredWave);
	void CanRenderInteractions(bool* CanRender);
	void CanRenderWave(bool* CanRender);
	void ConstructSurfaceMesh();
	void CreateDynamicWaterBodyMaterial(class AActor* WaterBodyActor, class UMaterialInstanceDynamic** Material);
	void CreateMaterials();
	void CreateMaterialsForMesh();
	void DetectCurrentCamera();
	void ExecuteUbergraph_BP_FluxSurface_Simple(int32 EntryPoint);
	void Generate();
	void GenerateMesh(class UPDA_FluxSimulationState_C* State);
	void GenerateProceduralMeshFromSimulationState();
	void Get_Surface_Height(double* SurfaceHeight);
	void GetCoastlineState(class UPDA_FluxCoastlineState_C** State);
	void GetSimulationState(class UPDA_FluxSimulationState_C** State);
	void GetWaveTextureMaterials(TArray<class UMaterialInstanceDynamic*>* Param_MaterialInstances);
	void InitializeAllStates();
	void InitializeOvelapingEvent();
	void InitializeOverlaping();
	void InitializeStates();
	void InitializeSurfaces(const struct FVector& AreaSize);
	void InitializeVolumes(const struct FVector& AreaSize);
	void LoadMesh();
	void OffsetWorld();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RemovePostprocess();
	void SetCoastlineState(class UPDA_FluxCoastlineState_C* State);
	void SetInteractionsArea(const struct FLinearColor& Area);
	void SetInteractionsAreaVehicle(const struct FLinearColor& Area);
	void SetInteractionsTexture(class UTextureRenderTarget2D* Texture);
	void SetInteractionsTextureVehicle(class UTextureRenderTarget2D* Texture);
	void SetNiagaraData(class UNiagaraComponent* NiagaraSystem, bool& RequiredGround, bool& RequiredWave);
	void SetSimulationState(class UPDA_FluxSimulationState_C* State);
	void SetStateHeightWetMap(class UTexture* Texture);
	void SetWaveProfile(class UPDA_FluxWaveProfile_C* Profile);
	void SetWaveTexture();
	void SetWaveTextureAndArea(class UTextureRenderTarget2D* Texture, const struct FLinearColor& Area);
	void SpawnSplash(const struct FVector& Location, const struct FBS_FluxSplashData& BS_FluxSplashData);
	void SpawnSplashAtLocation(const struct FVector& Location, int32 Type);
	void SwitchUnderFluidVisibility();
	void Update_by_Platform();
	void UpdateCamera(double DeltaTime);
	void UpdateHeightMap(class UTexture* Value);
	void UserConstructionScript();
	void WhenFeatureLevelChanged();

	void Get_Cut_Mask(struct FVector4* Mask) const;
	void GetVolumeCollision(class UPrimitiveComponent** Volume) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FluxSurface_Simple_C">();
	}
	static class ABP_FluxSurface_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FluxSurface_Simple_C>();
	}
};

}

