#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseC_Peak_PCG

#include "Basic.hpp"

#include "BP_House_PCG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HouseC_Peak_PCG.BP_HouseC_Peak_PCG_C
// 0x0010 (0x03F0 - 0x03E0)
class ABP_HouseC_Peak_PCG_C : public ABP_House_PCG_C
{
public:
	bool                                          UseShop;                                           // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseGround;                                         // 0x03DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6228[0x1];                                     // 0x03DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShopRangeBegin;                                    // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShopRangeEnd;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HouseC_Peak_PCG_C">();
	}
	static class ABP_HouseC_Peak_PCG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HouseC_Peak_PCG_C>();
	}
};

}

