#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_House_PBG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProceduralGeneration_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_House_PBG.BP_House_PBG_C
// 0x0020 (0x02F0 - 0x02D0)
class ABP_House_PBG_C : public AProceduralBuildGenerationActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        AirConditionDensity;                               // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AirConditionSeed;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConvertRoofMesh;                                   // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Build();
	void BuildProps();
	void ClearEmptyISM();
	void CreateRoofMesh();
	void ExecuteUbergraph_BP_House_PBG(int32 EntryPoint);
	void MobileSetting();
	void ReceiveBeginPlay();
	void Updata_Build();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_House_PBG_C">();
	}
	static class ABP_House_PBG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_House_PBG_C>();
	}
};

}

