#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HouseB_PCG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HouseB_PCG.BP_HouseB_PCG_C.NumToPoint
// 0x000C (0x000C - 0x0000)
struct BP_HouseB_PCG_C_NumToPoint final
{
public:
	struct FRandomStream                          CallFunc_MakeRandomStream_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HouseB_PCG.BP_HouseB_PCG_C.Seed+1
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseB_PCG_C_SeedPlus1 final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_HouseB_PCG.BP_HouseB_PCG_C.Seed-1
// 0x0008 (0x0008 - 0x0000)
struct BP_HouseB_PCG_C_SeedMinus1 final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

