#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Interact_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Interact_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Interact_Screen.BP_Interact_Screen_C
// 0x0058 (0x0B88 - 0x0B30)
class ABP_Interact_Screen_C final : public ABP_Interact_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight;                                        // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_SmartHousekeeper;                               // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x0B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____TimeLine_Light_C37D183943F556EF22C23BBC2690F916; // 0x0B58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_C37D183943F556EF22C23BBC2690F916;   // 0x0B5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53F5[0x3];                                     // 0x0B5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t;                                               // 0x0B60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   Dialogue_Interact_Entry_Interact_Title;            // 0x0B68(0x0010)(Edit, BlueprintVisible)
	class UTexture2D*                             Dialogue_Interact_Entry_Icon_Photo;                // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Yahaha_Id;                                         // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Interact_Screen(int32 EntryPoint);
	void ReceiveBeginPlay();
	void __t__FinishedFunc();
	void __t__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Interact_Screen_C">();
	}
	static class ABP_Interact_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Interact_Screen_C>();
	}
};

}

