#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LD_R_AutoDoor_SchoolGate

#include "Basic.hpp"

#include "BP_LD_R_AutoDoor_Base_classes.hpp"
#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LD_R_AutoDoor_SchoolGate.BP_LD_R_AutoDoor_SchoolGate_C
// 0x0058 (0x0C88 - 0x0C30)
class ABP_LD_R_AutoDoor_SchoolGate_C final : public ABP_LD_R_AutoDoor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LD_R_AutoDoor_SchoolGate_C;      // 0x0C30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ____0_X_2C9E1D5D45D23C0AE8FAE2B638E77D45;          // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_2C9E1D5D45D23C0AE8FAE2B638E77D45; // 0x0C3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E6[0x3];                                     // 0x0C3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_0;                                             // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ____X_EFE9424B4CDD3D5A176E88A2F7F60BDF;            // 0x0C48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_EFE9424B4CDD3D5A176E88A2F7F60BDF;   // 0x0C4C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61E7[0x3];                                     // 0x0C4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t;                                               // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class AUltra_Dynamic_Sky_HT_C> HTSky;                                             // 0x0C58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Hour;                                              // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_LD_R_AutoDoor_SchoolGate_TriggerBox_In_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_LD_R_AutoDoor_SchoolGate_TriggerBox_In_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_LD_R_AutoDoor_SchoolGate(int32 EntryPoint);
	void OnLoaded_389B4FFE4D65626C493BBB90BEBAE945(class UObject* Loaded);
	void ReceiveBeginPlay();
	void __t_0__FinishedFunc();
	void __t_0__UpdateFunc();
	void __t__FinishedFunc();
	void __t__UpdateFunc();
	void __I__(int32 Param_Hour);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LD_R_AutoDoor_SchoolGate_C">();
	}
	static class ABP_LD_R_AutoDoor_SchoolGate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LD_R_AutoDoor_SchoolGate_C>();
	}
};

}

