#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MyHTSelfieActivityVolume_s110613

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MyHTSelfieActivityVolume_s110613.BP_MyHTSelfieActivityVolume_s110613_C
// 0x0028 (0x03F8 - 0x03D0)
class ABP_MyHTSelfieActivityVolume_s110613_C final : public AHTSelfieActivityVolume
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestId;                                           // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Objective_ID;                                      // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool BPCanActiveFunc(class AHTPlayerState* PlayerState);
	void ExecuteUbergraph_BP_MyHTSelfieActivityVolume_s110613(int32 EntryPoint);
	void OnTakePhotoClickedEvent(const TArray<struct FSelfieCheckTargetState>& GainFlagActors);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MyHTSelfieActivityVolume_s110613_C">();
	}
	static class ABP_MyHTSelfieActivityVolume_s110613_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MyHTSelfieActivityVolume_s110613_C>();
	}
};

}

