#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OracleStone_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OracleStone_Base.BP_OracleStone_Base_C
// 0x00E8 (0x0D98 - 0x0CB0)
class ABP_OracleStone_Base_C : public AHTOracleStoneActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          Ex_Stand;                                          // 0x0CC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          Ex_Fly;                                            // 0x0CE8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraComponent*                      Spawned_Comp;                                      // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Bullet;                                         // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Montage_Leisure;                                   // 0x0D20(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           AkEvent_01;                                        // 0x0D48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           AkEvent_02;                                        // 0x0D70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BP_OnPlayLockAnim();
	void BP_OnPlayOpenAnim();
	void ExecuteUbergraph_BP_OracleStone_Base(int32 EntryPoint);
	void OnEmitterSpawned_DF66562B41418BD61BB979BE0EAFADBC(class UNiagaraComponent* SpawnedComp);
	void OnEmitterSpawned_E8F9E6BA40A6EBDC118BED8B501140FF(class UNiagaraComponent* SpawnedComp);
	void OnLoaded_74D131E846835934B256AF8849D9076D(class UObject* Loaded);
	void OnLoaded_AAE860A340D3B10967A1F095CD15B3FD(class UObject* Loaded);
	void OnLoaded_FF5B8F0F428D93D41EDB7C9169361E2B(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OracleStone_Base_C">();
	}
	static class ABP_OracleStone_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OracleStone_Base_C>();
	}
};

}

