#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projector_Range

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projector_Range.BP_Projector_Range_C
// 0x01B0 (0x0CC0 - 0x0B10)
class ABP_Projector_Range_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       ScanSphere;                                        // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NoiseSpeed_098662CC4CCFFEDBA1D8CCAC87FF7797; // 0x0B20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_MaskHardness_098662CC4CCFFEDBA1D8CCAC87FF7797; // 0x0B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Blend_098662CC4CCFFEDBA1D8CCAC87FF7797;   // 0x0B28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_098662CC4CCFFEDBA1D8CCAC87FF7797; // 0x0B2C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B8F[0x3];                                     // 0x0B2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_SceneGrayAppear_SplitStrength_297D06924B6E53AF545583AD83C21068; // 0x0B38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_SceneGrayAppear__Direction_297D06924B6E53AF545583AD83C21068; // 0x0B3C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B90[0x3];                                     // 0x0B3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_SceneGrayAppear;                          // 0x0B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InRange;                                           // 0x0B48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAppeared_;                                       // 0x0B49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAppearing_;                                      // 0x0B4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisappearing_;                                   // 0x0B4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsContain_;                                        // 0x0B4C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B91[0x3];                                     // 0x0B4D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataLayerAsset*                        In_Layer_Asset;                                    // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHTVisionAreaVolume*                    HTVisionAreaVolume;                                // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class AHTMassCrowdHideAndAvoidVolume*         AvoidVolume;                                       // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CanGlitch;                                         // 0x0B68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B92[0x7];                                     // 0x0B69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Projector_Anomaly_C*                ProjectorAnomaly;                                  // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ScanMaterial;                                      // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ULevelSequence>          In_Soft_Level_Sequence;                            // 0x0B80(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           AppearAkEvent;                                     // 0x0BA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           DisappearAkEvent;                                  // 0x0BD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               GlitchMaterial;                                    // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x0C00(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	class ULevelStreamingDynamic*                 LevelInstance;                                     // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 VisionID;                                          // 0x0C30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SceneGrayMaterial;                                 // 0x0C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           MuteAkEvent;                                       // 0x0C48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>           UnMuteAk_Event;                                    // 0x0C70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   LoadYahahaID;                                      // 0x0C98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HueNoiseMaterial;                                  // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeOffset;                                        // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScanPosition;                                      // 0x0CB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)

public:
	void AppearFinished();
	void BindTriggerEvent();
	void BndEvt__BP_Projector_Range_ScanSphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Projector_Range_ScanSphere_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Completed_4FCE725C4BA0BF9B69EE17AEF0018AE9(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequencePlayer* LevelSequencePlayer);
	void Completed_9AD82821489F000F4A42FD91DE29AE7F(class ALevelSequenceActor* LevelSequenceActor, class ULevelSequencePlayer* LevelSequencePlayer);
	void Create_Material_Instance();
	void DestroyGameplay();
	void DisappearFinished();
	void EnterGameplayRange();
	void ExecuteUbergraph_BP_Projector_Range(int32 EntryPoint);
	void ExitGameplayRange();
	void Initialize();
	void OnLoaded_A11BD9C844F1949F3FBB2DB0601CE08B(class UObject* Loaded);
	void OnLoaded_B65A09E641226C4416C475AD9D92AF71(class UObject* Loaded);
	void OnLoaded_D8E04FF940CD4E93070713B76C4468E0(class UObject* Loaded);
	void OnLoaded_E2E7682A430ACC4882BF63ABAD4840C2(class UObject* Loaded);
	void OnLoaded_E87553254A19B33C54075B96D3174BEA(class UObject* Loaded);
	void OnLoaded_F1C3C2CC4F3404CE510389B51FC558F0(class UObject* Loaded);
	void PlayerEnterRange(class AActor* OverlappedActor, class AActor* OtherActor);
	void PlayerExitRange(class AActor* OverlappedActor, class AActor* OtherActor);
	void PlayScreenGlitch(bool Param_CanGlitch);
	void RangeAppear();
	void RangeAppearAudio();
	void RangeDisappear();
	void RangeDisappearAudio();
	void SceneGrayAppear();
	void SetAvoidVolumeEnable(bool Enable);
	void SetScanParameter();
	void SetYaHaHaID(bool Flag, const class FName& YahahaId);
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void Timeline_SceneGrayAppear__FinishedFunc();
	void Timeline_SceneGrayAppear__UpdateFunc();
	void UnloadGameplay();
	void UpdateMaterialInstance(double InWeight, class UMaterialInterface* InBlendMaterial);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projector_Range_C">();
	}
	static class ABP_Projector_Range_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projector_Range_C>();
	}
};

}

