#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projector_StaticMesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projector_StaticMesh.BP_Projector_StaticMesh_C
// 0x0058 (0x0B68 - 0x0B10)
class ABP_Projector_StaticMesh_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NiagaraScale;                                      // 0x0B20(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          PSTemplate;                                        // 0x0B38(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	bool                                          IsAppeared_;                                       // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Appear();
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void DestroyStaticMesh();
	void Disappear();
	void ExecuteUbergraph_BP_Projector_StaticMesh(int32 EntryPoint);
	void Initialize();
	void OnEmitterSpawned_A33413104E91D3FE748726B382F845B0(class UNiagaraComponent* SpawnedComp);
	void PlayNiagara(bool IsAppear_);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projector_StaticMesh_C">();
	}
	static class ABP_Projector_StaticMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projector_StaticMesh_C>();
	}
};

}

