#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projector_Clue_Mesh

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projector_Clue_Mesh.BP_Projector_Clue_Mesh_C
// 0x0028 (0x0B38 - 0x0B10)
class ABP_Projector_Clue_Mesh_C : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTNiagaraComponent*                    NS_Refresh;                                        // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFound_;                                          // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClueMeshAppear(bool IsAppear_);
	void Destroy_Clue_Mesh();
	void ExecuteUbergraph_BP_Projector_Clue_Mesh(int32 EntryPoint);
	void Found();
	void Initialize();
	void OnLoaded_253FD6464BFDEF73D267B39C8B408EE6(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projector_Clue_Mesh_C">();
	}
	static class ABP_Projector_Clue_Mesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projector_Clue_Mesh_C>();
	}
};

}

