#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerCharacterBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerCharacterBase.BP_PlayerCharacterBase_C
// 0x0070 (0x2A80 - 0x2A10)
class ABP_PlayerCharacterBase_C : public AHTPlayerCharacter
{
public:
	uint8                                         Pad_4E40[0x8];                                     // 0x2A08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2A10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_FluxInteractionComponent_C*         BP_FluxInteractionComponent;                       // 0x2A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluxDataComponent_C*                BP_FluxDataComponent;                              // 0x2A20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDLWE_Interaction_C*                    DLWE_Right;                                        // 0x2A28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDLWE_Interaction_C*                    DLWE_Left;                                         // 0x2A30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFootPrintComponentBase*                RightFootStep;                                     // 0x2A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFootPrintComponentBase*                LeftFootStep;                                      // 0x2A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableNinjaSpawn;                                 // 0x2A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E41[0x7];                                     // 0x2A49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            ManaPlayUI;                                        // 0x2A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableNinjaVolumeFogPreset;                        // 0x2A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E42[0x3];                                     // 0x2A59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ShoeName;                                          // 0x2A5C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Stick;                                          // 0x2A64(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E43[0x3];                                     // 0x2A65(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Action_Value;                                      // 0x2A68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           GlidLoopSound;                                     // 0x2A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PlayerCharacterBase_CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ExecuteUbergraph_BP_PlayerCharacterBase(int32 EntryPoint);
	void FoliageInteractionGetOwnerInfo(struct FVector* CurrentPosition, struct FVector* CurrentForwardVector);
	void FoliageInteractionGetTrail(bool* ShouldAddTrail, struct FVector* TrailVelocity, struct FVector* TrailLocaltion, double* TrailRadius, double* TrailAlpha);
	void GetInteractions(double Ratio, int32 Iteration, TArray<struct FBS_FluxInteractionData>* Interactions);
	void GetOceanHeight();
	void PlayVideo(class UObject* VideoTexture);
	void ReceiveBeginPlay();

	class UHTNiagaraComponent* GetNiagaraSysRecover() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlayerCharacterBase_C">();
	}
	static class ABP_PlayerCharacterBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlayerCharacterBase_C>();
	}
};

}

