#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PortalSoundComp

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PortalSoundComp.BP_PortalSoundComp_C.Close
// 0x0010 (0x0010 - 0x0000)
struct BP_PortalSoundComp_C_Close final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PortalSoundComp.BP_PortalSoundComp_C.ExecuteUbergraph_BP_PortalSoundComp
// 0x0004 (0x0004 - 0x0000)
struct BP_PortalSoundComp_C_ExecuteUbergraph_BP_PortalSoundComp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_PortalSoundComp.BP_PortalSoundComp_C.Open
// 0x0010 (0x0010 - 0x0000)
struct BP_PortalSoundComp_C_Open final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

