#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projector_Clue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projector_Clue.BP_Projector_Clue_C
// 0x0108 (0x0C18 - 0x0B10)
class ABP_Projector_Clue_C final : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   CollisionSphere;                                   // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    NS_Hint;                                           // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       AudioSphere;                                       // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DlgSphere;                                         // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_83E0750C4F6BB125EAF63FB06FF5E48F;     // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_83E0750C4F6BB125EAF63FB06FF5E48F; // 0x0B44(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E8[0x3];                                     // 0x0B45(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t_0;                                             // 0x0B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         _________0_0386079644E6A0DD3EDE309C547C6967;       // 0x0B50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____Direction_0386079644E6A0DD3EDE309C547C6967;   // 0x0B54(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E9[0x3];                                     // 0x0B55(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     __t;                                               // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_Projector_Anomaly_C*                ProjectorAnomaly;                                  // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Projector_Clue_Mesh_C*>      ClueMeshs;                                         // 0x0B68(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AHTAISpawnManager*                      AISpawner;                                         // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   ProjectorSeq;                                      // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AppearState;                                       // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EA[0x3];                                     // 0x0B89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_BP_Projector_Clue_C;                         // 0x0B8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocked_;                                         // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFound_;                                          // 0x0B91(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanInteract;                                       // 0x0B92(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsProjectorSfxPlaying_;                            // 0x0B93(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EB[0x4];                                     // 0x0B94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInteractEntry>                 InteractEntry;                                     // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ACineCameraActor*                       ClueCamera;                                        // 0x0BA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ABP_Projector_Clue_C*                   NextClue;                                          // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          PlayAkEvent;                                       // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          StopAkEvent;                                       // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           ClueAkLoop;                                        // 0x0BC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABP_Projector_Clue_Mesh_C>> SoftClueMeshs;                                     // 0x0BD0(0x0010)(Edit, BlueprintVisible)
	TSoftObjectPtr<class AHTAISpawnManager>       SoftAISpawner;                                     // 0x0BE0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FText>                           In_Msgs;                                           // 0x0C08(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__BP_TimelineManager_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature(class FName InParticipant, class FName InEventName);
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void ClueAppear(bool IsAppear_);
	void Destroy_ClueMesh();
	void DestroyNPC();
	void DestroySelf();
	void ExecuteUbergraph_BP_Projector_Clue(int32 EntryPoint);
	void FoundClue();
	void FoundClueMesh();
	void Initialize();
	void NiagaraAppear(bool IsAppear_);
	void OnAllAIDead___(class AHTAISpawnManager* SpawnMgr, class AHTCharacter* OwnerPlayer);
	void OnFail_8983518B42AE59009D708982C7466962(class AHTAISpawnManager* Spawn);
	void OnLoaded_642B2774439805F9A7102498E2687DF3(class UObject* Loaded);
	void OnLoaded_A564362640F37DD6028CA282C7ADF1FA(class UObject* Loaded);
	void OnSuccess_8983518B42AE59009D708982C7466962(class AHTAISpawnManager* Spawn);
	void PlayAudio();
	void ShowAnomalyNS();
	void ShowTips();
	void SpawnMonster();
	void SpawnNPC();
	void StopAudio();
	void UnlockClue();
	void UpdateDataTable();
	void __t_0__FinishedFunc();
	void __t_0__UpdateFunc();
	void __t__FinishedFunc();
	void __t__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projector_Clue_C">();
	}
	static class ABP_Projector_Clue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projector_Clue_C>();
	}
};

}

