#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projector_Clue_Mesh_Fx_Born

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Projector_Clue_Mesh_Fx_Born.BP_Projector_Clue_Mesh_Fx_Born_C.ClueMeshAppear
// 0x0001 (0x0001 - 0x0000)
struct BP_Projector_Clue_Mesh_Fx_Born_C_ClueMeshAppear final
{
public:
	bool                                          IsAppear_;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Projector_Clue_Mesh_Fx_Born.BP_Projector_Clue_Mesh_Fx_Born_C.ExecuteUbergraph_BP_Projector_Clue_Mesh_Fx_Born
// 0x0038 (0x0038 - 0x0000)
struct BP_Projector_Clue_Mesh_Fx_Born_C_ExecuteUbergraph_BP_Projector_Clue_Mesh_Fx_Born final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D4[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_DynamicCast_AsAk_Audio_Event;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isAppear_;                            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D5[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BP_Projector_Clue_Mesh_Fx_Born.BP_Projector_Clue_Mesh_Fx_Born_C.OnLoaded_8E49EA1D412D130E745424BAA2938FF6
// 0x0008 (0x0008 - 0x0000)
struct BP_Projector_Clue_Mesh_Fx_Born_C_OnLoaded_8E49EA1D412D130E745424BAA2938FF6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

