#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projector_Anomaly

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projector_Anomaly.BP_Projector_Anomaly_C
// 0x0110 (0x0DB0 - 0x0CA0)
class ABP_Projector_Anomaly_C final : public AHTPockmonActor
{
public:
	uint8                                         Pad_5BB0[0x8];                                     // 0x0C98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_MassObstacleAgentComponent_C*       BP_MassObstacleAgentComponent;                     // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    NS_Hint;                                           // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    NS_RefreshLight;                                   // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTNiagaraComponent*                    HTNiagara;                                         // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       TeachGuideTrigger;                                 // 0x0CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTDialogueComponent*                   HTDialogue;                                        // 0x0CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       DlgSphere;                                         // 0x0CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NSAppear______0_21E8C74140DD73A3F02E159B76C6CFA2; // 0x0CE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_NSAppear__Direction_21E8C74140DD73A3F02E159B76C6CFA2; // 0x0CEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB1[0x3];                                     // 0x0CED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_NSAppear;                                 // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 In_Vision_ID;                                      // 0x0CF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   ProjectorSeq;                                      // 0x0D08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Projector_Range_C*                  ProjectorRange;                                    // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class ABP_Projector_Clue_C>> SoftProjectorClues;                                // 0x0D18(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_Projector_Clue_C*>           ProjectorClues;                                    // 0x0D28(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ACineCameraActor*                       ProjectorCamera;                                   // 0x0D38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       ProjectorCameraTips;                               // 0x0D40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       ProjectorCameraEnd;                                // 0x0D48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_First_Play_;                                    // 0x0D50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCluesFound_;                                     // 0x0D51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB2[0x6];                                     // 0x0D52(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   LevelSeqencePlayer;                                // 0x0D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHTUI_LevelSequencePlayer*              ProjectorPlayer;                                   // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        AppearTime;                                        // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraBlendTime;                                   // 0x0D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ProjectorSeqTime;                                  // 0x0D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TipsTime;                                          // 0x0D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ForwardAudioEvent;                                 // 0x0D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          BackAudioEvent;                                    // 0x0D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           In_Msgs;                                           // 0x0D98(0x0010)(Edit, BlueprintVisible)
	bool                                          IsProjectorLPPlaying_;                             // 0x0DA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Speed_Up_;                                      // 0x0DA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BB3[0x2];                                     // 0x0DAA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NowFrame;                                          // 0x0DAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_TimelineManager_HTDialogue_K2Node_ComponentBoundEvent_0_OnDialogueEventDelegate__DelegateSignature(class FName InParticipant, class FName InEventName);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void BPOnMainRoleLoadFinished(class AHTPlayerState* PlayerState);
	void Completed_049CD56E4F4FC49AC8444B8257F9CBFE(class UCommonActivatableWidget* WidgetObject);
	void Completed_4AD0DDEC45E60AE8DF87CFB1C55FA94C(class UCommonActivatableWidget* WidgetObject);
	void Contain();
	void DestroyGameplay();
	void ExecuteUbergraph_BP_Projector_Anomaly(int32 EntryPoint);
	void FirstPlay();
	void FirstplayFinished(bool IsReversing);
	void GetSoftClues();
	void IgnoreInput(double ProtectTime);
	void Initialize();
	void NiagaraFrequence(bool IsSpeedUp_);
	void OnLoaded_18F84D3F495AFDE58FCEE4B5C1197984(class UObject* Loaded);
	void OnLoaded_27F9BD91473A474C2FFAB8A10C157240(class UObject* Loaded);
	void OnLoaded_314643094ED022DB75F2E3A1BA334EF0(class UObject* Loaded);
	void OnLoaded_33573AFD4385C2B3078D3E9073B8A420(class UObject* Loaded);
	void OnLoaded_5A1369C24D2D307684A276A4B5F098BF(class UObject* Loaded);
	void OnLoaded_751E429D484F06E481D594AF3152AF56(class UObject* Loaded);
	void OnLoaded_A9820F634C58467B0D14F5820F0FA9E9(class UObject* Loaded);
	void OnLoaded_EBB12444469C53EF34EB34895C60BA1A(class UObject* Loaded);
	void PlayProjectorLoopAudio(bool Play_);
	void PlaySeqAudio(class UHTUI_LevelSequencePlayer* Sequence);
	void RepeatPlay();
	void RepeatPlayFinished();
	void ReverseProjectorSeq();
	void ReverseSequence();
	void Timeline_NSAppear__FinishedFunc();
	void Timeline_NSAppear__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projector_Anomaly_C">();
	}
	static class ABP_Projector_Anomaly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projector_Anomaly_C>();
	}
};

}

