#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RainManCameraRotator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RainManCameraRotator.BP_RainManCameraRotator_C
// 0x0070 (0x0B80 - 0x0B10)
class ABP_RainManCameraRotator_C : public AHTVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseReturn_Blur_54557C56443DE8424CBF9D9B7C0D91BB; // 0x0B20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseReturn_Rain_54557C56443DE8424CBF9D9B7C0D91BB; // 0x0B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseReturn_LerpReverse_54557C56443DE8424CBF9D9B7C0D91BB; // 0x0B28(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseReturn_ScreenWave_54557C56443DE8424CBF9D9B7C0D91BB; // 0x0B2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ReverseReturn__Direction_54557C56443DE8424CBF9D9B7C0D91BB; // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6110[0x7];                                     // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ReverseReturn;                                     // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseCamera_Drips_33EF9C814E1A625EF922BCB81AF17963; // 0x0B40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseCamera_Wave_33EF9C814E1A625EF922BCB81AF17963; // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseCamera_BlurCureve_33EF9C814E1A625EF922BCB81AF17963; // 0x0B48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReverseCamera_Reverse1_33EF9C814E1A625EF922BCB81AF17963; // 0x0B4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ReverseCamera__Direction_33EF9C814E1A625EF922BCB81AF17963; // 0x0B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6111[0x7];                                     // 0x0B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ReverseCamera;                                     // 0x0B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bReverse;                                          // 0x0B60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6112[0x7];                                     // 0x0B61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       FollowCamera;                                      // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHTPlayerCharacter*                     PlayerCharacter;                                   // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_RainManLake_C*                      RainManLake;                                       // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__NewBlueprint_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ExecuteUbergraph_BP_RainManCameraRotator(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReverseCamera__BeReverse__EventFunc();
	void ReverseCamera__FinishedFunc();
	void ReverseCamera__UpdateFunc();
	void ReverseReturn__FinishedFunc();
	void ReverseReturn__OnReverse__EventFunc();
	void ReverseReturn__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RainManCameraRotator_C">();
	}
	static class ABP_RainManCameraRotator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RainManCameraRotator_C>();
	}
};

}

