#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Seat_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Seat_Base.BP_Seat_Base_C
// 0x0078 (0x0B88 - 0x0B10)
class ABP_Seat_Base_C : public AHTSeatActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0B18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0B20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ChairMesh;                                         // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTSmartObjectComponent*                HTSmartObject;                                     // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Interact;                                          // 0x0B38(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FHTBreakStateRequest                   In_Request;                                        // 0x0B48(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BPGetInteractEntries(class AHTPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void BPInteractFinished(class AHTPlayerController* ByPC, int32 InteractIndex);
	void ExecuteUbergraph_BP_Seat_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Seat_Base_C">();
	}
	static class ABP_Seat_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Seat_Base_C>();
	}
};

}

