#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SolareClipse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SolareClipse.BP_SolareClipse_C
// 0x0128 (0x04C0 - 0x0398)
class ABP_SolareClipse_C final : public ASolareClipse
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass;                   // 0x03A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass_Two;               // 0x03D0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass_Three;             // 0x03F8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass_Four;              // 0x0420(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass_Five;              // 0x0448(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass_Six;               // 0x0470(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   EnvironmentChangeVolumeOneClass_Seven;             // 0x0498(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SolareClipse(int32 EntryPoint);
	void InitVolume();
	void OnLoaded_035778F240286C47FC8D7C8CE7D92106(TSubclassOf<class UObject> Loaded);
	void OnLoaded_224FD41B44E2229C71DE0A8A0C650B20(TSubclassOf<class UObject> Loaded);
	void OnLoaded_2CFBC08B4D2DE2B6BE9275B09F0AFE25(TSubclassOf<class UObject> Loaded);
	void OnLoaded_78475ABC47D60786FB7497B699176E1F(TSubclassOf<class UObject> Loaded);
	void OnLoaded_95EFEDC947517D12BFDD4FA49F0C73C8(TSubclassOf<class UObject> Loaded);
	void OnLoaded_A352304B4A1AFCA52E578DAB04BF9B9B(TSubclassOf<class UObject> Loaded);
	void OnLoaded_A6DA212449794ED83A8860953E8E760D(TSubclassOf<class UObject> Loaded);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void TestInit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SolareClipse_C">();
	}
	static class ABP_SolareClipse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SolareClipse_C>();
	}
};

}

