#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TalkBubble_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TalkBubble_Base.BP_TalkBubble_Base_C
// 0x0088 (0x0BA8 - 0x0B20)
class ABP_TalkBubble_Base_C : public AHTTalkBubbleTriggerActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPBubbleComponent_C*                   BPBubbleComponent;                                 // 0x0B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FNPCMsgID>                      bubbletext;                                        // 0x0B40(0x0010)(Edit, BlueprintVisible)
	TArray<class ABP_SimpleNPC_Base_C*>           NPC;                                               // 0x0B50(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FVector>                        bubblelocation;                                    // 0x0B60(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bubbleing;                                         // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C8[0x3];                                     // 0x0B71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CD;                                                // 0x0B74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsmissNpc;                                         // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C9[0x7];                                     // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayTime;                                         // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHTSimpleSceneActor*>            NewVar;                                            // 0x0B88(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AHTSimpleSceneActor*>            SpawnedSimpleNpcs;                                 // 0x0B98(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void BndEvt__BP_TalkBubble_Base_Sphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__trinitybubble_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CustomEvent_0(class AHTSimpleSceneActor* SelfActor, ESimpleNPCSpecialState InSpecialState);
	void ExecuteUbergraph_BP_TalkBubble_Base(int32 EntryPoint);
	TArray<class AHTSimpleSceneActor*> GetConfigedRelatedSimpleSceneActors();
	void GetRelatedNpc(bool* bSuccess, TArray<class AHTSimpleSceneActor*>* Npcs);
	void Setlocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TalkBubble_Base_C">();
	}
	static class ABP_TalkBubble_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TalkBubble_Base_C>();
	}
};

}

