#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Vehicle_Bus_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Vehicle_Bus_Base.BP_Vehicle_Bus_Base_C
// 0x0068 (0x09F8 - 0x0990)
class ABP_Vehicle_Bus_Base_C : public AHTMassTrafficBus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0990(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHTInteractableSphereComponent*         GetOnVehicle;                                      // 0x0998(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticBusMesh;                                     // 0x09A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleEffectComponent_C*           BP_VehicleEffectComponent;                         // 0x09A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BackLight;                                         // 0x09B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UHTFadeComponent*                       HTFade;                                            // 0x09B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_R;                                      // 0x09C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   FrontLight_L;                                      // 0x09C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleInteractComponent_C*         BP_VehicleInteractComponent_FL;                    // 0x09D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_VehicleInteractComponent_C*         BP_VehicleInteractComponent_FR;                    // 0x09D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UVehicleDeformableComponent*            VehicleDeformable;                                 // 0x09E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentHitInterval;                                // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinHitInterval;                                    // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BPCall_CloseDoor();
	void BPCall_OpenDoor();
	void BPCall_OperateDoubleFlash(bool TurnOn);
	void BPCall_OperateFrontLights(bool TurnOn);
	void BPCall_StartEngine();
	void BPCall_StartTireNoise();
	void BPCall_StartTireSkip();
	void BPCall_StopEngine();
	void BPCall_StopTireNoise();
	void BPCall_StopTireSkip();
	void BPCall_SwitchFPP();
	void BPCall_SwitchTPP();
	void BPCall_VehicleMoveGroundChanged(const class FName& GroundTypeName);
	void ExecuteUbergraph_BP_Vehicle_Bus_Base(int32 EntryPoint);
	void HandleHandbrakeStart();
	void HandleHandbrakeStop();
	void HandleOnBrakeStart();
	void HandleOnBrakeStop();
	void HandleOnReverseStart();
	void HandleOnReverseStop();
	void HandleTurnLeftStart();
	void HandleTurnLeftStop();
	void HandleTurnRightStart();
	void HandleTurnRightStop();
	void InitVehicleLights();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Vehicle_Bus_Base_C">();
	}
	static class ABP_Vehicle_Bus_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Vehicle_Bus_Base_C>();
	}
};

}

