#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_FluxWaveRenderer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_FluxWaveRenderer.BPI_FluxWaveRenderer_C.CanRenderWave
// 0x0001 (0x0001 - 0x0000)
struct BPI_FluxWaveRenderer_C_CanRenderWave final
{
public:
	bool                                          CanRender;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_FluxWaveRenderer.BPI_FluxWaveRenderer_C.GetWaveTextureMaterials
// 0x0010 (0x0010 - 0x0000)
struct BPI_FluxWaveRenderer_C_GetWaveTextureMaterials final
{
public:
	TArray<class UMaterialInstanceDynamic*>       MaterialInstances;                                 // 0x0000(0x0010)(Parm, OutParm)
};

// Function BPI_FluxWaveRenderer.BPI_FluxWaveRenderer_C.SetWaveProfile
// 0x0008 (0x0008 - 0x0000)
struct BPI_FluxWaveRenderer_C_SetWaveProfile final
{
public:
	class UPDA_FluxWaveProfile_C*                 Profile;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

// Function BPI_FluxWaveRenderer.BPI_FluxWaveRenderer_C.SetWaveTextureAndArea
// 0x0018 (0x0018 - 0x0000)
struct BPI_FluxWaveRenderer_C_SetWaveTextureAndArea final
{
public:
	class UTextureRenderTarget2D*                 Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Area;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

