#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SkillController

#include "Basic.hpp"

#include "HTGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_SkillController.BPUI_SkillController_C.BP_SetImage
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillController_C_BP_SetImage final
{
public:
	ESetSkillControllerImageType                  ImageType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPUI_SkillController.BPUI_SkillController_C.ExecuteUbergraph_BPUI_SkillController
// 0x01B0 (0x01B0 - 0x0000)
struct BPUI_SkillController_C_ExecuteUbergraph_BPUI_SkillController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESetSkillControllerImageType                  K2Node_Event_ImageType;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5B[0x9];                                     // 0x0007(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00E0(0x00D0)()
};

// Function BPUI_SkillController.BPUI_SkillController_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPUI_SkillController_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

