#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_VisionAward

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "HTGame_structs.hpp"
#include "StructUtilsEngine_structs.hpp"


namespace SDK::Params
{

// Function BPUI_VisionAward.BPUI_VisionAward_C.BP_SetVisionInfo
// 0x0228 (0x0228 - 0x0000)
struct BPUI_VisionAward_C_BP_SetVisionInfo final
{
public:
	struct FVisionData                            VisionData;                                        // 0x0000(0x0228)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// Function BPUI_VisionAward.BPUI_VisionAward_C.ExecuteUbergraph_BPUI_VisionAward
// 0x03D8 (0x03D8 - 0x0000)
struct BPUI_VisionAward_C_ExecuteUbergraph_BPUI_VisionAward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVisionData                            K2Node_Event_VisionData;                           // 0x0040(0x0228)(ConstParm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVisionCategoryData                    CallFunc_GetVisionCategoryData_ReturnValue;        // 0x0270(0x0090)(ConstParm)
	class FString                                 CallFunc_Int32ToRoman_ReturnValue;                 // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0310(0x0010)()
	EStructUtilsResult                            CallFunc_GetInstancedStructValue_ExecResult;       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52A9[0x7];                                     // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVisionCategoryDisplayData             CallFunc_GetInstancedStructValue_Value;            // 0x0328(0x0048)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52AA[0x7];                                     // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVisionPropertyData                    CallFunc_GetVisionPropertyData_ReturnValue;        // 0x0378(0x0040)(ConstParm)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52AB[0x7];                                     // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52AC[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPUI_VisionAward.BPUI_VisionAward_C.SetAnimPlaySpeed
// 0x0008 (0x0008 - 0x0000)
struct BPUI_VisionAward_C_SetAnimPlaySpeed final
{
public:
	double                                        InSpeed;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPUI_VisionAward.BPUI_VisionAward_C.SetTextWithDiffColor
// 0x0038 (0x0038 - 0x0000)
struct BPUI_VisionAward_C_SetTextWithDiffColor final
{
public:
	class UTextBlock*                             InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   CallFunc_GetVisionID_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetVisionFontColor_ReturnValue;           // 0x0020(0x0014)()
};

// Function BPUI_VisionAward.BPUI_VisionAward_C.Tick
// 0x003C (0x003C - 0x0000)
struct BPUI_VisionAward_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

