#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPUI_SupplyShortcut

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.CloseQuickFoodMenu
// 0x0010 (0x0010 - 0x0000)
struct BPUI_SupplyShortcut_C_CloseQuickFoodMenu final
{
public:
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReleaseCommandMenus_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.ExecuteUbergraph_BPUI_SupplyShortcut
// 0x0058 (0x0058 - 0x0000)
struct BPUI_SupplyShortcut_C_ExecuteUbergraph_BPUI_SupplyShortcut final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F7B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_1;                        // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0038(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamepadInputType_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.InpActEvt_Gamepad_Special_Left_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BPUI_SupplyShortcut_C_InpActEvt_Gamepad_Special_Left_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.InpActEvt_Gamepad_Special_Left_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BPUI_SupplyShortcut_C_InpActEvt_Gamepad_Special_Left_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};

// Function BPUI_SupplyShortcut.BPUI_SupplyShortcut_C.OpenQuickFoodMenu
// 0x0020 (0x0020 - 0x0000)
struct BPUI_SupplyShortcut_C_OpenQuickFoodMenu final
{
public:
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamepadInputType_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F7C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F7D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHTUINavigationSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

