#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CitySampleMassCrowd

#include "Basic.hpp"

#include "MassRepresentation_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "MassEntity_classes.hpp"
#include "CitySampleMassCrowd_structs.hpp"
#include "MassCrowd_classes.hpp"
#include "Engine_classes.hpp"
#include "MassSmartObjects_classes.hpp"


namespace SDK
{

// Class CitySampleMassCrowd.CitySampleDebugVisProcessor
// 0x02B0 (0x0370 - 0x00C0)
class UCitySampleDebugVisProcessor final : public UMassProcessor
{
public:
	float                                         AgentRadiusToUse;                                  // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2802[0x2AC];                                   // 0x00C4(0x02AC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CitySampleDebugVisProcessor">();
	}
	static class UCitySampleDebugVisProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCitySampleDebugVisProcessor>();
	}
};

// Class CitySampleMassCrowd.CitySampleDisplayEntitiesProcessor
// 0x0018 (0x00D8 - 0x00C0)
class UCitySampleDisplayEntitiesProcessor final : public UMassProcessor
{
public:
	TArray<struct FCitySampleDisplayEntitiesConfig> DisplayConfigs;                                    // 0x00C0(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	class UMassRepresentationSubsystem*           RepresentationSubsystem;                           // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CitySampleDisplayEntitiesProcessor">();
	}
	static class UCitySampleDisplayEntitiesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCitySampleDisplayEntitiesProcessor>();
	}
};

// Class CitySampleMassCrowd.CitySampleMassCrowdRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UCitySampleMassCrowdRepresentationActorManagement final : public UMassCrowdRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CitySampleMassCrowdRepresentationActorManagement">();
	}
	static class UCitySampleMassCrowdRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCitySampleMassCrowdRepresentationActorManagement>();
	}
};

// Class CitySampleMassCrowd.MassCrowdActorInterface
// 0x0000 (0x0028 - 0x0028)
class IMassCrowdActorInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdActorInterface">();
	}
	static class IMassCrowdActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMassCrowdActorInterface>();
	}
};

// Class CitySampleMassCrowd.MassCrowdAnimationSettings
// 0x0020 (0x0048 - 0x0028)
class UMassCrowdAnimationSettings final : public UMassModuleSettings
{
public:
	TArray<int32>                                 CrowdAnimFootLODTraceFrequencyPerLOD;              // 0x0028(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TArray<class FName>                           CommonCrowdContextualAnimNames;                    // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static TArray<class FString> GetContextualAnimOptions();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdAnimationSettings">();
	}
	static class UMassCrowdAnimationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdAnimationSettings>();
	}
};

// Class CitySampleMassCrowd.MassCrowdAnimInstance
// 0x0150 (0x04C0 - 0x0370)
class UMassCrowdAnimInstance : public UAnimInstance
{
public:
	struct FMassCharacterProximity_AnimInput      PlayerProximityData;                               // 0x0368(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassCharacterStopPrediction_AnimInput StopPredictionData;                                // 0x03D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassCharacterMovementInfo_AnimInput   MassMovementInfo;                                  // 0x03D8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bDoFootTraces;                                     // 0x03F8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2803[0x7];                                     // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassCrowdAnimInstanceData             MassCrowdAnimInstanceData;                         // 0x0400(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2804[0x10];                                    // 0x04B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdAnimInstance">();
	}
	static class UMassCrowdAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdAnimInstance>();
	}
};

// Class CitySampleMassCrowd.MassCrowdContextualAnimationDataAsset
// 0x0050 (0x0080 - 0x0030)
class UMassCrowdContextualAnimationDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FMassCrowdContextualAnimDescription> AnimsMap;                                          // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdContextualAnimationDataAsset">();
	}
	static class UMassCrowdContextualAnimationDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdContextualAnimationDataAsset>();
	}
};

// Class CitySampleMassCrowd.MassCrowdUpdateISMVertexAnimationProcessor
// 0x0000 (0x0360 - 0x0360)
class UMassCrowdUpdateISMVertexAnimationProcessor final : public UMassUpdateISMProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdUpdateISMVertexAnimationProcessor">();
	}
	static class UMassCrowdUpdateISMVertexAnimationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdUpdateISMVertexAnimationProcessor>();
	}
};

// Class CitySampleMassCrowd.MassPlayerAnimInstance
// 0x0060 (0x03D0 - 0x0370)
class UMassPlayerAnimInstance final : public UAnimInstance
{
public:
	struct FMassCharacterProximity_AnimInput      CrowdProximity;                                    // 0x0368(0x0068)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassPlayerAnimInstance">();
	}
	static class UMassPlayerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassPlayerAnimInstance>();
	}
};

// Class CitySampleMassCrowd.SmartObjectMassInteractionDefinition
// 0x0018 (0x0048 - 0x0030)
class USmartObjectMassInteractionDefinition final : public USmartObjectMassBehaviorDefinition
{
public:
	class UContextualAnimSceneAsset*              ContextualAnimAsset;                               // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AlignmentTrack;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   InteractorRole;                                    // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectMassInteractionDefinition">();
	}
	static class USmartObjectMassInteractionDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectMassInteractionDefinition>();
	}
};

}

