#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DamageActorFemaleSkill1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DamageTriggerActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DamageActorFemaleSkill1.DamageActorFemaleSkill1_C
// 0x0038 (0x05B0 - 0x0578)
class ADamageActorFemaleSkill1_C final : public ABP_DamageTriggerActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_NewTrack_0_F3D7186F499CFD57E5E0C7BC1EE6A046; // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_F3D7186F499CFD57E5E0C7BC1EE6A046; // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A2[0x3];                                     // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AMonsterCharacterBase_C*>        ControlledMonster;                                 // 0x0598(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        PlaySpeed;                                         // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline__UpdateFunc();
	void Timeline__FinishedFunc();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_DamageActorFemaleSkill1(int32 EntryPoint);
	void BndEvt__DamageActorFemaleSkill1_Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DamageActorFemaleSkill1_C">();
	}
	static class ADamageActorFemaleSkill1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADamageActorFemaleSkill1_C>();
	}
};

}

