#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DlgSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "DlgSystem_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DlgSystem.DlgConditionCustom.GetEditorDisplayString
// 0x0020 (0x0020 - 0x0000)
struct DlgConditionCustom_GetEditorDisplayString final
{
public:
	class UDlgDialogue*                           OwnerDialogue;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParticipantName;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgConditionCustom.IsConditionMet
// 0x0018 (0x0018 - 0x0000)
struct DlgConditionCustom_IsConditionMet final
{
public:
	const class UDlgContext*                      Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Participant;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ABB[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.ChooseChild
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseChild final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ABD[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.ChooseOption
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseOption final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ABE[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.ChooseOptionFromAll
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseOptionFromAll final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ABF[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.ChooseSpeechSequenceOptionFromReplicated
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseSpeechSequenceOptionFromReplicated final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC0[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.GetParticipantFromName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetParticipantFromName final
{
public:
	struct FDlgParticipantName                    Participant;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.ReevaluateChildren
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_ReevaluateChildren final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.ReevaluateOptions
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_ReevaluateOptions final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeData
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeData final
{
public:
	class UDlgNodeData*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeGenericData
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeGenericData final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeGUID
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetActiveNodeGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeIndex
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetActiveNodeIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeIsSelfTalk
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_GetActiveNodeIsSelfTalk final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeParticipant
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetActiveNodeParticipant final
{
public:
	bool                                          bLog;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC1[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeParticipantDisplayName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetActiveNodeParticipantDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeParticipantIcon
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeParticipantIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeParticipantName
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeParticipantName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeShowButtonWaitTime
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetActiveNodeShowButtonWaitTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeSkipOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetActiveNodeSkipOptionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeSpeakerState
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeSpeakerState final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeText
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetActiveNodeText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeVoiceDialogueWave
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeVoiceDialogueWave final
{
public:
	class UDialogueWave*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeVoiceSoundBase
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeVoiceSoundBase final
{
public:
	class USoundBase*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetActiveNodeVoiceSoundWave
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeVoiceSoundWave final
{
public:
	class USoundWave*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetAllOptionsArray
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetAllOptionsArray final
{
public:
	TArray<struct FDlgEdgeData>                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetAllOptionsNum
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetAllOptionsNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetAutoPlayConfig
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetAutoPlayConfig final
{
public:
	struct FDlgAutoPlayConfig                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetAvailableIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetAvailableIndex final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetBlackFade
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_GetBlackFade final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetContextString
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetContextString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetDialogue
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetDialogue final
{
public:
	class UDlgDialogue*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetDialogueGUID
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetDialogueGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetDialogueName
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetDialogueName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetDialoguePathName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetDialoguePathName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetMutableActiveNode
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetMutableActiveNode final
{
public:
	class UDlgNode*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetMutableActiveNodeAsSpeechSequence
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetMutableActiveNodeAsSpeechSequence final
{
public:
	class UDlgNode_SpeechSequence*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetMutableNodeFromGUID
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetMutableNodeFromGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgNode*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetMutableNodeFromIndex
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetMutableNodeFromIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC2[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgNode*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetMutableParticipant
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetMutableParticipant final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetNickname
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetNickname final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetNodeGUIDForIndex
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_GetNodeGUIDForIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetNodeIndexForGUID
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_GetNodeIndexForGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOption
// 0x00F8 (0x00F8 - 0x0000)
struct DlgContext_GetOption final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgEdge                               ReturnValue;                                       // 0x0008(0x00F0)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionalButtonBottom
// 0x0030 (0x0030 - 0x0000)
struct DlgContext_GetOptionalButtonBottom final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC4[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionalButtonIcon
// 0x0030 (0x0030 - 0x0000)
struct DlgContext_GetOptionalButtonIcon final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionButtonRenderTransform
// 0x0040 (0x0040 - 0x0000)
struct DlgContext_GetOptionButtonRenderTransform final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWidgetTransform                       ReturnValue;                                       // 0x0008(0x0038)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionEnterConditions
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetOptionEnterConditions final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgCondition>                  ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionFromAll
// 0x0100 (0x0100 - 0x0000)
struct DlgContext_GetOptionFromAll final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgEdgeData                           ReturnValue;                                       // 0x0008(0x00F8)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionsArray
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetOptionsArray final
{
public:
	TArray<struct FDlgEdge>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionsNum
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetOptionsNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionSpeakerState
// 0x000C (0x000C - 0x0000)
struct DlgContext_GetOptionSpeakerState final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionSpeakerStateFromAll
// 0x000C (0x000C - 0x0000)
struct DlgContext_GetOptionSpeakerStateFromAll final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionText
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetOptionText final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AC9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOptionTextFromAll
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetOptionTextFromAll final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ACA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOverrideJustify
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_GetOverrideJustify final
{
public:
	ETextJustify                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOverrideSelfName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetOverrideSelfName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetOverrideSpeakerName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetOverrideSpeakerName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetParticipants
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetParticipants final
{
public:
	TMap<class FName, class UObject*>             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetParticipantsMap
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetParticipantsMap final
{
public:
	TMap<class FName, class UObject*>             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetSequenceActorConfigs
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetSequenceActorConfigs final
{
public:
	TArray<struct FDlgSequenceActorConfig>        ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetSequenceConfig
// 0x0150 (0x0150 - 0x0000)
struct DlgContext_GetSequenceConfig final
{
public:
	struct FDlgSequence                           ReturnValue;                                       // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetVisitedNodeGUIDs
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetVisitedNodeGUIDs final
{
public:
	TSet<struct FGuid>                            ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.GetVisitedNodeIndices
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetVisitedNodeIndices final
{
public:
	TSet<int32>                                   ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.HasDialogueEnded
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_HasDialogueEnded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsActiveNodeCanAutoContinue
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsActiveNodeCanAutoContinue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsActiveNodeCanSkip
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsActiveNodeCanSkip final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsActiveNodeEventNode
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsActiveNodeEventNode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsActiveNodeInEndDlg
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsActiveNodeInEndDlg final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsForceMainAvatar
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsForceMainAvatar final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsForceShowOptionalButton
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsForceShowOptionalButton final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ACB[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsForceWalk
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsForceWalk final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsHideName
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsHideName final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsHideUI
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsHideUI final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsNeedFaceToTarget
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsNeedFaceToTarget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsNextNodeEnd
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_IsNextNodeEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgContext.IsNodeVisited
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_IsNodeVisited final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NodeGuid;                                          // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalHistory;                                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ACC[0x2];                                     // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsOptionConnectedToEndNode
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsOptionConnectedToEndNode final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIndexSkipsUnsatisfiedEdges;                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ACD[0x2];                                     // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsOptionConnectedToVisitedNode
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsOptionConnectedToVisitedNode final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalHistory;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIndexSkipsUnsatisfiedEdges;                       // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ACE[0x1];                                     // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsOptionSatisfied
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsOptionSatisfied final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ACF[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsValidAllOptionIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsValidAllOptionIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD0[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsValidNodeGUID
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_IsValidNodeGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD1[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsValidNodeIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsValidNodeIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD2[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.IsValidOptionIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsValidOptionIndex final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD3[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.WasNodeGUIDVisitedInThisContext
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_WasNodeGUIDVisitedInThisContext final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD4[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgContext.WasNodeIndexVisitedInThisContext
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_WasNodeIndexVisitedInThisContext final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AD5[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function DlgSystem.DlgDialogue.GetMutableStartNodes
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetMutableStartNodes final
{
public:
	TArray<class UDlgNode*>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetAllParticipantNames
// 0x0050 (0x0050 - 0x0000)
struct DlgDialogue_GetAllParticipantNames final
{
public:
	TSet<class FName>                             Outset;                                            // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetAllSpeakerStates
// 0x0050 (0x0050 - 0x0000)
struct DlgDialogue_GetAllSpeakerStates final
{
public:
	TSet<class FName>                             Outset;                                            // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetClassBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetClassFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetClassIntNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassIntNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetClassNameNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassNameNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetClassTextNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassTextNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetConditions
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetConditions final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetCustomEvents
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetCustomEvents final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetDialogueFName
// 0x0008 (0x0008 - 0x0000)
struct DlgDialogue_GetDialogueFName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetDialogueName
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetDialogueName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetDialogueVersion
// 0x0004 (0x0004 - 0x0000)
struct DlgDialogue_GetDialogueVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetEvents
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetEvents final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetGUID
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetIntNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetIntNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetMutableNodeFromGUID
// 0x0018 (0x0018 - 0x0000)
struct DlgDialogue_GetMutableNodeFromGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgNode*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetMutableNodeFromIndex
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetMutableNodeFromIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2ADA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgNode*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetMutableStartNode
// 0x0008 (0x0008 - 0x0000)
struct DlgDialogue_GetMutableStartNode final
{
public:
	class UDlgNode*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetNameNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetNameNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetNodeGUIDForIndex
// 0x0014 (0x0014 - 0x0000)
struct DlgDialogue_GetNodeGUIDForIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetNodeIndexForGUID
// 0x0014 (0x0014 - 0x0000)
struct DlgDialogue_GetNodeIndexForGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetNodes
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetNodes final
{
public:
	TArray<class UDlgNode*>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetParticipantBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetParticipantClass
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetParticipantClass final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetParticipantClassBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetParticipantClasses
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetParticipantClasses final
{
public:
	TArray<struct FDlgParticipantClass>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function DlgSystem.DlgDialogue.GetParticipantClassFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
