#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FootIK_AnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FootIK_AnimLayer.FootIK_AnimLayer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct FootIK_AnimLayer_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function FootIK_AnimLayer.FootIK_AnimLayer_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct FootIK_AnimLayer_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FootIK_AnimLayer.FootIK_AnimLayer_C.ExecuteUbergraph_FootIK_AnimLayer
// 0x0008 (0x0008 - 0x0000)
struct FootIK_AnimLayer_C_ExecuteUbergraph_FootIK_AnimLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function FootIK_AnimLayer.FootIK_AnimLayer_C.FootIKLayer
// 0x0020 (0x0020 - 0x0000)
struct FootIK_AnimLayer_C_FootIKLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_FootIKLayer;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

