#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HierarchicalInstanced

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HierarchicalInstanced_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HierarchicalInstanced.HierarchicalInstancedActor
// 0x0000 (0x02A0 - 0x02A0)
class AHierarchicalInstancedActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HierarchicalInstancedActor">();
	}
	static class AHierarchicalInstancedActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHierarchicalInstancedActor>();
	}
};

// Class HierarchicalInstanced.HierarchicalInstancedSettings
// 0x0068 (0x0090 - 0x0028)
class UHierarchicalInstancedSettings final : public UObject
{
public:
	float                                         HISMRelevantDistance;                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinNumberOfActorsToInstanced;                      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CullScreenSize;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipMeshesWithVertexColors;                       // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisallowNanite;                                   // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInstanceActorsUsingLocation;                      // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInstancedTargetAreaFlags                     InstancedTarget;                                   // 0x0037(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UseISMCSizeThreshold;                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D0E[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           IncludeRuntimeGrids;                               // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludeRuntimeGrids;                               // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           IncludeDataLayers;                                 // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ExcludeDataLayers;                                 // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         MaxMeshBound;                                      // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipMeshesWithBreakableMesh;                      // 0x0084(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D0F[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UAssetUserData>             BreakeAssetUserData;                               // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HierarchicalInstancedSettings">();
	}
	static class UHierarchicalInstancedSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHierarchicalInstancedSettings>();
	}
};

// Class HierarchicalInstanced.HISMComponent
// 0x0000 (0x0B10 - 0x0B10)
class UHISMComponent final : public UHierarchicalInstancedStaticMeshComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HISMComponent">();
	}
	static class UHISMComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHISMComponent>();
	}
};

}

