#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaFramework

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CommonGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModularGameplayActors_classes.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK
{

// Class HottaFramework.AsyncAction_ListenForGameplayMessage
// 0x0050 (0x0080 - 0x0030)
class UAsyncAction_ListenForGameplayMessage final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnMessageReceived;                                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D7[0x40];                                    // 0x0040(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForGameplayMessage* ListenForGameplayMessages(class UObject* WorldContextObject, class FName Channel, class UScriptStruct* PayloadType);

	bool GetPayload(int32& OutPayload);
	void UnregisterListener();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForGameplayMessage">();
	}
	static class UAsyncAction_ListenForGameplayMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForGameplayMessage>();
	}
};

// Class HottaFramework.AsyncAction_ListenForGameplayMessageWithSimpleMessage
// 0x0040 (0x0070 - 0x0030)
class UAsyncAction_ListenForGameplayMessageWithSimpleMessage final : public UBlueprintAsyncActionBase
{
public:
	FMulticastInlineDelegateProperty_             OnMessageReceived;                                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D9[0x30];                                    // 0x0040(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_ListenForGameplayMessageWithSimpleMessage* ListenForGameplayMessagesWithSimpleMessage(class UObject* WorldContextObject, class FName Channel);

	void UnregisterListener();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_ListenForGameplayMessageWithSimpleMessage">();
	}
	static class UAsyncAction_ListenForGameplayMessageWithSimpleMessage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_ListenForGameplayMessageWithSimpleMessage>();
	}
};

// Class HottaFramework.GameplayMessageSubsystem
// 0x0058 (0x0088 - 0x0030)
class UGameplayMessageSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_31DA[0x58];                                    // 0x0030(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void K2_BroadcastMessage(class FName Channel, const int32& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayMessageSubsystem">();
	}
	static class UGameplayMessageSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayMessageSubsystem>();
	}
};

// Class HottaFramework.GameplayMessageSubsystemStatic
// 0x0000 (0x0028 - 0x0028)
class UGameplayMessageSubsystemStatic final : public UObject
{
public:
	static int32 GetSimpleMessageBoolValue(const struct FGameplayMessageSimpleMessage& InStruct);
	static float GetSimpleMessageFloatValue(const struct FGameplayMessageSimpleMessage& InStruct);
	static int32 GetSimpleMessageIntValue(const struct FGameplayMessageSimpleMessage& InStruct);
	static class FString GetSimpleMessageStringValue(const struct FGameplayMessageSimpleMessage& InStruct);
	static struct FGameplayMessageSimpleMessage MakeLiteralSimpleMessageWithBool(bool InValue);
	static struct FGameplayMessageSimpleMessage MakeLiteralSimpleMessageWithFloat(float InValue);
	static struct FGameplayMessageSimpleMessage MakeLiteralSimpleMessageWithInt(int32 InValue);
	static struct FGameplayMessageSimpleMessage MakeLiteralSimpleMessageWithString(const class FString& InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameplayMessageSubsystemStatic">();
	}
	static class UGameplayMessageSubsystemStatic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameplayMessageSubsystemStatic>();
	}
};

// Class HottaFramework.HottaCharacter
// 0x0000 (0x0680 - 0x0680)
class AHottaCharacter : public AModularCharacter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaCharacter">();
	}
	static class AHottaCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHottaCharacter>();
	}
};

// Class HottaFramework.HottaDPICustomScalingRule
// 0x0000 (0x0028 - 0x0028)
class UHottaDPICustomScalingRule final : public UDPICustomScalingRule
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaDPICustomScalingRule">();
	}
	static class UHottaDPICustomScalingRule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHottaDPICustomScalingRule>();
	}
};

// Class HottaFramework.HottaGameMode
// 0x0010 (0x0390 - 0x0380)
class AHottaGameMode : public AModularGameMode
{
public:
	EGameModeType                                 GameModeType;                                      // 0x0380(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31E1[0xF];                                     // 0x0381(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaGameMode">();
	}
	static class AHottaGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHottaGameMode>();
	}
};

// Class HottaFramework.HottaGameState
// 0x0078 (0x0398 - 0x0320)
class AHottaGameState : public AModularGameState
{
public:
	uint8                                         Pad_31E2[0x78];                                    // 0x0320(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaGameState">();
	}
	static class AHottaGameState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHottaGameState>();
	}
};

// Class HottaFramework.HottaLocalPlayer
// 0x00C0 (0x03C0 - 0x0300)
class UHottaLocalPlayer : public UCommonLocalPlayer
{
public:
	uint8                                         Pad_31E3[0xC0];                                    // 0x0300(0x00C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaLocalPlayer">();
	}
	static class UHottaLocalPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHottaLocalPlayer>();
	}
};

// Class HottaFramework.HottaPlayerController
// 0x0008 (0x0870 - 0x0868)
class AHottaPlayerController : public ACommonPlayerController
{
public:
	uint8                                         Pad_31E4[0x8];                                     // 0x0868(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaPlayerController">();
	}
	static class AHottaPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHottaPlayerController>();
	}
};

// Class HottaFramework.HottaPlayerState
// 0x0E78 (0x11D0 - 0x0358)
class AHottaPlayerState : public AModularPlayerState
{
public:
	uint8                                         Pad_31E5[0x48];                                    // 0x0358(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int64>                            ExecedGMCommandMap;                                // 0x03A0(0x0050)(SaveGame, NativeAccessSpecifierPrivate)
	int64                                         CreateRoleUtcTime;                                 // 0x03F0(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int64                                         LoginTime;                                         // 0x03F8(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FDateTime                              LastUpdateOnlineSecondUtcTime;                     // 0x0400(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             OnPlayerRoleNameChanged;                           // 0x0408(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 M_strRoleName;                                     // 0x0418(0x0010)(Edit, Net, ZeroConstructor, SaveGame, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         M_nAccType;                                        // 0x0428(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31E6[0x4];                                     // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        M_nRoleId;                                         // 0x0430(0x0008)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         M_nSaveCount;                                      // 0x0438(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31E7[0xD94];                                   // 0x043C(0x0D94)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_RoleName();

	int64 GetRoleId() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaPlayerState">();
	}
	static class AHottaPlayerState* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHottaPlayerState>();
	}
};

// Class HottaFramework.HottaSyncUtil
// 0x0000 (0x0028 - 0x0028)
class UHottaSyncUtil final : public UObject
{
public:
	static class FString UObjectPropertyToJsonString(class UObject* InObject, const class FName& InPropertyName, int32 InSkipFlags, bool bInPrettyPrint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HottaSyncUtil">();
	}
	static class UHottaSyncUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHottaSyncUtil>();
	}
};

// Class HottaFramework.MDWrapperLibrary
// 0x0000 (0x0028 - 0x0028)
class UMDWrapperLibrary final : public UBlueprintFunctionLibrary
{
public:
	struct FParameterTypeInfo MakeParameterTypeInfo();
	struct FParameterWrapper MakeParameterWrapper();
	struct FParameterWrapperArray MakeParameterWrapperArray();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MDWrapperLibrary">();
	}
	static class UMDWrapperLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMDWrapperLibrary>();
	}
};

// Class HottaFramework.StorageObjectArchive
// 0x0000 (0x0028 - 0x0028)
class UStorageObjectArchive final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StorageObjectArchive">();
	}
	static class UStorageObjectArchive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStorageObjectArchive>();
	}
};

// Class HottaFramework.StorageStructArchive
// 0x0000 (0x0028 - 0x0028)
class UStorageStructArchive final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StorageStructArchive">();
	}
	static class UStorageStructArchive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStorageStructArchive>();
	}
};

}

