#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaFramework

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function HottaFramework.AsyncAction_ListenForGameplayMessage.ListenForGameplayMessages
// 0x0020 (0x0020 - 0x0000)
struct AsyncAction_ListenForGameplayMessage_ListenForGameplayMessages final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Channel;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScriptStruct*                          PayloadType;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ListenForGameplayMessage*  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.AsyncAction_ListenForGameplayMessage.GetPayload
// 0x0008 (0x0008 - 0x0000)
struct AsyncAction_ListenForGameplayMessage_GetPayload final
{
public:
	int32                                         OutPayload;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D8[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HottaFramework.AsyncAction_ListenForGameplayMessageWithSimpleMessage.ListenForGameplayMessagesWithSimpleMessage
// 0x0018 (0x0018 - 0x0000)
struct AsyncAction_ListenForGameplayMessageWithSimpleMessage_ListenForGameplayMessagesWithSimpleMessage final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Channel;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncAction_ListenForGameplayMessageWithSimpleMessage* ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.GameplayMessageSubsystem.K2_BroadcastMessage
// 0x000C (0x000C - 0x0000)
struct GameplayMessageSubsystem_K2_BroadcastMessage final
{
public:
	class FName                                   Channel;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Message;                                           // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageBoolValue
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageBoolValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31DB[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageFloatValue
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageFloatValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31DC[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageIntValue
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageIntValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31DD[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HottaFramework.GameplayMessageSubsystemStatic.GetSimpleMessageStringValue
// 0x0030 (0x0030 - 0x0000)
struct GameplayMessageSubsystemStatic_GetSimpleMessageStringValue final
{
public:
	struct FGameplayMessageSimpleMessage          InStruct;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithBool
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithBool final
{
public:
	bool                                          InValue;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31DE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithFloat
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31DF[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithInt
// 0x0028 (0x0028 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithInt final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31E0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function HottaFramework.GameplayMessageSubsystemStatic.MakeLiteralSimpleMessageWithString
// 0x0030 (0x0030 - 0x0000)
struct GameplayMessageSubsystemStatic_MakeLiteralSimpleMessageWithString final
{
public:
	class FString                                 InValue;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayMessageSimpleMessage          ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function HottaFramework.HottaPlayerState.GetRoleId
// 0x0008 (0x0008 - 0x0000)
struct HottaPlayerState_GetRoleId final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.HottaSyncUtil.UObjectPropertyToJsonString
// 0x0028 (0x0028 - 0x0000)
struct HottaSyncUtil_UObjectPropertyToJsonString final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPropertyName;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InSkipFlags;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInPrettyPrint;                                    // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31E8[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.MDWrapperLibrary.MakeParameterTypeInfo
// 0x000C (0x000C - 0x0000)
struct MDWrapperLibrary_MakeParameterTypeInfo final
{
public:
	struct FParameterTypeInfo                     ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.MDWrapperLibrary.MakeParameterWrapper
// 0x0020 (0x0020 - 0x0000)
struct MDWrapperLibrary_MakeParameterWrapper final
{
public:
	struct FParameterWrapper                      ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HottaFramework.MDWrapperLibrary.MakeParameterWrapperArray
// 0x0018 (0x0018 - 0x0000)
struct MDWrapperLibrary_MakeParameterWrapperArray final
{
public:
	struct FParameterWrapperArray                 ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

