#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTAimAnimMoveLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HTAimAnimMoveLayer.HTAimAnimMoveLayer_C.AimLayer
// 0x0010 (0x0010 - 0x0000)
struct HTAimAnimMoveLayer_C_AimLayer final
{
public:
	struct FPoseLink                              Param_AimLayer;                                    // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HTAimAnimMoveLayer.HTAimAnimMoveLayer_C.AimOffset
// 0x0020 (0x0020 - 0x0000)
struct HTAimAnimMoveLayer_C_AimOffset final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AimOffset;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HTAimAnimMoveLayer.HTAimAnimMoveLayer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct HTAimAnimMoveLayer_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HTAimAnimMoveLayer.HTAimAnimMoveLayer_C.ExecuteUbergraph_HTAimAnimMoveLayer
// 0x0004 (0x0004 - 0x0000)
struct HTAimAnimMoveLayer_C_ExecuteUbergraph_HTAimAnimMoveLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

