#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTAnimSharingStateInstanceBaseBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTAnimSharingStateInstanceBaseBP.HTAnimSharingStateInstanceBaseBP_C
// 0x00D0 (0x0460 - 0x0390)
class UHTAnimSharingStateInstanceBaseBP_C final : public UHTAnimSharingAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0398(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0410(0x0048)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_HTAnimSharingStateInstanceBaseBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HTAnimSharingStateInstanceBaseBP_C">();
	}
	static class UHTAnimSharingStateInstanceBaseBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimSharingStateInstanceBaseBP_C>();
	}
};

}

