#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTAnimSharingAdditiveInstanceBaseBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"
#include "HTAnimSharingAdditiveInstanceBaseBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTAnimSharingAdditiveInstanceBaseBP.HTAnimSharingAdditiveInstanceBaseBP_C
// 0x05A0 (0x0960 - 0x03C0)
class UHTAnimSharingAdditiveInstanceBaseBP_C : public UHTAnimSharingAddInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HTAnimSharingAdditiveInstanceBaseBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x03C8(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_548C[0x6];                                     // 0x03CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03D8(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E0(0x0048)()
	struct FHTAnimNode_GetRootSpeed               HTGetRootSpeedGraphNode;                           // 0x0428(0x0048)()
	struct FAnimNode_OrientationWarping           AnimGraphNode_OrientationWarping;                  // 0x0470(0x0220)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0690(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06B0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x06D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0750(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0778(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07C0(0x0028)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x07E8(0x0158)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0940(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_HTAnimSharingAdditiveInstanceBaseBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HTAnimSharingAdditiveInstanceBaseBP_C">();
	}
	static class UHTAnimSharingAdditiveInstanceBaseBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTAnimSharingAdditiveInstanceBaseBP_C>();
	}
};

}

