#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTGame

#include "Basic.hpp"

#include "GameplayCameras_structs.hpp"
#include "Engine_structs.hpp"
#include "HTGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MassNavigation_structs.hpp"
#include "UMG_structs.hpp"
#include "UINavigation_structs.hpp"
#include "AIModule_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "AkAudio_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "StructUtils_structs.hpp"
#include "DataRegistry_structs.hpp"
#include "OneEngineSDK_structs.hpp"
#include "PatcherSDK_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonInput_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK::Params
{

// Function HTGame.HTUserWidget.Delay
// 0x0020 (0x0020 - 0x0000)
struct HTUserWidget_Delay final
{
public:
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0000(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3878[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTUserWidget.Do_ClickButton
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_Do_ClickButton final
{
public:
	class UWidget*                                InButton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.EndAnimation
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_EndAnimation final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.GetHTHUD
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_GetHTHUD final
{
public:
	class AHTHUD*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.GetHTLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_GetHTLocalPlayer final
{
public:
	class UHTLocalPlayer*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.IsGamepadAttached
// 0x0001 (0x0001 - 0x0000)
struct HTUserWidget_IsGamepadAttached final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.IsGamepadInputType
// 0x0001 (0x0001 - 0x0000)
struct HTUserWidget_IsGamepadInputType final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.IsWidgetVisible
// 0x0010 (0x0010 - 0x0000)
struct HTUserWidget_IsWidgetVisible final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3879[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTUserWidget.K2_GetGeneratedUserWidget
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_K2_GetGeneratedUserWidget final
{
public:
	class UHTUserWidget*                          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.PlayAnimationAndWaitFor
// 0x0030 (0x0030 - 0x0000)
struct HTUserWidget_PlayAnimationAndWaitFor final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0024(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_387A[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_387B[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTUserWidget.PlayWidgetAnimQueue
// 0x0020 (0x0020 - 0x0000)
struct HTUserWidget_PlayWidgetAnimQueue final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForward;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_387C[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Param_ReverseAnimation;                            // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseForward;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_387D[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTUserWidget.ResetGamepadAnimFromUserWidget
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_ResetGamepadAnimFromUserWidget final
{
public:
	class UHTUserWidget*                          InUserWidget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.SetWidgetVisibility
// 0x0010 (0x0010 - 0x0000)
struct HTUserWidget_SetWidgetVisibility final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              InVisiblility;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_387E[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTUserWidget.SetWidgetVisible
// 0x0010 (0x0010 - 0x0000)
struct HTUserWidget_SetWidgetVisible final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InVisible;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_387F[0x7];                                     // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTUserWidget.ShouldPlaySelectedAnim
// 0x0001 (0x0001 - 0x0000)
struct HTUserWidget_ShouldPlaySelectedAnim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.ShouldPlayUnselectedAnim
// 0x0001 (0x0001 - 0x0000)
struct HTUserWidget_ShouldPlayUnselectedAnim final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.GetPC
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_GetPC final
{
public:
	class AHTPlayerController*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.GetPlayer
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_GetPlayer final
{
public:
	class AHTPlayerCharacter*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.GetPS
// 0x0008 (0x0008 - 0x0000)
struct HTUserWidget_GetPS final
{
public:
	class AHTPlayerState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.K2_GetListViewEntryWidgetFromItem
// 0x0018 (0x0018 - 0x0000)
struct HTUserWidget_K2_GetListViewEntryWidgetFromItem final
{
public:
	class UListView*                              InListView;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InListViewItemObject;                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUserWidget.K2_GetWidgetFromName
// 0x0010 (0x0010 - 0x0000)
struct HTUserWidget_K2_GetWidgetFromName final
{
public:
	class FName                                   InWidgetName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.BP_InitWithArgs
// 0x0010 (0x0010 - 0x0000)
struct HTUIBase_BP_InitWithArgs final
{
public:
	TArray<class FString>                         Args;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.BP_OnHandleContinueAction
// 0x0001 (0x0001 - 0x0000)
struct HTUIBase_BP_OnHandleContinueAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.BP_OnHandleDownAction
// 0x0001 (0x0001 - 0x0000)
struct HTUIBase_BP_OnHandleDownAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.BP_OnHandleInteractAction
// 0x0001 (0x0001 - 0x0000)
struct HTUIBase_BP_OnHandleInteractAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.BP_OnHandleUpAction
// 0x0001 (0x0001 - 0x0000)
struct HTUIBase_BP_OnHandleUpAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.GetWidgetContainerStack
// 0x0008 (0x0008 - 0x0000)
struct HTUIBase_GetWidgetContainerStack final
{
public:
	class UHTActivatableWidgetContainerStack*     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.SetAutoCloseTime
// 0x0004 (0x0004 - 0x0000)
struct HTUIBase_SetAutoCloseTime final
{
public:
	float                                         InAutoCloseTime;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.WillTransitionWhenClose
// 0x0001 (0x0001 - 0x0000)
struct HTUIBase_WillTransitionWhenClose final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUIBase.IsBackHandler
// 0x0001 (0x0001 - 0x0000)
struct HTUIBase_IsBackHandler final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTUI_AdventureManual.OnRadioBoxClicked
// 0x0010 (0x0010 - 0x0000)
struct HTUI_AdventureManual_OnRadioBoxClicked final
{
public:
	class UHTUI_RadioBox*                         InRadioBox;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHTUI_RadioBox*                         UnSelectRadioBtn;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController._SRFD_B_Params_Array_
// 0x0028 (0x0028 - 0x0000)
struct HTPlayerController__SRFD_B_Params_Array_ final
{
public:
	struct FParameterWrapperArray                 A;                                                 // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNetFightInfoBase>              B;                                                 // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ActivateAbilityFromID
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_ActivateAbilityFromID final
{
public:
	ESkillInputIDType                             InputID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38AF[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ActivateTeleport
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_ActivateTeleport final
{
public:
	class FName                                   TeleportId;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.AlignMoveInputFromRotation
// 0x0018 (0x0018 - 0x0000)
struct HTPlayerController_AlignMoveInputFromRotation final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.BP_OnSelectRoleAtLoginTime
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_BP_OnSelectRoleAtLoginTime final
{
public:
	class AActor*                                 SelectedActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Cheat
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_Cheat final
{
public:
	class FString                                 Msg;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.CheatShowFindFloor
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_CheatShowFindFloor final
{
public:
	int32                                         CheatValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationTime;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.CheckInteractActor
// 0x0128 (0x0128 - 0x0000)
struct HTPlayerController_CheckInteractActor final
{
public:
	class AActor*                                 InteractActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEntry                         InteractEntry;                                     // 0x0008(0x0120)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Client_NotifyTreasureBoxOpen
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_Client_NotifyTreasureBoxOpen final
{
public:
	class AHTTreasureBoxActor*                    CaseActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Client_NotifyTreasureBoxUnlock
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_Client_NotifyTreasureBoxUnlock final
{
public:
	class AHTTreasureBoxActor*                    CaseActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Client_PlaySequence
// 0x00E0 (0x00E0 - 0x0000)
struct HTPlayerController_Client_PlaySequence final
{
public:
	class ULevelSequence*                         LevelSequence;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneSequencePlaybackSettings    Settings;                                          // 0x0008(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FHTSequencePlaybackSettings            GameplaySettings;                                  // 0x0030(0x00B0)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Client_PlaySoftSequence
// 0x0100 (0x0100 - 0x0000)
struct HTPlayerController_Client_PlaySoftSequence final
{
public:
	TSoftObjectPtr<class ULevelSequence>          SoftLevelSequence;                                 // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneSequencePlaybackSettings    Settings;                                          // 0x0028(0x0028)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FHTSequencePlaybackSettings            GameplaySettings;                                  // 0x0050(0x00B0)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Client_SetYaHaHaData
// 0x000C (0x000C - 0x0000)
struct HTPlayerController_Client_SetYaHaHaData final
{
public:
	class FName                                   YahahaId;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Flag;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B0[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.ClientAddFightMessage
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_ClientAddFightMessage final
{
public:
	class FText                                   MsgTxt;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAddFightMessageByID
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_ClientAddFightMessageByID final
{
public:
	class FString                                 TextID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Args;                                              // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAddNoticeMessage
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_ClientAddNoticeMessage final
{
public:
	class FText                                   MsgTxt;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAddNoticeMessageByID
// 0x0028 (0x0028 - 0x0000)
struct HTPlayerController_ClientAddNoticeMessageByID final
{
public:
	class FString                                 TextID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIMessageEffectType                          EffectType;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Args;                                              // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAddSystemMessage
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_ClientAddSystemMessage final
{
public:
	class FText                                   MsgTxt;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAddSystemMessageByID
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_ClientAddSystemMessageByID final
{
public:
	class FString                                 TextID;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Args;                                              // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAddTaskMessage
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_ClientAddTaskMessage final
{
public:
	class FText                                   MsgTxt;                                            // 0x0000(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientAIErrorCode
// 0x0014 (0x0014 - 0x0000)
struct HTPlayerController_ClientAIErrorCode final
{
public:
	struct FGuid                                  SpawnGuid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESToCErrorCode                                InErrCode;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B2[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.ClientApplyGameplayEffectOnNetTarget
// 0x00B8 (0x00B8 - 0x0000)
struct HTPlayerController_ClientApplyGameplayEffectOnNetTarget final
{
public:
	struct FCharacterForNet                       NetTarget;                                         // 0x0000(0x002C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterForNet                       NetSource;                                         // 0x002C(0x002C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayEffect*                        GameplayEffect;                                    // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBufferData                            ModifyData;                                        // 0x0060(0x0058)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientBeginInteract
// 0x0128 (0x0128 - 0x0000)
struct HTPlayerController_ClientBeginInteract final
{
public:
	class AActor*                                 InteractActor;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInteractEntry                         InteractEntry;                                     // 0x0008(0x0120)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientChangeAllSpawnEntriesID
// 0x0028 (0x0028 - 0x0000)
struct HTPlayerController_ClientChangeAllSpawnEntriesID final
{
public:
	struct FGuid                                  SpawnGuid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InChangeSpawnEntriesID;                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FHTGamePlayTransform>           TransformsArray;                                   // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientChangeCharacter
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_ClientChangeCharacter final
{
public:
	class FName                                   InCharacterID;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutCharacterID;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientChangeRandomEntries
// 0x0018 (0x0018 - 0x0000)
struct HTPlayerController_ClientChangeRandomEntries final
{
public:
	struct FGuid                                  SpawnGuid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Wave;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RandomIndex;                                       // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientChangeSpawnEntriesID
// 0x0030 (0x0030 - 0x0000)
struct HTPlayerController_ClientChangeSpawnEntriesID final
{
public:
	struct FGuid                                  SpawnGuid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Wave;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InChangeSpawnEntriesID;                            // 0x0014(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B3[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHTGamePlayTransform>           TransformsArray;                                   // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientDoSpawn
// 0x0014 (0x0014 - 0x0000)
struct HTPlayerController_ClientDoSpawn final
{
public:
	struct FGuid                                  SpawnGuid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRefresh;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B4[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.ClientGetPockmon
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_ClientGetPockmon final
{
public:
	class AHTPockmonActor*                        InPockmonActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientIgnoreGameAndUIInput
// 0x0002 (0x0002 - 0x0000)
struct HTPlayerController_ClientIgnoreGameAndUIInput final
{
public:
	bool                                          bIgnoreMove;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHTCustomIgnoreMoveInputType                  InType;                                            // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientIgnoreGameAndUIInputWithTimeProtect
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerController_ClientIgnoreGameAndUIInputWithTimeProtect final
{
public:
	bool                                          bIgnoreMove;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProtectTime;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientInventoryNotifyMessage
// 0x0038 (0x0038 - 0x0000)
struct HTPlayerController_ClientInventoryNotifyMessage final
{
public:
	class UHTInventoryComponent*                  PInventory;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENotifyItemType                               NotifyType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B6[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHTItemNetInfo>                 Items;                                             // 0x0010(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FParameterWrapperArray                 Parameters;                                        // 0x0020(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientRecoverGameAndUIInput
// 0x0001 (0x0001 - 0x0000)
struct HTPlayerController_ClientRecoverGameAndUIInput final
{
public:
	EHTCustomIgnoreMoveInputType                  InType;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientRemoveGameplayEffectOnNetTarget
// 0x0068 (0x0068 - 0x0000)
struct HTPlayerController_ClientRemoveGameplayEffectOnNetTarget final
{
public:
	struct FCharacterForNet                       NetTarget;                                         // 0x0000(0x002C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterForNet                       NetSource;                                         // 0x002C(0x002C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameplayEffect*                        GameplayEffect;                                    // 0x0058(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StacksToRemove;                                    // 0x0060(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B7[0x4];                                     // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.ClientRemoveSpawnEntriesID
// 0x0014 (0x0014 - 0x0000)
struct HTPlayerController_ClientRemoveSpawnEntriesID final
{
public:
	struct FGuid                                  SpawnGuid;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Wave;                                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientResponseAntiSpamHttpCheck
// 0x0050 (0x0050 - 0x0000)
struct HTPlayerController_ClientResponseAntiSpamHttpCheck final
{
public:
	EAntiSpamHttpCheckType                        CheckType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Result;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StrChecked;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReplaceContent;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVarList                               Params_0;                                          // 0x0028(0x0028)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientServerAbilityActorSetCurrentHP
// 0x0030 (0x0030 - 0x0000)
struct HTPlayerController_ClientServerAbilityActorSetCurrentHP final
{
public:
	struct FCharacterForNet                       NetTarget;                                         // 0x0000(0x002C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewHP;                                             // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientSetReplicatedTargetData
// 0x0080 (0x0080 - 0x0000)
struct HTPlayerController_ClientSetReplicatedTargetData final
{
public:
	struct FClientReplicatedTargetDataContainer   TargetDataContainer;                               // 0x0000(0x0080)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientShowConsoleMsg
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_ClientShowConsoleMsg final
{
public:
	class FString                                 FMsg;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientSummonAIFailed_HybridMode
// 0x0030 (0x0030 - 0x0000)
struct HTPlayerController_ClientSummonAIFailed_HybridMode final
{
public:
	struct FCharacterForNet                       LeaderNetCharacter;                                // 0x0000(0x002C)(ConstParm, Parm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SummonIndex;                                       // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.ClientTreasureboxSpawnDrop
// 0x0080 (0x0080 - 0x0000)
struct HTPlayerController_ClientTreasureboxSpawnDrop final
{
public:
	class AHTTreasureBoxActor*                    CaseActor;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38B9[0x8];                                     // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InPosition;                                        // 0x0010(0x0060)(ConstParm, Parm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDropItemData                          InDropItemList;                                    // 0x0070(0x0010)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.DelayTravel
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_DelayTravel final
{
public:
	class FString                                 FURL;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.FakeTouch
// 0x0001 (0x0001 - 0x0000)
struct HTPlayerController_FakeTouch final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.GameRS_GP
// 0x0018 (0x0018 - 0x0000)
struct HTPlayerController_GameRS_GP final
{
public:
	struct FParameterWrapperArray                 A;                                                 // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.GetAbilityInputRows
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerController_GetAbilityInputRows final
{
public:
	TArray<struct FHTAbilityInputRow>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.GetCurrentFoliageInteractionPositionAndRadius
// 0x0018 (0x0018 - 0x0000)
struct HTPlayerController_GetCurrentFoliageInteractionPositionAndRadius final
{
public:
	TArray<struct FFoliageInteractionData>        InOutFoliageInteractionData;                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38BA[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.GetMutiYaHaHaState
// 0x0018 (0x0018 - 0x0000)
struct HTPlayerController_GetMutiYaHaHaState final
{
public:
	TArray<class FName>                           YaHaHaIDs;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38BB[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.GetMutiYaHaHaStateByType
// 0x000C (0x000C - 0x0000)
struct HTPlayerController_GetMutiYaHaHaStateByType final
{
public:
	class FName                                   YahahaType;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38BC[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.GetYaHaHaState
// 0x000C (0x000C - 0x0000)
struct HTPlayerController_GetYaHaHaState final
{
public:
	class FName                                   YahahaId;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38BD[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.Input_CameraRelease
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_CameraRelease final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_CameraRotate
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_CameraRotate final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_Down
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_Down final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_GetOffVechile
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_GetOffVechile final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_Jump
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_Jump final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_LeaveVines
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_LeaveVines final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_LookUpAtRate
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_LookUpAtRate final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_Map
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_Map final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_Move
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_Move final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_MoveCompleted
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_MoveCompleted final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_StandUpLeft
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_StandUpLeft final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_StandUpRight
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_StandUpRight final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_StandUpS
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_StandUpS final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_StandUpW
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_StandUpW final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_SwitchMouseCompleted
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_SwitchMouseCompleted final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_SwitchMouseStarted
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_SwitchMouseStarted final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_TouchCompleted
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_TouchCompleted final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_TouchOngoing
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_TouchOngoing final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_TouchStarted
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_TouchStarted final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_TouchTriggered
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_TouchTriggered final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_TurnAtRate
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_TurnAtRate final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_Up
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_Up final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleBrake
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleBrake final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleDrive
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleDrive final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleHandBrake
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleHandBrake final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleOperateRoof
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleOperateRoof final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleStickGamePad
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleStickGamePad final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleSwitchCamera
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleSwitchCamera final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_VehicleThrottleGamePad
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_VehicleThrottleGamePad final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_WalkRun
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_WalkRun final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.Input_Zoom
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerController_Input_Zoom final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.IsHeterotopiaTowerActivated
// 0x000C (0x000C - 0x0000)
struct HTPlayerController_IsHeterotopiaTowerActivated final
{
public:
	class FName                                   TowerID;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38BE[0x3];                                     // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function HTGame.HTPlayerController.IsInSequenceWithoutHeadUpInfo
// 0x0001 (0x0001 - 0x0000)
struct HTPlayerController_IsInSequenceWithoutHeadUpInfo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function HTGame.HTPlayerController.IsPausedSequence
// 0x0001 (0x0001 - 0x0000)
struct HTPlayerController_IsPausedSequence final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

