#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HtPlayerCharacterAniminstanceBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HtPlayerCharacterAniminstanceBase_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HtPlayerCharacterAniminstanceBase.HtPlayerCharacterAniminstanceBase_C
// 0xE410 (0xF110 - 0x0D00)
class UHtPlayerCharacterAniminstanceBase_C : public UHTPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HtPlayerCharacterAniminstanceBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0D08(0x0104)(HasGetValueTypeHash)
	uint8                                         Pad_58EC[0x4];                                     // 0x0E0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0E10(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0E18(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0E20(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0EC8(0x0008)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_213;                // 0x0ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_212;                // 0x0EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_211;                // 0x0F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_210;                // 0x0F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_209;                // 0x0F70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_208;                // 0x0F98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_207;                // 0x0FC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_206;                // 0x0FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_205;                // 0x1010(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_204;                // 0x1038(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_203;                // 0x1060(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_202;                // 0x1088(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_201;                // 0x10B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_200;                // 0x10D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_199;                // 0x1100(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_35;                      // 0x1128(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_91;                   // 0x1248(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_101;                     // 0x1290(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_25;                     // 0x12B0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_100;                     // 0x1378(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_34;                      // 0x1398(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90;                   // 0x14B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_99;                      // 0x1500(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_24;                     // 0x1520(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_98;                      // 0x15E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_198;                // 0x1608(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_33;                      // 0x1630(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89;                   // 0x1750(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_97;                      // 0x1798(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_23;                     // 0x17B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96;                      // 0x1880(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_32;                      // 0x18A0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_88;                   // 0x19C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_95;                      // 0x1A08(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_22;                     // 0x1A28(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94;                      // 0x1AF0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_31;                      // 0x1B10(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87;                   // 0x1C30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x1C78(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_21;                     // 0x1C98(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x1D60(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_197;                // 0x1D80(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_30;                      // 0x1DA8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_86;                   // 0x1EC8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x1F10(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_20;                     // 0x1F30(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x1FF8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_196;                // 0x2018(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_29;                      // 0x2040(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_85;                   // 0x2160(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_16;                 // 0x21A8(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_7;                     // 0x2218(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_15;                 // 0x22E0(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7;                   // 0x2350(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x2398(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_28;                      // 0x23B8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_84;                   // 0x24D8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_6;                     // 0x2520(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0x25E8(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6;                   // 0x2658(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x26A0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x2710(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_19;                     // 0x2730(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_195;                // 0x27F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_194;                // 0x2820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_193;                // 0x2848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_192;                // 0x2870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_191;                // 0x2898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_190;                // 0x28C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_189;                // 0x28E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x2910(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x2938(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83;                   // 0x2958(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x29A0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x2A68(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x2A90(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82;                   // 0x2AB0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x2AF8(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x2BC0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x2BE8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_18;                     // 0x2C08(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x2CD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81;                   // 0x2CF0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80;                   // 0x2D38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_79;                   // 0x2D80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_78;                   // 0x2DC8(0x0048)()
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0x2E10(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x2E60(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x2E88(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x2F58(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x2F78(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x2FA0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x2FC0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x2FE8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_17;                     // 0x3008(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_188;                // 0x30D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_187;                // 0x30F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_186;                // 0x3120(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_185;                // 0x3148(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_184;                // 0x3170(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_183;                // 0x3198(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_182;                // 0x31C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_181;                // 0x31E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_180;                // 0x3210(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_179;                // 0x3238(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_178;                // 0x3260(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_177;                // 0x3288(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_176;                // 0x32B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_175;                // 0x32D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_174;                // 0x3300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_173;                // 0x3328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_172;                // 0x3350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_171;                // 0x3378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_170;                // 0x33A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_169;                // 0x33C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_168;                // 0x33F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_167;                // 0x3418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_166;                // 0x3440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_165;                // 0x3468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_164;                // 0x3490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163;                // 0x34B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_162;                // 0x34E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x3508(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_27;                      // 0x3530(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_26;                      // 0x3650(0x0120)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x3770(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x3798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x37C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x37E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x3810(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x3838(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x3860(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x3880(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x38A8(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_25;                      // 0x38C8(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_77;                   // 0x39E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x3A30(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_24;                      // 0x3A50(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_76;                   // 0x3B70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x3BB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75;                   // 0x3BD8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x3C20(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_16;                     // 0x3C40(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x3D08(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_23;                      // 0x3D28(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_22;                      // 0x3E48(0x0120)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x3F68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x3F90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x3FB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x3FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x4008(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x4030(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x4058(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x4078(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x40A0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_21;                      // 0x40C0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_74;                   // 0x41E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x4228(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_20;                      // 0x4248(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_73;                   // 0x4368(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x43B0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_72;                   // 0x43D0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x4418(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_15;                     // 0x4438(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x4500(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x4520(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_19;                      // 0x4548(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0x4668(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x46B0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x46D8(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_18;                      // 0x46F8(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_17;                      // 0x4818(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x4938(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x4980(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x49A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_14;                     // 0x49C8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x4A90(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x4B10(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x4B90(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x4C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x4C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x4C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x4C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x4CB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x4CD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x4D00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x4D28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x4D50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x4D78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x4DA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x4DC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x4DF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x4E18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x4E40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x4E68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x4E90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x4EB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x4EE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x4F08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x4F30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x4F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x4F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x4FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x4FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x4FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x5020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x5048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x5070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x5098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x50C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x50E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x5110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x5138(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71;                   // 0x5160(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x51A8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_36;                  // 0x51F0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x5238(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x5258(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x52A0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_35;                  // 0x52E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x5330(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x5350(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x5378(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_16;                      // 0x5398(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x54B8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_5;                   // 0x5500(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x5548(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x5590(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_15;                      // 0x55B0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x56D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x5718(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x5760(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_4;                   // 0x57A8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x57F0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_14;                      // 0x5810(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x5930(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x5978(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x5998(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_34;                  // 0x59E0(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_13;                      // 0x5A28(0x0120)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_33;                  // 0x5B48(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_12;                      // 0x5B90(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0x5CB0(0x0070)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_11;                      // 0x5D20(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x5E40(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x5EB0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_10;                      // 0x5ED0(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x5FF0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_32;                  // 0x6038(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x6080(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x60C8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3;                   // 0x6110(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x6158(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_9;                       // 0x6178(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x6298(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x62E0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x6300(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x6328(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x6348(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x6370(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_13;                     // 0x6390(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x6458(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x64A0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x6520(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x65A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x65C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x65F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x6618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x6640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x6668(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x6690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x66B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x66E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x6708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x6730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x6758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x6780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x67A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x67D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x67F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x6820(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x6848(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x6870(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x6898(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x68C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x68E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x6910(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x6938(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x6960(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x6988(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x69B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x69D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x6A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x6A28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x6A50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x6A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x6AA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x6AC8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x6AF0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x6B38(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x6B60(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x6C18(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_9;                   // 0x6C38(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x6D00(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x6D20(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x6D68(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x6D88(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x6DB0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_31;                  // 0x6DD0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x6E18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x6E60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x6EA8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x6EF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x6F38(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x6F58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x6F80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x6FA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x6FD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x6FF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x7020(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x7048(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x7070(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x7098(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x70C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x70E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x7110(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x7138(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x7160(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x7188(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x71B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x71D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x7200(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x7228(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x7250(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x7278(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x72A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x72C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x72F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x7318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x7340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x7368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x7390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x73B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x73E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x7408(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x7430(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x7478(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x7498(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x74E0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_30;                  // 0x7528(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x7570(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x7590(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x75D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x75F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x7640(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x7660(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x7680(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x76F0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x7710(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x7758(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x7778(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x77E8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x7808(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x7878(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x7898(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x78C0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x78E8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x7908(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x7930(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_12;                     // 0x7950(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x7A18(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_8;                       // 0x7A38(0x0120)()
	struct FHTAnimNode_BlendListByCurve           HTAnimGraphNode_BlendListByCurve;                  // 0x7B58(0x0050)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x7BA8(0x00F0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x7C98(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x7CB8(0x00C8)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_7;                       // 0x7D80(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x7EA0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x7EE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_29;                  // 0x7F30(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_28;                  // 0x7F78(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x7FC0(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x8008(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x8050(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x8098(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x80E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x8100(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x8128(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x8150(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_6;                       // 0x8178(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_5;                       // 0x8298(0x0120)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x83B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x83E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x8408(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x8430(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x8458(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x8480(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x84C0(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x84E0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x8500(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x8528(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x8548(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x8570(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x8590(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x8658(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x8678(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x86C0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_27;                  // 0x8708(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_4;                       // 0x8750(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x8870(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x88B8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x88D8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_26;                  // 0x8900(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x8948(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x8970(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x8990(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x8A58(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x8AA0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x8B68(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x8C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x8C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x8C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x8CA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x8CD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x8CF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x8D20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x8D48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x8D70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x8D98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x8DC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x8DE8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x8E10(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x8E80(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x8EA0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x8F10(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x8F30(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x8FA0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x8FC0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x8FE8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x9058(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x9078(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x90E8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x9108(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x9178(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x9198(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x9260(0x0080)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x92E0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x93A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x93C8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x9490(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x9510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x9538(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_3;                       // 0x9560(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x9680(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_25;                  // 0x96C8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x9710(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x9780(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x97A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x97E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x9808(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x98D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x9918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x9940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x9968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x9990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x99B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x99E0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37;                   // 0x9A08(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36;                   // 0x9A50(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x9A98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x9AE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35;                   // 0x9B00(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_24;                  // 0x9B48(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34;                   // 0x9B90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x9BD8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33;                   // 0x9BF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32;                   // 0x9C40(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_23;                  // 0x9C88(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x9CD0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31;                   // 0x9CF0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x9D38(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x9D58(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x9D78(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x9E40(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x9EC0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30;                   // 0x9EE8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_22;                  // 0x9F30(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29;                   // 0x9F78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x9FC0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28;                   // 0x9FE0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0xA028(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0xA048(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xA110(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0xA190(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0xA200(0x0020)()
