#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTPlayerSubVehicleAnim

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "HTPlayerSubVehicleAnim_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTPlayerSubVehicleAnim.HTPlayerSubVehicleAnim_C
// 0x02F0 (0x06D0 - 0x03E0)
class UHTPlayerSubVehicleAnim_C final : public UHTPlayerSubAnimInstance_Vehicle
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HTPlayerSubVehicleAnim::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x03E8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0400(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0420(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x04D8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0520(0x0070)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0590(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0660(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* Param_AnimGraph);
	void AnimNotify_GetOffOver();
	void AnimNotify_GetOnOver();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void DriveLayer(struct FPoseLink* Param_DriveLayer);
	void ExecuteUbergraph_HTPlayerSubVehicleAnim(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HTPlayerSubVehicleAnim_C">();
	}
	static class UHTPlayerSubVehicleAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTPlayerSubVehicleAnim_C>();
	}
};

}

