#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTPlayerSubVehicleAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HTPlayerSubVehicleAnim.HTPlayerSubVehicleAnim_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct HTPlayerSubVehicleAnim_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HTPlayerSubVehicleAnim.HTPlayerSubVehicleAnim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct HTPlayerSubVehicleAnim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function HTPlayerSubVehicleAnim.HTPlayerSubVehicleAnim_C.DriveLayer
// 0x0010 (0x0010 - 0x0000)
struct HTPlayerSubVehicleAnim_C_DriveLayer final
{
public:
	struct FPoseLink                              Param_DriveLayer;                                  // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function HTPlayerSubVehicleAnim.HTPlayerSubVehicleAnim_C.ExecuteUbergraph_HTPlayerSubVehicleAnim
// 0x0008 (0x0008 - 0x0000)
struct HTPlayerSubVehicleAnim_C_ExecuteUbergraph_HTPlayerSubVehicleAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

