#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTSwimAnimLayerBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTSwimAnimLayerBase_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTSwimAnimLayerBase.HTSwimAnimLayerBase_C
// 0x0760 (0x0B40 - 0x03E0)
class UHTSwimAnimLayerBase_C : public UHTSwimAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HTSwimAnimLayerBase::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x03E8(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_58C4[0x4];                                     // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0400(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0408(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x05A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x05C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x05F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0618(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0640(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0668(0x0028)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0690(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x07B0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x07F8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0818(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0888(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x08A8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0918(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0938(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x09A8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x09C8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A38(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0A58(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0B20(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTSwimAnimLayerBase_AnimGraphNode_TransitionResult_80C3BA414F82643BB6817DA8664C1138();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTSwimAnimLayerBase_AnimGraphNode_TransitionResult_A291F8E141DB0308773B6FA3A544465A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTSwimAnimLayerBase_AnimGraphNode_TransitionResult_B2BF5A9B4785AEF6FBC5FC849DB4887C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTSwimAnimLayerBase_AnimGraphNode_TransitionResult_FBB41DCE48A1CC53E9D8ADBD8191FEAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_HTSwimAnimLayerBase_AnimGraphNode_TransitionResult_FC24DAB34689B59551F6D49F6F0E611D();
	void ExecuteUbergraph_HTSwimAnimLayerBase(int32 EntryPoint);
	void Swim(struct FPoseLink* Param_Swim);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HTSwimAnimLayerBase_C">();
	}
	static class UHTSwimAnimLayerBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTSwimAnimLayerBase_C>();
	}
};

}

