#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HTUmbrellaAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HTUmbrellaAnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass HTUmbrellaAnimBP.HTUmbrellaAnimBP_C
// 0x0160 (0x04D0 - 0x0370)
class UHTUmbrellaAnimBP_C final : public UHTUmbrellaAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct HTUmbrellaAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_622E[0x6];                                     // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03F8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0440(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0480(0x0048)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_HTUmbrellaAnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HTUmbrellaAnimBP_C">();
	}
	static class UHTUmbrellaAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTUmbrellaAnimBP_C>();
	}
};

}

