#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InstanceSplineMesh

#include "Basic.hpp"

#include "InstanceSplineMesh_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class InstanceSplineMesh.InstanceSplineMeshComponent
// 0x0110 (0x0A90 - 0x0980)
class UInstanceSplineMeshComponent final : public UInstancedStaticMeshComponent
{
public:
	uint8                                         Pad_2C9E[0x8];                                     // 0x0978(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInstanceSplineMeshParams>      SplineParams;                                      // 0x0980(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9F[0x4];                                     // 0x0990(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UseWPO;                                            // 0x0994(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBodySetup*                             BodySetup;                                         // 0x0998(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSerializableTriMeshCollisionData      CachedCollisionData;                               // 0x09A0(0x0048)(NativeAccessSpecifierPublic)
	struct FBoxSphereBounds                       CachedMaxInstanceBounds;                           // 0x09E8(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CA0[0x70];                                    // 0x0A20(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddSplineInstance(const struct FVector& StartPos, const struct FVector& StartTangent, const struct FVector2D& StartScale, float StartRoll, const struct FVector& EndPos, const struct FVector& EndTangent, const struct FVector2D& EndScale, float EndRoll, const struct FVector& UpDir, bool bWorldSpace);
	void CreateCollision();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstanceSplineMeshComponent">();
	}
	static class UInstanceSplineMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceSplineMeshComponent>();
	}
};

// Class InstanceSplineMesh.InstanceSplineMeshUtility
// 0x0000 (0x0028 - 0x0028)
class UInstanceSplineMeshUtility final : public UBlueprintFunctionLibrary
{
public:
	static void ConvertSplineMeshToInstance(class AActor* TargetActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstanceSplineMeshUtility">();
	}
	static class UInstanceSplineMeshUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstanceSplineMeshUtility>();
	}
};

}

