#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassTraffic

#include "Basic.hpp"

#include "MassTraffic_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MassTraffic.MassTrafficFunctionLibrary.DespawnNonPlayerDrivenParkedVehicles
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficFunctionLibrary_DespawnNonPlayerDrivenParkedVehicles final
{
public:
	class AMassSpawner*                           ParkedVehiclesMassSpawner;                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficFunctionLibrary.GetPackedTrafficVehicleInstanceCustomData
// 0x0018 (0x0018 - 0x0000)
struct MassTrafficFunctionLibrary_GetPackedTrafficVehicleInstanceCustomData final
{
public:
	const class UPrimitiveComponent*              PrimitiveComponent;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassTrafficPackedVehicleInstanceCustomData OutPackedCustomData;                               // 0x0008(0x0004)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         DataIndex;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21D6[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MassTraffic.MassTrafficFunctionLibrary.PackTrafficVehicleInstanceCustomData
// 0x0014 (0x0014 - 0x0000)
struct MassTrafficFunctionLibrary_PackTrafficVehicleInstanceCustomData final
{
public:
	struct FMassTrafficVehicleInstanceCustomData  CustomData;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassTrafficPackedVehicleInstanceCustomData ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficFunctionLibrary.RemoveVehiclesOverlappingPlayers
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficFunctionLibrary_RemoveVehiclesOverlappingPlayers final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficFunctionLibrary.UnpackTrafficVehicleInstanceCustomData
// 0x0014 (0x0014 - 0x0000)
struct MassTrafficFunctionLibrary_UnpackTrafficVehicleInstanceCustomData final
{
public:
	struct FMassTrafficPackedVehicleInstanceCustomData PackedCustomData;                                  // 0x0000(0x0004)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassTrafficVehicleInstanceCustomData  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficInstancePlaybackLibrary.AnimStateFromDataAsset
// 0x0028 (0x0028 - 0x0000)
struct MassTrafficInstancePlaybackLibrary_AnimStateFromDataAsset final
{
public:
	const class UAnimToTextureDataAsset*          DataAsset;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassTrafficAnimState                  AnimState;                                         // 0x000C(0x0014)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21DD[0x7];                                     // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MassTraffic.MassTrafficParkingSpacesDataAsset.GenerateRandomVehicleName
// 0x0010 (0x0010 - 0x0000)
struct MassTrafficParkingSpacesDataAsset_GenerateRandomVehicleName final
{
public:
	TArray<class FName>                           VehicleIdList;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficSubsystem.GetNumParkedVehicleAgents
// 0x0004 (0x0004 - 0x0000)
struct MassTrafficSubsystem_GetNumParkedVehicleAgents final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficSubsystem.GetNumTrafficVehicleAgents
// 0x0004 (0x0004 - 0x0000)
struct MassTrafficSubsystem_GetNumTrafficVehicleAgents final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficSubsystem.HasParkedVehicleAgents
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficSubsystem_HasParkedVehicleAgents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficSubsystem.HasTrafficVehicleAgents
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficSubsystem_HasTrafficVehicleAgents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleControlInterface.SetVehicleInputs
// 0x0014 (0x0014 - 0x0000)
struct MassTrafficVehicleControlInterface_SetVehicleInputs final
{
public:
	float                                         Throttle;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Brake;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHandBrake;                                        // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2200[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Steering;                                          // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetSteering;                                      // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2201[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function MassTraffic.MassTrafficVehicleBusInterface.PlayDoorAnim
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_PlayDoorAnim final
{
public:
	bool                                          bOpenDoor;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleBusInterface.SetDoorCollision
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_SetDoorCollision final
{
public:
	bool                                          bInEnable;                                         // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleBusInterface.UpdateBusDoorState
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_UpdateBusDoorState final
{
public:
	bool                                          bOpen;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleBusInterface.IsPlayerGettingOn
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_IsPlayerGettingOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleBusInterface.IsQuestVehiclePlayerGetOnAlready
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleBusInterface_IsQuestVehiclePlayerGetOnAlready final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficTrainControlInterface.PlayDoorAnim
// 0x0008 (0x0008 - 0x0000)
struct MassTrafficTrainControlInterface_PlayDoorAnim final
{
public:
	bool                                          bOpenDoor;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2202[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DoorSide;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleInterface.OnDriverRemoved
// 0x00A0 (0x00A0 - 0x0000)
struct MassTrafficVehicleInterface_OnDriverRemoved final
{
public:
	struct FMassTrafficDriverTypeData             DriverTypeData;                                    // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMassTrafficInstancePlaybackData       DriverInstanceData;                                // 0x0020(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2204[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             DriverTransformWorldSpace;                         // 0x0040(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function MassTraffic.MassTrafficVehicleInterface.GetDamageState
// 0x0001 (0x0001 - 0x0000)
struct MassTrafficVehicleInterface_GetDamageState final
{
public:
	EMassTrafficVehicleDamageState                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

