#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIBehavior

#include "Basic.hpp"

#include "StateTreeModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MassEntity_structs.hpp"
#include "SmartObjectsModule_structs.hpp"
#include "MassMovement_structs.hpp"
#include "MassSmartObjects_structs.hpp"
#include "ZoneGraph_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum MassAIBehavior.MassCrowdHitType
// NumValues: 0x0003
enum class EMassCrowdHitType : uint8
{
	TakeDamage                               = 0,
	MoveHit                                  = 1,
	MassCrowdHitType_MAX                     = 2,
};

// Enum MassAIBehavior.EMassLookAtMode
// NumValues: 0x0004
enum class EMassLookAtMode : uint8
{
	LookForward                              = 0,
	LookAlongPath                            = 1,
	LookAtEntity                             = 2,
	EMassLookAtMode_MAX                      = 3,
};

// Enum MassAIBehavior.EMassLookAtGazeMode
// NumValues: 0x0004
enum class EMassLookAtGazeMode : uint8
{
	None                                     = 0,
	Constant                                 = 1,
	Glance                                   = 2,
	EMassLookAtGazeMode_MAX                  = 3,
};

// ScriptStruct MassAIBehavior.MassClaimSmartObjectTaskInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FMassClaimSmartObjectTaskInstanceData final
{
public:
	struct FStateTreeStructRef                    CandidateSlots;                                    // 0x0000(0x0010)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0010(0x0020)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassStateTreeTaskBase
// 0x0000 (0x0028 - 0x0028)
struct FMassStateTreeTaskBase : public FStateTreeTaskBase
{
};

// ScriptStruct MassAIBehavior.MassClaimSmartObjectTask
// 0x0018 (0x0040 - 0x0028)
struct FMassClaimSmartObjectTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_2093[0x14];                                    // 0x0028(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractionCooldown;                               // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};

// ScriptStruct MassAIBehavior.MassComponentHitEvaluatorInstanceData
// 0x0018 (0x0018 - 0x0000)
struct FMassComponentHitEvaluatorInstanceData final
{
public:
	bool                                          bGotHit;                                           // 0x0000(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2094[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityHandle                      LastHitEntity;                                     // 0x0008(0x0008)(Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassCrowdHitType                             HitType;                                           // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2095[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassStateTreeEvaluatorBase
// 0x0000 (0x0020 - 0x0020)
struct FMassStateTreeEvaluatorBase : public FStateTreeEvaluatorBase
{
};

// ScriptStruct MassAIBehavior.MassComponentHitEvaluator
// 0x0008 (0x0028 - 0x0020)
struct FMassComponentHitEvaluator final : public FMassStateTreeEvaluatorBase
{
public:
	uint8                                         Pad_2096[0x8];                                     // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassHitResult
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMassHitResult final
{
public:
	uint8                                         Pad_2097[0x20];                                    // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassFindSmartObjectTaskInstanceData
// 0x00A8 (0x00A8 - 0x0000)
struct FMassFindSmartObjectTaskInstanceData final
{
public:
	struct FMassSmartObjectCandidateSlots         FoundCandidateSlots;                               // 0x0000(0x0088)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasCandidateSlots;                                // 0x0088(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2098[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassSmartObjectRequestID              SearchRequestID;                                   // 0x0090(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	double                                        NextUpdate;                                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphLaneHandle                   LastLane;                                          // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassFindSmartObjectTask
// 0x0070 (0x0098 - 0x0028)
struct FMassFindSmartObjectTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_2099[0x20];                                    // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagQuery                      ActivityRequirements;                              // 0x0048(0x0048)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         SearchInterval;                                    // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209A[0x4];                                     // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassLookAtFragment
// 0x0070 (0x0070 - 0x0000)
struct FMassLookAtFragment final : public FMassFragment
{
public:
	struct FVector                                Direction;                                         // 0x0000(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                GazeDirection;                                     // 0x0018(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      TrackedEntity;                                     // 0x0030(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassEntityHandle                      GazeTrackedEntity;                                 // 0x0038(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        GazeStartTime;                                     // 0x0040(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GazeDuration;                                      // 0x0048(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        LastSeenActionID;                                  // 0x004C(0x0002)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtMode                               LookAtMode;                                        // 0x004E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassLookAtGazeMode                           RandomGazeMode;                                    // 0x004F(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RandomGazeYawVariation;                            // 0x0050(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RandomGazePitchVariation;                          // 0x0051(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRandomGazeEntities : 1;                           // 0x0052(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_209B[0x5];                                     // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AttentionLocation;                                 // 0x0058(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassLookAtTargetTag
// 0x0000 (0x0001 - 0x0001)
struct FMassLookAtTargetTag final : public FMassTag
{
};

// ScriptStruct MassAIBehavior.MassLookAtTrajectoryPoint
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FMassLookAtTrajectoryPoint final
{
public:
	uint8                                         Pad_209C[0x20];                                    // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassLookAtTrajectoryFragment
// 0x0070 (0x0070 - 0x0000)
struct alignas(0x08) FMassLookAtTrajectoryFragment final : public FMassFragment
{
public:
	uint8                                         Pad_209D[0x70];                                    // 0x0000(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassLookAtTaskInstanceData
// 0x0010 (0x0010 - 0x0000)
struct FMassLookAtTaskInstanceData final
{
public:
	struct FMassEntityHandle                      TargetEntity;                                      // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassLookAtTask
// 0x0018 (0x0040 - 0x0028)
struct FMassLookAtTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_209E[0xC];                                     // 0x0028(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	EMassLookAtMode                               LookAtMode;                                        // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMassLookAtGazeMode                           RandomGazeMode;                                    // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         RandomGazeYawVariation;                            // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         RandomGazePitchVariation;                          // 0x0037(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRandomGazeEntities;                               // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_209F[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassStateTreeInstanceFragment
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FMassStateTreeInstanceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_20A0[0x10];                                    // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassStateTreeSharedFragment
// 0x0008 (0x0008 - 0x0000)
struct FMassStateTreeSharedFragment final : public FMassSharedFragment
{
public:
	class UStateTree*                             StateTree;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassStateTreeActivatedTag
// 0x0000 (0x0001 - 0x0001)
struct FMassStateTreeActivatedTag final : public FMassTag
{
};

// ScriptStruct MassAIBehavior.MassStateTreeInstanceDataItem
// 0x0018 (0x0018 - 0x0000)
struct FMassStateTreeInstanceDataItem final
{
public:
	struct FStateTreeInstanceData                 InstanceData;                                      // 0x0000(0x0010)(NativeAccessSpecifierPublic)
	int32                                         Generation;                                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20A1[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassUseSmartObjectTaskInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FMassUseSmartObjectTaskInstanceData final
{
public:
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0000(0x0020)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassUseSmartObjectTask
// 0x0020 (0x0048 - 0x0028)
struct FMassUseSmartObjectTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_20A2[0x20];                                    // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationEvaluatorInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FMassZoneGraphAnnotationEvaluatorInstanceData final
{
public:
	struct FZoneGraphTagMask                      AnnotationTags;                                    // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationEvaluator
// 0x0008 (0x0028 - 0x0020)
struct FMassZoneGraphAnnotationEvaluator final : public FMassStateTreeEvaluatorBase
{
public:
	uint8                                         Pad_20A3[0x8];                                     // 0x0020(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationFragment
// 0x0004 (0x0004 - 0x0000)
struct FMassZoneGraphAnnotationFragment final : public FMassFragment
{
public:
	struct FZoneGraphTagMask                      Tags;                                              // 0x0000(0x0004)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassZoneGraphAnnotationVariableTickChunkFragment
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FMassZoneGraphAnnotationVariableTickChunkFragment final : public FMassChunkFragment
{
public:
	uint8                                         Pad_20A4[0x8];                                     // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphTargetLocation
// 0x0060 (0x0060 - 0x0000)
struct alignas(0x08) FMassZoneGraphTargetLocation final
{
public:
	uint8                                         Pad_20A5[0x60];                                    // 0x0000(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphFindEscapeTargetInstanceData
// 0x0060 (0x0060 - 0x0000)
struct FMassZoneGraphFindEscapeTargetInstanceData final
{
public:
	struct FMassZoneGraphTargetLocation           EscapeTargetLocation;                              // 0x0000(0x0060)(Edit, EditConst, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassZoneGraphFindEscapeTarget
// 0x0018 (0x0040 - 0x0028)
struct FMassZoneGraphFindEscapeTarget final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_20A6[0x12];                                    // 0x0028(0x0012)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneGraphTag                          DisturbanceAnnotationTag;                          // 0x003A(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20A7[0x5];                                     // 0x003B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphFindSmartObjectTargetInstanceData
// 0x0080 (0x0080 - 0x0000)
struct FMassZoneGraphFindSmartObjectTargetInstanceData final
{
public:
	struct FSmartObjectClaimHandle                ClaimedSlot;                                       // 0x0000(0x0020)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassZoneGraphTargetLocation           SmartObjectLocation;                               // 0x0020(0x0060)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassZoneGraphFindSmartObjectTarget
// 0x0018 (0x0040 - 0x0028)
struct FMassZoneGraphFindSmartObjectTarget final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_20A8[0x18];                                    // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphPathFollowTaskInstanceData
// 0x0030 (0x0030 - 0x0000)
struct FMassZoneGraphPathFollowTaskInstanceData final
{
public:
	struct FStateTreeStructRef                    TargetLocation;                                    // 0x0000(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMassMovementStyleRef                  MovementStyle;                                     // 0x0010(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedScale;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20A9[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphPathFollowTask
// 0x0030 (0x0058 - 0x0028)
struct FMassZoneGraphPathFollowTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_20AA[0x30];                                    // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.MassZoneGraphStandTaskInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FMassZoneGraphStandTaskInstanceData final
{
public:
	float                                         Duration;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.MassZoneGraphStandTask
// 0x0030 (0x0058 - 0x0028)
struct FMassZoneGraphStandTask final : public FMassStateTreeTaskBase
{
public:
	uint8                                         Pad_20AB[0x30];                                    // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.ZoneGraphTagFilterConditionInstanceData
// 0x0004 (0x0004 - 0x0000)
struct FZoneGraphTagFilterConditionInstanceData final
{
public:
	struct FZoneGraphTagMask                      Tags;                                              // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.ZoneGraphTagFilterCondition
// 0x0010 (0x0038 - 0x0028)
struct FZoneGraphTagFilterCondition final : public FStateTreeConditionBase
{
public:
	struct FZoneGraphTagFilter                    Filter;                                            // 0x0028(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20AC[0x3];                                     // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.ZoneGraphTagMaskConditionInstanceData
// 0x0008 (0x0008 - 0x0000)
struct FZoneGraphTagMaskConditionInstanceData final
{
public:
	struct FZoneGraphTagMask                      Left;                                              // 0x0000(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTagMask                      Right;                                             // 0x0004(0x0004)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.ZoneGraphTagMaskCondition
// 0x0008 (0x0030 - 0x0028)
struct FZoneGraphTagMaskCondition final : public FStateTreeConditionBase
{
public:
	EZoneLaneTagMaskComparison                    Operator;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvert;                                           // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20AD[0x6];                                     // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// ScriptStruct MassAIBehavior.ZoneGraphTagConditionInstanceData
// 0x0002 (0x0002 - 0x0000)
struct FZoneGraphTagConditionInstanceData final
{
public:
	struct FZoneGraphTag                          Left;                                              // 0x0000(0x0001)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTag                          Right;                                             // 0x0001(0x0001)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct MassAIBehavior.ZoneGraphTagCondition
// 0x0008 (0x0030 - 0x0028)
struct FZoneGraphTagCondition final : public FStateTreeConditionBase
{
public:
	bool                                          bInvert;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20AE[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

}

