#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassTraffic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassReplication_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassRepresentation_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MassTraffic_structs.hpp"
#include "ZoneGraph_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "MassLOD_structs.hpp"
#include "MassLOD_classes.hpp"
#include "MassCommon_structs.hpp"


namespace SDK
{

// Class MassTraffic.HTMassSimpleVisualizationProcessor
// 0x0000 (0x0370 - 0x0370)
class UHTMassSimpleVisualizationProcessor : public UMassVisualizationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HTMassSimpleVisualizationProcessor">();
	}
	static class UHTMassSimpleVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHTMassSimpleVisualizationProcessor>();
	}
};

// Class MassTraffic.MassTrafficProcessorBase
// 0x0018 (0x00D8 - 0x00C0)
class UMassTrafficProcessorBase : public UMassProcessor
{
public:
	uint8                                         Pad_21C1[0x10];                                    // 0x00C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LogOwner;                                          // 0x00D0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficProcessorBase">();
	}
	static class UMassTrafficProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficProcessorBase>();
	}
};

// Class MassTraffic.MassTrafficActorVehiclePhysicsProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficActorVehiclePhysicsProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21C2[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficActorVehiclePhysicsProcessor">();
	}
	static class UMassTrafficActorVehiclePhysicsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficActorVehiclePhysicsProcessor>();
	}
};

// Class MassTraffic.TrafficClientBubbleInfo
// 0x0250 (0x0508 - 0x02B8)
class ATrafficClientBubbleInfo final : public AMassClientBubbleInfoBase
{
public:
	struct FTrafficClientBubbleSerializer         TrafficSerializer;                                 // 0x02B8(0x0250)(Net, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TrafficClientBubbleInfo">();
	}
	static class ATrafficClientBubbleInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrafficClientBubbleInfo>();
	}
};

// Class MassTraffic.MassTrafficChooseNextLaneProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficChooseNextLaneProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21C3[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficChooseNextLaneProcessor">();
	}
	static class UMassTrafficChooseNextLaneProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficChooseNextLaneProcessor>();
	}
};

// Class MassTraffic.MassTrafficConstrainedTrailerTrait
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficConstrainedTrailerTrait final : public UMassEntityTraitBase
{
public:
	struct FMassTrafficConstrainedTrailerParameters Params;                                            // 0x0028(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficConstrainedTrailerTrait">();
	}
	static class UMassTrafficConstrainedTrailerTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficConstrainedTrailerTrait>();
	}
};

// Class MassTraffic.MassTrafficDamageRepairProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficDamageRepairProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21C4[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDamageRepairProcessor">();
	}
	static class UMassTrafficDamageRepairProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDamageRepairProcessor>();
	}
};

// Class MassTraffic.MassTrafficDriverTypesDataAsset
// 0x0010 (0x0040 - 0x0030)
class UMassTrafficDriverTypesDataAsset final : public UDataAsset
{
public:
	TArray<struct FMassTrafficDriverTypeData>     DriverTypes;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverTypesDataAsset">();
	}
	static class UMassTrafficDriverTypesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverTypesDataAsset>();
	}
};

// Class MassTraffic.MassTrafficDriverVisualizationProcessor
// 0x02C0 (0x0380 - 0x00C0)
class alignas(0x10) UMassTrafficDriverVisualizationProcessor final : public UMassProcessor
{
public:
	float                                         PlaybackSteeringThreshold;                         // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowSpeedThreshold;                                 // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookIdleMinDistSqrd;                               // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookIdleMinDotToPlayer;                            // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AlternateDrivingStanceRatio;                       // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassTrafficVehicleDamageState                RemoveDriverDamageThreshold;                       // 0x00D4(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C5[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C6[0x2A0];                                   // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverVisualizationProcessor">();
	}
	static class UMassTrafficDriverVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverVisualizationProcessor>();
	}
};

// Class MassTraffic.MassTrafficDriverVisualizationTrait
// 0x00C8 (0x00F0 - 0x0028)
class UMassTrafficDriverVisualizationTrait final : public UMassEntityTraitBase
{
public:
	uint8                                         Pad_21C7[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassTrafficDriversParameters          Params;                                            // 0x0030(0x0090)(Edit, NativeAccessSpecifierPublic)
	struct FMassTrafficDriverDataFragment         DriverRandomColorData;                             // 0x00C0(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C8[0x4];                                     // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UMassRepresentationSubsystem> RepresentationSubsystemClass;                      // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C9[0x8];                                     // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverVisualizationTrait">();
	}
	static class UMassTrafficDriverVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverVisualizationTrait>();
	}
};

// Class MassTraffic.MassTrafficDriverInitializer
// 0x02B8 (0x0390 - 0x00D8)
class UMassTrafficDriverInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_21CA[0x2B8];                                   // 0x00D8(0x02B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficDriverInitializer">();
	}
	static class UMassTrafficDriverInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficDriverInitializer>();
	}
};

// Class MassTraffic.EvaluateSequenceAnimInstance
// 0x0010 (0x0380 - 0x0370)
class UEvaluateSequenceAnimInstance final : public UAnimInstance
{
public:
	class UAnimSequence*                          SequenceToEvaluate;                                // 0x0368(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToEvaluate;                                    // 0x0370(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21CB[0xC];                                     // 0x0374(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EvaluateSequenceAnimInstance">();
	}
	static class UEvaluateSequenceAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEvaluateSequenceAnimInstance>();
	}
};

// Class MassTraffic.MassTrafficFieldActor
// 0x0008 (0x02A8 - 0x02A0)
class AMassTrafficFieldActor final : public AActor
{
public:
	class UMassTrafficFieldComponent*             FieldComponent;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldActor">();
	}
	static class AMassTrafficFieldActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassTrafficFieldActor>();
	}
};

// Class MassTraffic.MassTrafficFieldComponent
// 0x0070 (0x0590 - 0x0520)
class UMassTrafficFieldComponent final : public UPrimitiveComponent
{
public:
	bool                                          bEnabled;                                          // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMassTrafficFieldInclusionMode                InclusionMode;                                     // 0x0521(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21CC[0x6];                                     // 0x0522(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Extent;                                            // 0x0528(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    LaneTagFilter;                                     // 0x0540(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_21CD[0x4];                                     // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMassTrafficFieldOperationBase*> Operations;                                        // 0x0550(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Alpha;                                             // 0x0564(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21CE[0x2B];                                    // 0x0565(0x002B)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldComponent">();
	}
	static class UMassTrafficFieldComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFieldComponent>();
	}
};

// Class MassTraffic.MassTrafficFieldOperationBase
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficFieldOperationBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldOperationBase">();
	}
	static class UMassTrafficFieldOperationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFieldOperationBase>();
	}
};

// Class MassTraffic.MassTrafficBeginPlayFieldOperationBase
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficBeginPlayFieldOperationBase : public UMassTrafficFieldOperationBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficBeginPlayFieldOperationBase">();
	}
	static class UMassTrafficBeginPlayFieldOperationBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficBeginPlayFieldOperationBase>();
	}
};

// Class MassTraffic.MassTrafficFieldOperationsProcessorBase
// 0x0010 (0x00E8 - 0x00D8)
class UMassTrafficFieldOperationsProcessorBase : public UMassTrafficProcessorBase
{
public:
	TSubclassOf<class UMassTrafficFieldOperationBase> Operation;                                         // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassTrafficSubsystem*                  CachedMassTrafficSubsystem;                        // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFieldOperationsProcessorBase">();
	}
	static class UMassTrafficFieldOperationsProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFieldOperationsProcessorBase>();
	}
};

// Class MassTraffic.MassTrafficForceTrafficVehicleViewerLODFieldOperation
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficForceTrafficVehicleViewerLODFieldOperation final : public UMassTrafficFieldOperationBase
{
public:
	EMassLOD                                      LOD;                                               // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21CF[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficForceTrafficVehicleViewerLODFieldOperation">();
	}
	static class UMassTrafficForceTrafficVehicleViewerLODFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficForceTrafficVehicleViewerLODFieldOperation>();
	}
};

// Class MassTraffic.MassTrafficSetLaneSpeedLimitFieldOperation
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficSetLaneSpeedLimitFieldOperation final : public UMassTrafficBeginPlayFieldOperationBase
{
public:
	float                                         SpeedLimitMPH;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21D0[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficSetLaneSpeedLimitFieldOperation">();
	}
	static class UMassTrafficSetLaneSpeedLimitFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficSetLaneSpeedLimitFieldOperation>();
	}
};

// Class MassTraffic.MassTrafficVisualLoggingFieldOperation
// 0x0008 (0x0030 - 0x0028)
class UMassTrafficVisualLoggingFieldOperation final : public UMassTrafficFieldOperationBase
{
public:
	bool                                          bVisLog;                                           // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21D1[0x7];                                     // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficVisualLoggingFieldOperation">();
	}
	static class UMassTrafficVisualLoggingFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficVisualLoggingFieldOperation>();
	}
};

// Class MassTraffic.MassTrafficRetimeIntersectionPeriodsFieldOperation
// 0x0010 (0x0038 - 0x0028)
class UMassTrafficRetimeIntersectionPeriodsFieldOperation final : public UMassTrafficFieldOperationBase
{
public:
	float                                         VehiclesOnlyPeriodDurationMult;                    // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PedestriansOnlyPeriodDurationMult;                 // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         VehicleAndPedestrianPeriodDurationMult;            // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EmptyPeriodDurationMult;                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficRetimeIntersectionPeriodsFieldOperation">();
	}
	static class UMassTrafficRetimeIntersectionPeriodsFieldOperation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficRetimeIntersectionPeriodsFieldOperation>();
	}
};

// Class MassTraffic.MassTrafficVisualLoggingFieldOperationProcessor
// 0x0000 (0x00E8 - 0x00E8)
class UMassTrafficVisualLoggingFieldOperationProcessor final : public UMassTrafficFieldOperationsProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficVisualLoggingFieldOperationProcessor">();
	}
	static class UMassTrafficVisualLoggingFieldOperationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficVisualLoggingFieldOperationProcessor>();
	}
};

// Class MassTraffic.MassTrafficFrameStartFieldOperationsProcessor
// 0x0000 (0x00E8 - 0x00E8)
class UMassTrafficFrameStartFieldOperationsProcessor final : public UMassTrafficFieldOperationsProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFrameStartFieldOperationsProcessor">();
	}
	static class UMassTrafficFrameStartFieldOperationsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFrameStartFieldOperationsProcessor>();
	}
};

// Class MassTraffic.MassTrafficPostCalcVisualizationLODFieldOperationsProcessor
// 0x0000 (0x00E8 - 0x00E8)
class UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor final : public UMassTrafficFieldOperationsProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficPostCalcVisualizationLODFieldOperationsProcessor">();
	}
	static class UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficPostCalcVisualizationLODFieldOperationsProcessor>();
	}
};

// Class MassTraffic.MassTrafficFindDeviantParkedVehiclesProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficFindDeviantParkedVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21D2[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindDeviantParkedVehiclesProcessor">();
	}
	static class UMassTrafficFindDeviantParkedVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindDeviantParkedVehiclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficFindDeviantTrafficVehiclesProcessor
// 0x07E8 (0x08C0 - 0x00D8)
class UMassTrafficFindDeviantTrafficVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21D3[0x7E8];                                   // 0x00D8(0x07E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindDeviantTrafficVehiclesProcessor">();
	}
	static class UMassTrafficFindDeviantTrafficVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindDeviantTrafficVehiclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficFindNextVehicleProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficFindNextVehicleProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21D4[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindNextVehicleProcessor">();
	}
	static class UMassTrafficFindNextVehicleProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindNextVehicleProcessor>();
	}
};

// Class MassTraffic.MassTrafficFindObstaclesProcessor
// 0x0548 (0x0620 - 0x00D8)
class UMassTrafficFindObstaclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21D5[0x548];                                   // 0x00D8(0x0548)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFindObstaclesProcessor">();
	}
	static class UMassTrafficFindObstaclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFindObstaclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DespawnNonPlayerDrivenParkedVehicles(class AMassSpawner* ParkedVehiclesMassSpawner);
	static bool GetPackedTrafficVehicleInstanceCustomData(const class UPrimitiveComponent* PrimitiveComponent, struct FMassTrafficPackedVehicleInstanceCustomData* OutPackedCustomData, int32 DataIndex);
	static struct FMassTrafficPackedVehicleInstanceCustomData PackTrafficVehicleInstanceCustomData(const struct FMassTrafficVehicleInstanceCustomData& CustomData);
	static void RemoveVehiclesOverlappingPlayers(class UObject* WorldContextObject);
	static struct FMassTrafficVehicleInstanceCustomData UnpackTrafficVehicleInstanceCustomData(const struct FMassTrafficPackedVehicleInstanceCustomData& PackedCustomData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficFunctionLibrary">();
	}
	static class UMassTrafficFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficFunctionLibrary>();
	}
};

// Class MassTraffic.MassTrafficInitInterpolationProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficInitInterpolationProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21D7[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitInterpolationProcessor">();
	}
	static class UMassTrafficInitInterpolationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitInterpolationProcessor>();
	}
};

// Class MassTraffic.MassTrafficInitIntersectionsProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficInitIntersectionsProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21D8[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitIntersectionsProcessor">();
	}
	static class UMassTrafficInitIntersectionsProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitIntersectionsProcessor>();
	}
};

// Class MassTraffic.MassTrafficInitParkedVehiclesProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficInitParkedVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	struct FRandomStream                          RandomStream;                                      // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_21D9[0x2A0];                                   // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitParkedVehiclesProcessor">();
	}
	static class UMassTrafficInitParkedVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitParkedVehiclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficInitTrafficVehicleSpeedProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficInitTrafficVehicleSpeedProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21DA[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitTrafficVehicleSpeedProcessor">();
	}
	static class UMassTrafficInitTrafficVehicleSpeedProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitTrafficVehicleSpeedProcessor>();
	}
};

// Class MassTraffic.MassTrafficInitTrafficVehiclesProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficInitTrafficVehiclesProcessor : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21DB[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitTrafficVehiclesProcessor">();
	}
	static class UMassTrafficInitTrafficVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitTrafficVehiclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficInitTrailersProcessor
// 0x02B8 (0x0390 - 0x00D8)
class UMassTrafficInitTrailersProcessor final : public UMassTrafficProcessorBase
{
public:
	struct FRandomStream                          RandomStream;                                      // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_21DC[0x2B0];                                   // 0x00E0(0x02B0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInitTrailersProcessor">();
	}
	static class UMassTrafficInitTrailersProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInitTrailersProcessor>();
	}
};

// Class MassTraffic.MassTrafficInstancePlaybackLibrary
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficInstancePlaybackLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AnimStateFromDataAsset(const class UAnimToTextureDataAsset* DataAsset, int32 StateIndex, struct FMassTrafficAnimState* AnimState);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInstancePlaybackLibrary">();
	}
	static class UMassTrafficInstancePlaybackLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInstancePlaybackLibrary>();
	}
};

// Class MassTraffic.MassTrafficInterpolationProcessor
// 0x0548 (0x0620 - 0x00D8)
class UMassTrafficInterpolationProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21DE[0x548];                                   // 0x00D8(0x0548)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficInterpolationProcessor">();
	}
	static class UMassTrafficInterpolationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficInterpolationProcessor>();
	}
};

// Class MassTraffic.MassTrafficIntersectionSimulationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficIntersectionSimulationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionSimulationTrait">();
	}
	static class UMassTrafficIntersectionSimulationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionSimulationTrait>();
	}
};

// Class MassTraffic.MassTrafficIntersectionSpawnDataGenerator
// 0x0040 (0x0070 - 0x0030)
class UMassTrafficIntersectionSpawnDataGenerator final : public UMassEntitySpawnDataGeneratorBase
{
public:
	int32                                         IntersectionEntityConfigIndex;                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21DF[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassTrafficLightTypesDataAsset*        TrafficLightTypesData;                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMassTrafficLightInstancesDataAsset*    TrafficLightInstanceData;                          // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrafficLightSearchDistance;                        // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntersectionSideToCrosswalkSearchDistance;         // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardTrafficGoSeconds;                          // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardMinimumTrafficGoSeconds;                   // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandardCrosswalkGoSeconds;                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnidirectionalTrafficStraightRightLeftGoSeconds;   // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnidirectionalTrafficStraightRightGoSeconds;       // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BidirectionalTrafficStraightRightGoSeconds;        // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreewayIncomingTrafficGoDurationScale;             // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21E0[0x4];                                     // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionSpawnDataGenerator">();
	}
	static class UMassTrafficIntersectionSpawnDataGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionSpawnDataGenerator>();
	}
};

// Class MassTraffic.MassTrafficLaneChangingProcessor
// 0x0548 (0x0620 - 0x00D8)
class UMassTrafficLaneChangingProcessor : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21E1[0x548];                                   // 0x00D8(0x0548)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLaneChangingProcessor">();
	}
	static class UMassTrafficLaneChangingProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLaneChangingProcessor>();
	}
};

// Class MassTraffic.MassTrafficLightRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficLightRepresentationActorManagement final : public UMassRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightRepresentationActorManagement">();
	}
	static class UMassTrafficLightRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightRepresentationActorManagement>();
	}
};

// Class MassTraffic.MassTrafficLightTypesDataAsset
// 0x0010 (0x0040 - 0x0030)
class UMassTrafficLightTypesDataAsset final : public UDataAsset
{
public:
	TArray<struct FMassTrafficLightTypeData>      TrafficLightTypes;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightTypesDataAsset">();
	}
	static class UMassTrafficLightTypesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightTypesDataAsset>();
	}
};

// Class MassTraffic.MassTrafficLightInstancesDataAsset
// 0x0028 (0x0058 - 0x0030)
class UMassTrafficLightInstancesDataAsset final : public UDataAsset
{
public:
	class UMassTrafficLightTypesDataAsset*        TrafficLightTypesData;                             // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMassTrafficLightInstanceDesc>  TrafficLights;                                     // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         NumTrafficLights;                                  // 0x0048(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21E2[0xC];                                     // 0x004C(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightInstancesDataAsset">();
	}
	static class UMassTrafficLightInstancesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightInstancesDataAsset>();
	}
};

// Class MassTraffic.MassTrafficIntersectionVisualizationLODProcessor
// 0x0000 (0x0B60 - 0x0B60)
class UMassTrafficIntersectionVisualizationLODProcessor final : public UMassVisualizationLODProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionVisualizationLODProcessor">();
	}
	static class UMassTrafficIntersectionVisualizationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionVisualizationLODProcessor>();
	}
};

// Class MassTraffic.MassTrafficIntersectionLODCollectorProcessor
// 0x0000 (0x0B60 - 0x0B60)
class UMassTrafficIntersectionLODCollectorProcessor final : public UMassLODCollectorProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficIntersectionLODCollectorProcessor">();
	}
	static class UMassTrafficIntersectionLODCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficIntersectionLODCollectorProcessor>();
	}
};

// Class MassTraffic.MassTrafficLightVisualizationProcessor
// 0x0000 (0x0370 - 0x0370)
class UMassTrafficLightVisualizationProcessor final : public UHTMassSimpleVisualizationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightVisualizationProcessor">();
	}
	static class UMassTrafficLightVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightVisualizationProcessor>();
	}
};

// Class MassTraffic.MassTrafficLightUpdateCustomVisualizationProcessor
// 0x02B0 (0x0370 - 0x00C0)
class alignas(0x10) UMassTrafficLightUpdateCustomVisualizationProcessor final : public UMassProcessor
{
public:
	class UWorld*                                 World;                                             // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21E3[0x2A8];                                   // 0x00C8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightUpdateCustomVisualizationProcessor">();
	}
	static class UMassTrafficLightUpdateCustomVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightUpdateCustomVisualizationProcessor>();
	}
};

// Class MassTraffic.MassTrafficLightVisualizationTrait
// 0x0020 (0x0160 - 0x0140)
class UMassTrafficLightVisualizationTrait final : public UMassVisualizationTrait
{
public:
	struct FMassTrafficLightsParameters           TrafficLightsParams;                               // 0x0140(0x0018)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_21E4[0x8];                                     // 0x0158(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficLightVisualizationTrait">();
	}
	static class UMassTrafficLightVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficLightVisualizationTrait>();
	}
};

// Class MassTraffic.MassTrafficObstacleTrait
// 0x0018 (0x0040 - 0x0028)
class UMassTrafficObstacleTrait final : public UMassEntityTraitBase
{
public:
	struct FAgentRadiusFragment                   RadiusFragment;                                    // 0x0028(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bSmallBoxObstacle;                                 // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_21E5[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BoxHalfWidth;                                      // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BoxHalfLength;                                     // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanObstacleMove;                                  // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_21E6[0x7];                                     // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficObstacleTrait">();
	}
	static class UMassTrafficObstacleTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficObstacleTrait>();
	}
};

// Class MassTraffic.MassTrafficOverseerProcessor
// 0x0318 (0x03F0 - 0x00D8)
class UMassTrafficOverseerProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21E7[0x318];                                   // 0x00D8(0x0318)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficOverseerProcessor">();
	}
	static class UMassTrafficOverseerProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficOverseerProcessor>();
	}
};

// Class MassTraffic.MassTrafficParkedVehicleRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficParkedVehicleRepresentationActorManagement final : public UMassRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficParkedVehicleRepresentationActorManagement">();
	}
	static class UMassTrafficParkedVehicleRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficParkedVehicleRepresentationActorManagement>();
	}
};

// Class MassTraffic.MassTrafficParkingSpacesDataAsset
// 0x0028 (0x0058 - 0x0030)
class UMassTrafficParkingSpacesDataAsset final : public UDataAsset
{
public:
	TArray<struct FMassTrafficTypedParkingSpaces> TypedParkingSpaces;                                // 0x0030(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         NumParkingSpaces;                                  // 0x0040(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21E8[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassTrafficTypedParkingSpaces> RandomTypedParkingSpaces;                          // 0x0048(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	void GenerateRandomVehicleName(const TArray<class FName>& VehicleIdList);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficParkingSpacesDataAsset">();
	}
	static class UMassTrafficParkingSpacesDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficParkingSpacesDataAsset>();
	}
};

// Class MassTraffic.MassTrafficParkedVehicleSpawnDataGenerator
// 0x0060 (0x0090 - 0x0030)
class UMassTrafficParkedVehicleSpawnDataGenerator : public UMassEntitySpawnDataGeneratorBase
{
public:
	TMap<TSoftObjectPtr<class UMassEntityConfigAsset>, class FName> EntityTypeToParkingSpaceType;                      // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)
	class UMassTrafficParkingSpacesDataAsset*     ParkingSpaces;                                     // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseAllParkingSpaces;                              // 0x0088(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21E9[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstacleExclusionRadius;                           // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficParkedVehicleSpawnDataGenerator">();
	}
	static class UMassTrafficParkedVehicleSpawnDataGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficParkedVehicleSpawnDataGenerator>();
	}
};

// Class MassTraffic.MassTrafficParkedVehicleVisualizationProcessor
// 0x0000 (0x0370 - 0x0370)
class UMassTrafficParkedVehicleVisualizationProcessor final : public UHTMassSimpleVisualizationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficParkedVehicleVisualizationProcessor">();
	}
	static class UMassTrafficParkedVehicleVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficParkedVehicleVisualizationProcessor>();
	}
};

// Class MassTraffic.MassTrafficParkedVehicleUpdateCustomVisualizationProcessor
// 0x02B0 (0x0370 - 0x00C0)
class alignas(0x10) UMassTrafficParkedVehicleUpdateCustomVisualizationProcessor final : public UMassProcessor
{
public:
	class UWorld*                                 World;                                             // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_21EA[0x2A8];                                   // 0x00C8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficParkedVehicleUpdateCustomVisualizationProcessor">();
	}
	static class UMassTrafficParkedVehicleUpdateCustomVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficParkedVehicleUpdateCustomVisualizationProcessor>();
	}
};

// Class MassTraffic.MassTrafficParkedVehicleVisualizationTrait
// 0x0000 (0x0140 - 0x0140)
class UMassTrafficParkedVehicleVisualizationTrait final : public UMassVisualizationTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficParkedVehicleVisualizationTrait">();
	}
	static class UMassTrafficParkedVehicleVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficParkedVehicleVisualizationTrait>();
	}
};

// Class MassTraffic.MassTrafficPlayerVehicleLODProcessor
// 0x02A0 (0x0360 - 0x00C0)
class UMassTrafficPlayerVehicleLODProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_21EB[0x2A0];                                   // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficPlayerVehicleLODProcessor">();
	}
	static class UMassTrafficPlayerVehicleLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficPlayerVehicleLODProcessor>();
	}
};

// Class MassTraffic.MassTrafficPostPhysicsUpdateDisturbedVehiclesProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficPostPhysicsUpdateDisturbedVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21EC[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficPostPhysicsUpdateDisturbedVehiclesProcessor">();
	}
	static class UMassTrafficPostPhysicsUpdateDisturbedVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficPostPhysicsUpdateDisturbedVehiclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficPostPhysicsUpdateTrafficVehiclesProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficPostPhysicsUpdateTrafficVehiclesProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21ED[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficPostPhysicsUpdateTrafficVehiclesProcessor">();
	}
	static class UMassTrafficPostPhysicsUpdateTrafficVehiclesProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficPostPhysicsUpdateTrafficVehiclesProcessor>();
	}
};

// Class MassTraffic.MassTrafficPostPhysicsUpdateTrailersProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficPostPhysicsUpdateTrailersProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21EE[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficPostPhysicsUpdateTrailersProcessor">();
	}
	static class UMassTrafficPostPhysicsUpdateTrailersProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficPostPhysicsUpdateTrailersProcessor>();
	}
};

// Class MassTraffic.MassTrafficRecycleVehiclesOverlappingPlayersProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassTrafficRecycleVehiclesOverlappingPlayersProcessor final : public UMassTrafficProcessorBase
{
public:
	uint8                                         Pad_21EF[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficRecycleVehiclesOverlappingPlayersProcessor">();
	}
	static class UMassTrafficRecycleVehiclesOverlappingPlayersProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficRecycleVehiclesOverlappingPlayersProcessor>();
	}
};

// Class MassTraffic.MassTrafficReplicator
// 0x0000 (0x0028 - 0x0028)
class UMassTrafficReplicator final : public UMassReplicatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTrafficReplicator">();
	}
	static class UMassTrafficReplicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTrafficReplicator>();
	}
};

// Class MassTraffic.MassTrafficSettings
// 0x0238 (0x0260 - 0x0028)
class UMassTrafficSettings final : public UMassModuleSettings
{
public:
	int32                                         RandomSeed;                                        // 0x0028(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    TrafficLaneFilter;                                 // 0x002C(0x000C)(Edit, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    IntersectionLaneFilter;                            // 0x0038(0x000C)(Edit, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    TrunkLaneFilter;                                   // 0x0044(0x000C)(Edit, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    LaneChangingLaneFilter;                            // 0x0050(0x000C)(Edit, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FZoneGraphTagFilter                    CrosswalkLaneFilter;                               // 0x005C(0x000C)(Edit, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FMassTrafficLaneSpeedLimit>     SpeedLimits;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	float                                         SpeedLimitVariancePct;                             // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedVariancePct;                                  // 0x007C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedLimitBlendTime;                               // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Acceleration;                                      // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AccelerationVariancePct;                           // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Deceleration;                                      // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DecelerationVariancePct;                           // 0x0090(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TurnSpeedScale;                                    // 0x0094(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedDeltaBrakingThreshold;                        // 0x0098(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21F0[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              IdealTimeToNextVehicleRange;                       // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              MinimumDistanceToNextVehicleRange;                 // 0x00B0(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              StoppingDistanceRange;                             // 0x00C0(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StopSignBrakingTime;                               // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxQuickStopSpeedMPH;                              // 0x00D4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedControlLaneLookAheadTime;                     // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedControlMinLookAheadDistance;                  // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassTrafficPIDControllerParams        SpeedPIDControllerParams;                          // 0x00E0(0x0010)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedPIDBrakeMultiplier;                           // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedCoastThreshold;                               // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringControlLaneLookAheadTime;                  // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteeringControlMinLookAheadDistance;               // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMassTrafficPIDControllerParams        SteeringPIDControllerParams;                       // 0x0100(0x0010)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LateralOffsetMax;                                  // 0x0110(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21F1[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LateralDeviationClampingRange;                     // 0x0118(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              VerticalDeviationClampingRange;                    // 0x0128(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VehicleDeviationTolerance;                         // 0x0138(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ParkedVehicleDeviationTolerance;                   // 0x013C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstacleSearchRadius;                              // 0x0140(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
