#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassCrowd

#include "Basic.hpp"

#include "MassSignals_classes.hpp"
#include "MassCrowd_structs.hpp"
#include "MassEntity_classes.hpp"
#include "MassReplication_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "ZoneGraphDebug_classes.hpp"
#include "Engine_classes.hpp"
#include "MassRepresentation_structs.hpp"
#include "MassRepresentation_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "MassActors_classes.hpp"
#include "MassLOD_classes.hpp"
#include "ZoneGraphAnnotations_classes.hpp"


namespace SDK
{

// Class MassCrowd.MassCrowdClientBubbleInfo
// 0x0288 (0x0540 - 0x02B8)
class AMassCrowdClientBubbleInfo final : public AMassClientBubbleInfoBase
{
public:
	struct FMassCrowdClientBubbleSerializer       CrowdSerializer;                                   // 0x02B8(0x0288)(Net, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdClientBubbleInfo">();
	}
	static class AMassCrowdClientBubbleInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassCrowdClientBubbleInfo>();
	}
};

// Class MassCrowd.ZoneGraphCloseCrowdLaneTest
// 0x0080 (0x00B0 - 0x0030)
class UZoneGraphCloseCrowdLaneTest final : public UZoneLaneTest
{
public:
	struct FZoneGraphLaneLocation                 LaneLocation;                                      // 0x0030(0x0070)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	class UMassCrowdSubsystem*                    CrowdSubsystem;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECrowdLaneState                               LaneState;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ECrowdLaneState                               PrevLaneState;                                     // 0x00A9(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_20CD[0x6];                                     // 0x00AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphCloseCrowdLaneTest">();
	}
	static class UZoneGraphCloseCrowdLaneTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphCloseCrowdLaneTest>();
	}
};

// Class MassCrowd.MassCrowdLaneDataRenderingComponent
// 0x0000 (0x0520 - 0x0520)
class UMassCrowdLaneDataRenderingComponent : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdLaneDataRenderingComponent">();
	}
	static class UMassCrowdLaneDataRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdLaneDataRenderingComponent>();
	}
};

// Class MassCrowd.MassCrowdMemberTrait
// 0x0000 (0x0028 - 0x0028)
class UMassCrowdMemberTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdMemberTrait">();
	}
	static class UMassCrowdMemberTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdMemberTrait>();
	}
};

// Class MassCrowd.MassCrowdLaneTrackingSignalProcessor
// 0x0000 (0x0420 - 0x0420)
class UMassCrowdLaneTrackingSignalProcessor final : public UMassSignalProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdLaneTrackingSignalProcessor">();
	}
	static class UMassCrowdLaneTrackingSignalProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdLaneTrackingSignalProcessor>();
	}
};

// Class MassCrowd.MassCrowdLaneTrackingDestructor
// 0x02A8 (0x0380 - 0x00D8)
class UMassCrowdLaneTrackingDestructor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_20CE[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdLaneTrackingDestructor">();
	}
	static class UMassCrowdLaneTrackingDestructor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdLaneTrackingDestructor>();
	}
};

// Class MassCrowd.MassCrowdDynamicObstacleProcessor
// 0x02B0 (0x0370 - 0x00C0)
class alignas(0x10) UMassCrowdDynamicObstacleProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_20CF[0x2A0];                                   // 0x00C0(0x02A0)(Fixing Size After Last Property [ Dumper-7 ])
	class UZoneGraphAnnotationSubsystem*          ZoneGraphAnnotationSubsystem;                      // 0x0360(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D0[0x8];                                     // 0x0368(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdDynamicObstacleProcessor">();
	}
	static class UMassCrowdDynamicObstacleProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdDynamicObstacleProcessor>();
	}
};

// Class MassCrowd.MassCrowdDynamicObstacleInitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassCrowdDynamicObstacleInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_20D1[0x2A8];                                   // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdDynamicObstacleInitializer">();
	}
	static class UMassCrowdDynamicObstacleInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdDynamicObstacleInitializer>();
	}
};

// Class MassCrowd.MassCrowdDynamicObstacleDeinitializer
// 0x02A8 (0x0380 - 0x00D8)
class alignas(0x10) UMassCrowdDynamicObstacleDeinitializer final : public UMassObserverProcessor
{
public:
	class UZoneGraphAnnotationSubsystem*          ZoneGraphAnnotationSubsystem;                      // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D2[0x2A0];                                   // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdDynamicObstacleDeinitializer">();
	}
	static class UMassCrowdDynamicObstacleDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdDynamicObstacleDeinitializer>();
	}
};

// Class MassCrowd.MassCrowdReplicator
// 0x0000 (0x0028 - 0x0028)
class UMassCrowdReplicator final : public UMassReplicatorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdReplicator">();
	}
	static class UMassCrowdReplicator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdReplicator>();
	}
};

// Class MassCrowd.MassCrowdRepresentationActorManagement
// 0x0000 (0x0028 - 0x0028)
class UMassCrowdRepresentationActorManagement : public UMassRepresentationActorManagement
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdRepresentationActorManagement">();
	}
	static class UMassCrowdRepresentationActorManagement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdRepresentationActorManagement>();
	}
};

// Class MassCrowd.MassCrowdRepresentationSubsystem
// 0x0000 (0x00D0 - 0x00D0)
class UMassCrowdRepresentationSubsystem final : public UMassRepresentationSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdRepresentationSubsystem">();
	}
	static class UMassCrowdRepresentationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdRepresentationSubsystem>();
	}
};

// Class MassCrowd.MassCrowdServerRepresentationLODProcessor
// 0x22E0 (0x23A0 - 0x00C0)
class UMassCrowdServerRepresentationLODProcessor final : public UMassProcessor
{
public:
	float                                         LODDistance[0x4];                                  // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BufferHysteresisOnDistancePercentage;              // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LODMaxCount[0x4];                                  // 0x00D4(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D3[0x22BC];                                  // 0x00E4(0x22BC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdServerRepresentationLODProcessor">();
	}
	static class UMassCrowdServerRepresentationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdServerRepresentationLODProcessor>();
	}
};

// Class MassCrowd.MassCrowdServerRepresentationProcessor
// 0x0000 (0x0370 - 0x0370)
class UMassCrowdServerRepresentationProcessor final : public UMassRepresentationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdServerRepresentationProcessor">();
	}
	static class UMassCrowdServerRepresentationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdServerRepresentationProcessor>();
	}
};

// Class MassCrowd.MassCrowdServerRepresentationTrait
// 0x0030 (0x0058 - 0x0028)
class UMassCrowdServerRepresentationTrait final : public UMassEntityTraitBase
{
public:
	TSubclassOf<class AActor>                     TemplateActor;                                     // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMassRepresentationParameters          Params;                                            // 0x0030(0x0028)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdServerRepresentationTrait">();
	}
	static class UMassCrowdServerRepresentationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdServerRepresentationTrait>();
	}
};

// Class MassCrowd.MassCrowdSettings
// 0x0058 (0x0080 - 0x0028)
class UMassCrowdSettings final : public UMassModuleSettings
{
public:
	float                                         LaneBaseLineThickness;                             // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaneRenderZOffset;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntersectionLaneScaleFactor;                       // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LaneDensityScaleFactor;                            // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 OpenedLaneColor;                                   // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ClosedLaneColor;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTag                          CrowdTag;                                          // 0x0040(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FZoneGraphTag                          CrossingTag;                                       // 0x0041(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20D4[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SlotSize;                                          // 0x0044(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlotOffset;                                        // 0x0048(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplayTrackingData;                              // 0x004C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplayStates;                                    // 0x004D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisplayDensities;                                 // 0x004E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_20D5[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstacleStoppingSpeedTolerance;                    // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstacleMovingDistanceTolerance;                   // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstacleTimeToStop;                                // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ObstacleEffectRadius;                              // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MassCrowdGridSize;                                 // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MoveDistance;                                      // 0x0064(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveDistanceRandomDeviation;                       // 0x0068(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D6[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassCrowdLaneDensityDesc>      LaneDensities;                                     // 0x0070(0x0010)(Edit, ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdSettings">();
	}
	static class UMassCrowdSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdSettings>();
	}
};

// Class MassCrowd.MassCrowdSpawnerSubsystem
// 0x0000 (0x00F0 - 0x00F0)
class UMassCrowdSpawnerSubsystem final : public UMassActorSpawnerSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdSpawnerSubsystem">();
	}
	static class UMassCrowdSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdSpawnerSubsystem>();
	}
};

// Class MassCrowd.MassCrowdSubsystem
// 0x0040 (0x0078 - 0x0038)
class UMassCrowdSubsystem final : public UMassSubsystemBase
{
public:
	class UZoneGraphSubsystem*                    ZoneGraphSubsystem;                                // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UZoneGraphAnnotationSubsystem*          ZoneGraphAnnotationSubsystem;                      // 0x0040(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassCrowdSettings*                     MassCrowdSettings;                                 // 0x0048(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D7[0x28];                                    // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdSubsystem">();
	}
	static class UMassCrowdSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdSubsystem>();
	}
};

// Class MassCrowd.MassCrowdVisualizationLODProcessor
// 0x0000 (0x0B60 - 0x0B60)
class UMassCrowdVisualizationLODProcessor final : public UMassVisualizationLODProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdVisualizationLODProcessor">();
	}
	static class UMassCrowdVisualizationLODProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdVisualizationLODProcessor>();
	}
};

// Class MassCrowd.MassCrowdLODCollectorProcessor
// 0x0000 (0x0B60 - 0x0B60)
class UMassCrowdLODCollectorProcessor final : public UMassLODCollectorProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdLODCollectorProcessor">();
	}
	static class UMassCrowdLODCollectorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdLODCollectorProcessor>();
	}
};

// Class MassCrowd.MassCrowdVisualizationProcessor
// 0x0000 (0x0370 - 0x0370)
class UMassCrowdVisualizationProcessor final : public UMassVisualizationProcessor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdVisualizationProcessor">();
	}
	static class UMassCrowdVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdVisualizationProcessor>();
	}
};

// Class MassCrowd.MassDebugCrowdVisualizationProcessor
// 0x02B0 (0x0370 - 0x00C0)
class alignas(0x10) UMassDebugCrowdVisualizationProcessor final : public UMassProcessor
{
public:
	class UWorld*                                 World;                                             // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D8[0x2A8];                                   // 0x00C8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassDebugCrowdVisualizationProcessor">();
	}
	static class UMassDebugCrowdVisualizationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassDebugCrowdVisualizationProcessor>();
	}
};

// Class MassCrowd.MassCrowdVisualizationTrait
// 0x0000 (0x0140 - 0x0140)
class UMassCrowdVisualizationTrait : public UMassVisualizationTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCrowdVisualizationTrait">();
	}
	static class UMassCrowdVisualizationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCrowdVisualizationTrait>();
	}
};

// Class MassCrowd.ZoneGraphCrowdLaneAnnotations
// 0x0020 (0x05B0 - 0x0590)
class UZoneGraphCrowdLaneAnnotations final : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTag                          CloseLaneTag;                                      // 0x0590(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          WaitingLaneTag;                                    // 0x0591(0x0001)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDisplayTags;                                      // 0x0592(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_20D9[0x15];                                    // 0x0593(0x0015)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassCrowdSubsystem*                    CrowdSubsystem;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ZoneGraphCrowdLaneAnnotations">();
	}
	static class UZoneGraphCrowdLaneAnnotations* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneGraphCrowdLaneAnnotations>();
	}
};

}

