#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassNpc_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MassNpc_AnimBP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.ExecuteUbergraph_MassNpc_AnimBP_Base
// 0x0008 (0x0008 - 0x0000)
struct MassNpc_AnimBP_Base_C_ExecuteUbergraph_MassNpc_AnimBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.FootIK
// 0x0020 (0x0020 - 0x0000)
struct MassNpc_AnimBP_Base_C_FootIK final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_FootIK;                                      // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

// Function MassNpc_AnimBP_Base.MassNpc_AnimBP_Base_C.FootIKLayer
// 0x0020 (0x0020 - 0x0000)
struct MassNpc_AnimBP_Base_C_FootIKLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_FootIKLayer;                                 // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};

}

