#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_02_Ghost_BP_Vision_Projector

#include "Basic.hpp"


namespace SDK::Params
{

// Function mon_02_Ghost_BP_Vision_Projector.mon_02_Ghost_BP_Vision_Projector_C.ExecuteUbergraph_mon_02_Ghost_BP_Vision_Projector
// 0x0038 (0x0038 - 0x0000)
struct Mon_02_Ghost_BP_Vision_Projector_C_ExecuteUbergraph_mon_02_Ghost_BP_Vision_Projector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          K2Node_DynamicCast_AsAk_Audio_Event;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D7[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventOnActor_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function mon_02_Ghost_BP_Vision_Projector.mon_02_Ghost_BP_Vision_Projector_C.OnLoaded_8E6E48BA4C7BF0CF99F22AA10A51CB14
// 0x0008 (0x0008 - 0x0000)
struct Mon_02_Ghost_BP_Vision_Projector_C_OnLoaded_8E6E48BA4C7BF0CF99F22AA10A51CB14 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}

