#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MonsterFootIK_AnimLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MonsterFootIK_AnimLayer_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MonsterFootIK_AnimLayer.MonsterFootIK_AnimLayer_C
// 0x0F90 (0x15A0 - 0x0610)
class UMonsterFootIK_AnimLayer_C final : public UHTFootIKAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct MonsterFootIK_AnimLayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0618(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_57AA[0x6];                                     // 0x061A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0620(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0628(0x0008)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0630(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0758(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0880(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x08A0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x09C8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0AF0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C18(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D40(0x0128)()
	uint8                                         Pad_57AB[0x8];                                     // 0x0E68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0E70(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x10F0(0x0280)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1370(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1398(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x13E0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1460(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1488(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x14A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1560(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1580(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MonsterFootIK_AnimLayer_AnimGraphNode_BlendListByBool_E49A5D694B3B3BA6AF584E98EBF64BF7();
	void ExecuteUbergraph_MonsterFootIK_AnimLayer(int32 EntryPoint);
	void FootIKLayer(const struct FPoseLink& InPose, struct FPoseLink* Param_FootIKLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MonsterFootIK_AnimLayer_C">();
	}
	static class UMonsterFootIK_AnimLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMonsterFootIK_AnimLayer_C>();
	}
};

}

