#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotMovingAnimLayerBase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NotMovingAnimLayerBase_BP.NotMovingAnimLayerBase_BP_C
// 0x0AF0 (0x0EF0 - 0x0400)
class UNotMovingAnimLayerBase_BP_C : public UHTNotMovingAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0418(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0500(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0528(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0548(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0570(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0590(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x05D8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x05F8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0640(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0688(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x06A8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0770(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x07C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07E8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0810(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0858(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0878(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x08C0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x08E0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0928(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0948(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0A10(0x0080)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0A90(0x0440)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0ED0(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_RandomLeisureClear();
	void AnimNotify_RandomLeisureStart();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_0ABC68D447B1585F57070FA0177A20AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_25B702EA471563B17201148634127050();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_43C629934C657AE23A91A482A27209AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_70239CCD416AF1A1A7A6EFA80BE71EAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayerBase_BP_AnimGraphNode_TransitionResult_CB14F22541588A3E7AB173B4671ED52B();
	void ExecuteUbergraph_NotMovingAnimLayerBase_BP(int32 EntryPoint);
	void NotMoving(struct FPoseLink* Param_NotMoving);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NotMovingAnimLayerBase_BP_C">();
	}
	static class UNotMovingAnimLayerBase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNotMovingAnimLayerBase_BP_C>();
	}
};

}

