#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NotMovingAnimLayer_Fadia_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NotMovingAnimLayer_Fadia_BP.NotMovingAnimLayer_Fadia_BP_C
// 0x0800 (0x0C00 - 0x0400)
class UNotMovingAnimLayer_Fadia_BP_C final : public UHTNotMovingAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0408(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0410(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0418(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0578(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x05A0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x05E8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0608(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0650(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0670(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0690(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x06B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x06D8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0720(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0740(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0788(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x07D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x07F0(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x08B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0930(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0958(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x09A0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x09C0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0A08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0A70(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0A90(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B58(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0BD8(0x0020)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_RandomLeisureClear();
	void AnimNotify_RandomLeisureStart();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP_AnimGraphNode_TransitionResult_664B29EF43D0CC092AEFAE8308A6A976();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP_AnimGraphNode_TransitionResult_8618C15B43601F2AF1B857B5FE55AC7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP_AnimGraphNode_TransitionResult_C213E8124FFE4738DA5531A967B3111B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP_AnimGraphNode_TransitionResult_D8B1783B4523FA4C8FDE7B809D070FE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP_AnimGraphNode_TransitionResult_E48DA96A45608BCBCBD8E796D966EE05();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP_AnimGraphNode_TransitionResult_E6A38DCB4EC25DDA0129FCBBECA31BD2();
	void ExecuteUbergraph_NotMovingAnimLayer_Fadia_BP(int32 EntryPoint);
	void NotMoving(struct FPoseLink* Param_NotMoving);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NotMovingAnimLayer_Fadia_BP_C">();
	}
	static class UNotMovingAnimLayer_Fadia_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNotMovingAnimLayer_Fadia_BP_C>();
	}
};

}

