#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OneEngineSDK

#include "Basic.hpp"

#include "OneEngineSDK_structs.hpp"


namespace SDK::Params
{

// Function OneEngineSDK.OnePSLocaleEnum.Arabic
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Arabic final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Chinese_S
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Chinese_S final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Chinese_T
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Chinese_T final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Czech
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Czech final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Danish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Danish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Dutch
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Dutch final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.English_GB
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_English_GB final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.English_US
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_English_US final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Finnish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Finnish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.French
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_French final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.French_CA
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_French_CA final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.German
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_German final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Greek
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Greek final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Hungarian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Hungarian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Indonesian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Indonesian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Italian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Italian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Japanese
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Japanese final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Korean
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Korean final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Norwegian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Norwegian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Polish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Polish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Portuguese_BR
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Portuguese_BR final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Portuguese_PT
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Portuguese_PT final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Romanian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Romanian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Russian
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Russian final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Spanish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Spanish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Spanish_LA
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Spanish_LA final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Swedish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Swedish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Thai
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Thai final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Turkish
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Turkish final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OnePSLocaleEnum.Vietnamese
// 0x0010 (0x0010 - 0x0000)
struct OnePSLocaleEnum_Vietnamese final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.CheckPremium
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_CheckPremium final
{
public:
	TDelegate<void(int32 Code, bool bIsPremium)>  OnCheckPremiumResult;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnCheckPremiumResultDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OneEngineSDKPSSubsystem_OnCheckPremiumResultDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPremium;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3212[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.FilterProfanity
// 0x0030 (0x0030 - 0x0000)
struct OneEngineSDKPSSubsystem_FilterProfanity final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Text)> OnFilterProfanityResult;                           // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnFilterProfanityResultDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKPSSubsystem_OnFilterProfanityResultDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3213[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Text;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.FilterProfanitySync
// 0x0038 (0x0038 - 0x0000)
struct OneEngineSDKPSSubsystem_FilterProfanitySync final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutResult;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3214[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetBlockingUsers
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKPSSubsystem_GetBlockingUsers final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FOnePSUserProfileResponse& ProfileList)> OnGetBlockingUsersResult;                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnGetBlockingUsersResultDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKPSSubsystem_OnGetBlockingUsersResultDelegate__DelegateSignature final
{
public:
	struct FOnePSUserProfileResponse              ProfileList;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetCommunicationRestrictionStatus
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetCommunicationRestrictionStatus final
{
public:
	TDelegate<void(int32 Result)>                 OnRestrictionStatusResult;                         // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnRestrictionStatusResultDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKPSSubsystem_OnRestrictionStatusResultDelegate__DelegateSignature final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetFriends
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKPSSubsystem_GetFriends final
{
public:
	int32                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(struct FOnePSUserProfileResponse& ProfileList)> OnGetFriendsResult;                                // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnGetFriendsResultDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKPSSubsystem_OnGetFriendsResultDelegate__DelegateSignature final
{
public:
	struct FOnePSUserProfileResponse              ProfileList;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetProductInfoListPS
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKPSSubsystem_GetProductInfoListPS final
{
public:
	int32                                         ServiceLabel;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3215[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CategoryLabel;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, struct FOnePSProductCategory& Category, int32 Code, const class FString& Msg)> Callback;                                          // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnGetProductInfoListPSDelegate__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct OneEngineSDKPSSubsystem_OnGetProductInfoListPSDelegate__DelegateSignature final
{
public:
	bool                                          bSucceed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3216[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOnePSProductCategory                  Category;                                          // 0x0008(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Code;                                              // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3217[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Msg;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.HideStoreIcon
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKPSSubsystem_HideStoreIcon final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.OnOpenDialogResultDelegate__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKPSSubsystem_OnOpenDialogResultDelegate__DelegateSignature final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.OpenCommerceDialogPremiumMode
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_OpenCommerceDialogPremiumMode final
{
public:
	TDelegate<void(int32 Result)>                 OnOpenDialogResult;                                // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.ShowStoreIcon
// 0x0008 (0x0008 - 0x0000)
struct OneEngineSDKPSSubsystem_ShowStoreIcon final
{
public:
	EOnePSStoreIconPos                            Pos;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3218[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.StartNotifyPremiumFeature
// 0x000C (0x000C - 0x0000)
struct OneEngineSDKPSSubsystem_StartNotifyPremiumFeature final
{
public:
	int32                                         Interval;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Mark;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.StopNotifyPremiumFeature
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKPSSubsystem_StopNotifyPremiumFeature final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKPSSubsystem.WidgetVisibilityDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OneEngineSDKPSSubsystem_WidgetVisibilityDelegate__DelegateSignature final
{
public:
	int32                                         WidgetType;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3219[0x3];                                     // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetAccountId
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetAccountId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetAccountState
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKPSSubsystem_GetAccountState final
{
public:
	EOnePsnAccountState                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKPSSubsystem.GetOnlineId
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKPSSubsystem_GetOnlineId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.ActivateDevice
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKSubsystem_ActivateDevice final
{
public:
	class FString                                 ServerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, bool bNeedActCode, const class FString& ActCodePrompt, int32 Code, const class FString& ErrorMsg)> OneActivateDeviceResultDelegate;                   // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneActivateDeviceResultDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct OneEngineSDKSubsystem_OneActivateDeviceResultDelegate__DelegateSignature final
{
public:
	bool                                          bSucceed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNeedActCode;                                      // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321B[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ActCodePrompt;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Code;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMsg;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.Bind
// 0x0014 (0x0014 - 0x0000)
struct OneEngineSDKSubsystem_Bind final
{
public:
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg, EOneEngineThirdType BindType, struct FOneUserInfo& UserInfo)> BindDelegate;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOneEngineThirdType                           BindType;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321D[0x3];                                     // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneBindResultDelegate__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct OneEngineSDKSubsystem_OneBindResultDelegate__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321E[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOneEngineThirdType                           BindType;                                          // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321F[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOneUserInfo                           UserInfo;                                          // 0x0020(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.CallCommonFunction
// 0x0030 (0x0030 - 0x0000)
struct OneEngineSDKSubsystem_CallCommonFunction final
{
public:
	class FString                                 FuncName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Params_0;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& FunctionName, int32 Result, const class FString& Msg)> CommonFunctionDelegate;                            // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneCommonFunctionDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKSubsystem_OneCommonFunctionDelegate__DelegateSignature final
{
public:
	class FString                                 FunctionName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Result;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3220[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Msg;                                               // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.CheckSelfPermission
// 0x0002 (0x0002 - 0x0000)
struct OneEngineSDKSubsystem_CheckSelfPermission final
{
public:
	EOnePermissionType                            Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.DisplayCDKeyDialog
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKSubsystem_DisplayCDKeyDialog final
{
public:
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg)> OnCDKeyActivateResult;                             // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneGenericResultDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKSubsystem_OneGenericResultDelegate__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3221[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.EnableDebugMode
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKSubsystem_EnableDebugMode final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.ExaminStatus
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKSubsystem_ExaminStatus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.ExchangeActCode
// 0x0030 (0x0030 - 0x0000)
struct OneEngineSDKSubsystem_ExchangeActCode final
{
public:
	class FString                                 ServerId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActCode;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg)> GenericResultDelegate;                             // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.FetchAntiAddictionInfo
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_FetchAntiAddictionInfo final
{
public:
	TDelegate<void(struct FOneAntiAddictionInfo& Info)> OnFetchAntiAddictionInfo;                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneFetchAntiAddictionInfoDelegate__DelegateSignature
// 0x0080 (0x0080 - 0x0000)
struct OneEngineSDKSubsystem_OneFetchAntiAddictionInfoDelegate__DelegateSignature final
{
public:
	struct FOneAntiAddictionInfo                  Info;                                              // 0x0000(0x0080)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.FetchUserRoleInfoList
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKSubsystem_FetchUserRoleInfoList final
{
public:
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg, TArray<struct FOneURCRoleInfo>& RoleList)> OnFetchUserRoleListDelegate;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerId;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneFetchUserRoleInfoListDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKSubsystem_OneFetchUserRoleInfoListDelegate__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3222[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOneURCRoleInfo>                RoleList;                                          // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GameGetServerListEvent
// 0x0038 (0x0038 - 0x0000)
struct OneEngineSDKSubsystem_GameGetServerListEvent final
{
public:
	EOneResEventState                             State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3223[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorCode;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMsg;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GameResDecEvent
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKSubsystem_GameResDecEvent final
{
public:
	EOneResEventState                             State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3224[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMsg;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GameResReqEvent
// 0x0038 (0x0038 - 0x0000)
struct OneEngineSDKSubsystem_GameResReqEvent final
{
public:
	EOneResEventState                             State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3225[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorCode;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMsg;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GameUpdateAssetEvent
// 0x0038 (0x0038 - 0x0000)
struct OneEngineSDKSubsystem_GameUpdateAssetEvent final
{
public:
	EOneResEventState                             State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3226[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorCode;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMsg;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetChannelId
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetChannelId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetChannelMediaId
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetChannelMediaId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetChannelPlatform
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetChannelPlatform final
{
public:
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg, const class FString& Platform)> OnGetPlatformResultDelegate;                       // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneGetPlatformDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKSubsystem_OneGetPlatformDelegate__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3227[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Platform;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetCurrentLanguage
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetCurrentLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetDeviceInfo
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetDeviceInfo final
{
public:
	TDelegate<void(struct FOneDeviceInfo& DeviceInfo)> Delegate;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneGetDeviceInfoDelegate__DelegateSignature
// 0x0070 (0x0070 - 0x0000)
struct OneEngineSDKSubsystem_OneGetDeviceInfoDelegate__DelegateSignature final
{
public:
	struct FOneDeviceInfo                         DeviceInfo;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetPermissions
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetPermissions final
{
public:
	TArray<struct FOnePermissionInfo>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetPlatformOS
// 0x0004 (0x0004 - 0x0000)
struct OneEngineSDKSubsystem_GetPlatformOS final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetProductList
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKSubsystem_GetProductList final
{
public:
	TArray<class FString>                         ProductIds;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(bool bSucceed, int32 Code, TArray<struct FOneProductInfo>& ProductListResult)> ProductResultDelegate;                             // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneProductInfoDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKSubsystem_OneProductInfoDelegate__DelegateSignature final
{
public:
	bool                                          bSucceed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3228[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOneProductInfo>                ProductListResult;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetPushNotDisturb
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetPushNotDisturb final
{
public:
	TDelegate<void(bool bSucceed, int32 Code, const class FString& ErrorMsg, struct FOnePushNotDisturbInfo& DisturbInfo)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OnePushNotDisturbInfoDelegate__DelegateSignature
// 0x0040 (0x0040 - 0x0000)
struct OneEngineSDKSubsystem_OnePushNotDisturbInfoDelegate__DelegateSignature final
{
public:
	bool                                          bSucceed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3229[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMsg;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOnePushNotDisturbInfo                 DisturbInfo;                                       // 0x0018(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetPushStatus
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetPushStatus final
{
public:
	TDelegate<void(const struct FOnePushStatus& PushStatus)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OnePushStatusDelegate__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct OneEngineSDKSubsystem_OnePushStatusDelegate__DelegateSignature final
{
public:
	struct FOnePushStatus                         PushStatus;                                        // 0x0000(0x0002)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetPushTypeInfoList
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetPushTypeInfoList final
{
public:
	TDelegate<void(bool bSucceed, int32 Code, const class FString& ErrorMsg, TArray<struct FOnePushTypeInfo>& PushTasks)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneGetPushTypeInfoListDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKSubsystem_OneGetPushTypeInfoListDelegate__DelegateSignature final
{
public:
	bool                                          bSucceed;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_322A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ErrorMsg;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOnePushTypeInfo>               PushTasks;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetQRCodeScanResult
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetQRCodeScanResult final
{
public:
	TDelegate<void(const class FString& CodeType, const class FString& CodeLink)> OnGetQRCodeScanResultDelegate;                     // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneGetQRCodeScanResultDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct OneEngineSDKSubsystem_OneGetQRCodeScanResultDelegate__DelegateSignature final
{
public:
	class FString                                 CodeType;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CodeLink;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetRegionType
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKSubsystem_GetRegionType final
{
public:
	EOneEngineSDKRegionType                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetSupportedLanguageCodeList
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetSupportedLanguageCodeList final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetUserInfo
// 0x0090 (0x0090 - 0x0000)
struct OneEngineSDKSubsystem_GetUserInfo final
{
public:
	struct FOneUserInfo                           ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetUserLocationInfo
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetUserLocationInfo final
{
public:
	TDelegate<void(struct FOneUserLocationInfo& LocationInfo)> LocationInfoDelegate;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneUserLocationInfoDelegate__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct OneEngineSDKSubsystem_OneUserLocationInfoDelegate__DelegateSignature final
{
public:
	struct FOneUserLocationInfo                   LocationInfo;                                      // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.GetUserTokenList
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_GetUserTokenList final
{
public:
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg, TArray<struct FOneUserInfo>& TokenList)> OnGetTokenListDelegate;                            // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneFetchUserTokenListDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct OneEngineSDKSubsystem_OneFetchUserTokenListDelegate__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_322B[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOneUserInfo>                   TokenList;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.Init
// 0x0010 (0x0010 - 0x0000)
struct OneEngineSDKSubsystem_Init final
{
public:
	TDelegate<void(bool bSuccess, int32 Code, const class FString& Msg)> InitDelegate;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneInitDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKSubsystem_OneInitDelegate__DelegateSignature final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_322C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Code;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Msg;                                               // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.IsCommonFunctionSupported
// 0x0018 (0x0018 - 0x0000)
struct OneEngineSDKSubsystem_IsCommonFunctionSupported final
{
public:
	class FString                                 FuncName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_322D[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function OneEngineSDK.OneEngineSDKSubsystem.IsDebugMode
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKSubsystem_IsDebugMode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function OneEngineSDK.OneEngineSDKSubsystem.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct OneEngineSDKSubsystem_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction OneEngineSDK.OneEngineSDKSubsystem.OneAntiAddictionTimeoutDelegate__DelegateSignature
// 0x0088 (0x0088 - 0x0000)
struct OneEngineSDKSubsystem_OneAntiAddictionTimeoutDelegate__DelegateSignature final
{
public:
	bool                                          bForceKick;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
