#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PatcherSDK

#include "Basic.hpp"

#include "PatcherSDK_structs.hpp"


namespace SDK::Params
{

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.ApplyPlayAssetsProgressDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_ApplyPlayAssetsProgressDelegate__DelegateSignature final
{
public:
	int32                                         TotalPackage;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentPackage;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         TotalBytes;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentBytes;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.AvailableVersionsDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_AvailableVersionsDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3248[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.CheckAndDoUpdateBaseResource
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_CheckAndDoUpdateBaseResource final
{
public:
	class FString                                 Tags;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3249[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.CheckBaseResource
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_CheckBaseResource final
{
public:
	class FString                                 Tags;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPatcherBaseResCheckStatusCallback     Callback;                                          // 0x0010(0x0020)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324A[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.CheckResultDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_CheckResultDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.ClearResCompletedDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_ClearResCompletedDelegate__DelegateSignature final
{
public:
	int32                                         Result;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.DoUpdateBaseResource
// 0x0020 (0x0020 - 0x0000)
struct PatcherSDKSubsystem_DoUpdateBaseResource final
{
public:
	bool                                          ClearResource;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324D[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Tags;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324E[0x4];                                     // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.DownloadDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_DownloadDelegate__DelegateSignature final
{
public:
	int64                                         TotalSize;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Progress;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_324F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Speed;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.DownloadResCheckProgressDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_DownloadResCheckProgressDelegate__DelegateSignature final
{
public:
	int32                                         TotalFileCount;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CheckedFileCount;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         TotalBytes;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CheckedBytes;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentResName;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentFileSize;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentCheckedSize;                                // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.EnableBackgroundtask
// 0x0008 (0x0008 - 0x0000)
struct PatcherSDKSubsystem_EnableBackgroundtask final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3250[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.EnablePushNotify
// 0x0001 (0x0001 - 0x0000)
struct PatcherSDKSubsystem_EnablePushNotify final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.FixResourceDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PatcherSDKSubsystem_FixResourceDelegate__DelegateSignature final
{
public:
	int32                                         Totalcount;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Remaincount;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPatcherFileOper                              PatcherFileOper;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3251[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentFixedFile;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.FixResourceFileStartDelegate__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct PatcherSDKSubsystem_FixResourceFileStartDelegate__DelegateSignature final
{
public:
	int64                                         TotalResouceByteSize;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         TotalFixedResourceSize;                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentResourceTotalSize;                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPatcherFileOper                              PatcherFileOper;                                   // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3252[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentFile;                                       // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetCDNList
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_GetCDNList final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetConfigByKey
// 0x0020 (0x0020 - 0x0000)
struct PatcherSDKSubsystem_GetConfigByKey final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetDeviceFreeSpace
// 0x0008 (0x0008 - 0x0000)
struct PatcherSDKSubsystem_GetDeviceFreeSpace final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetLocalAppversion
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_GetLocalAppversion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetLocalResversion
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_GetLocalResversion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetPatcherVersion
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_GetPatcherVersion final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetPlayAssetsSize
// 0x0008 (0x0008 - 0x0000)
struct PatcherSDKSubsystem_GetPlayAssetsSize final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.GetServerListFile
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_GetServerListFile final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.Init
// 0x0090 (0x0090 - 0x0000)
struct PatcherSDKSubsystem_Init final
{
public:
	class FString                                 ConfigPath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SDKLogLevel;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3253[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPatcherSDKPathInfo                    PathInfo;                                          // 0x0018(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 DeviceID;                                          // 0x0068(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MediaID;                                           // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3254[0x4];                                     // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.InitWithJsonContent
// 0x0090 (0x0090 - 0x0000)
struct PatcherSDKSubsystem_InitWithJsonContent final
{
public:
	class FString                                 ConfigJsonContent;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SDKLogLevel;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3255[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPatcherSDKPathInfo                    PathInfo;                                          // 0x0018(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 DeviceID;                                          // 0x0068(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MediaID;                                           // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0088(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3256[0x4];                                     // 0x008C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.IsBackgroundtaskEnabled
// 0x0004 (0x0004 - 0x0000)
struct PatcherSDKSubsystem_IsBackgroundtaskEnabled final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.LocalResCheckProgressDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_LocalResCheckProgressDelegate__DelegateSignature final
{
public:
	int32                                         TotalFileCount;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CheckedFileCount;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         TotalBytes;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CheckedBytes;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentResName;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentFileSize;                                   // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentCheckedSize;                                // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.LowSpeedNotifyDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_LowSpeedNotifyDelegate__DelegateSignature final
{
public:
	class FString                                 CurrentCDN;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         CurrentSpeedBytesPerSecond;                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Reverse;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.PreDownloadDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_PreDownloadDelegate__DelegateSignature final
{
public:
	int64                                         WillDownloadBytes;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateNeedSpaceBytes;                              // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         FreeDiskspaceBytes;                                // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.PreDownloadWithTagsDelegate__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_PreDownloadWithTagsDelegate__DelegateSignature final
{
public:
	int64                                         BaseBytes;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         WillDownloadBaseBytes;                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateNeedSpaceBaseBytes;                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         AllBytes;                                          // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         WillDownloadAllBytes;                              // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         UpdateNeedSpaceAllBytes;                           // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         FreeDiskspaceBytes;                                // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.PreReleaseCancel
// 0x0004 (0x0004 - 0x0000)
struct PatcherSDKSubsystem_PreReleaseCancel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.PreReleaseCheckDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_PreReleaseCheckDelegate__DelegateSignature final
{
public:
	bool                                          bHasPreRelease;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3257[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PreReleaseBranch;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PreReleaseResVersion;                              // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.PreReleaseCheckStatus
// 0x0024 (0x0024 - 0x0000)
struct PatcherSDKSubsystem_PreReleaseCheckStatus final
{
public:
	struct FPatcherPreReleaseCheckStatusCallback  Callback;                                          // 0x0000(0x0020)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.PreReleaseRequest
// 0x0034 (0x0034 - 0x0000)
struct PatcherSDKSubsystem_PreReleaseRequest final
{
public:
	struct FPreReleaseRequestCallback             Callback;                                          // 0x0000(0x0030)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.RefreshConfigDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RefreshConfigDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3258[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RefreshConfigWithCallback
// 0x0014 (0x0014 - 0x0000)
struct PatcherSDKSubsystem_RefreshConfigWithCallback final
{
public:
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.RefreshServerListDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RefreshServerListDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3259[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FilePath;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RefreshServerListWithCallback
// 0x0014 (0x0014 - 0x0000)
struct PatcherSDKSubsystem_RefreshServerListWithCallback final
{
public:
	bool                                          bAsync;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325A[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& FilePath)> Callback;                                          // 0x0004(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RefreshServerlistWithURL
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RefreshServerlistWithURL final
{
public:
	bool                                          bAsync;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ServelistURL;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& FilePath)> Callback;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RequestAvailableVersions
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_RequestAvailableVersions final
{
public:
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RequestCancelDownload
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_RequestCancelDownload final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalDir;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325C[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.RequestCheckAppInfoDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RequestCheckAppInfoDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RequestCheckAppNeedUpdate
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_RequestCheckAppNeedUpdate final
{
public:
	class FString                                 ChannelId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MediaID;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325E[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.RequestDownloadFile
// 0x0058 (0x0058 - 0x0000)
struct PatcherSDKSubsystem_RequestDownloadFile final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LocalDir;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Param_Name;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPatcherRequestDownloadFileCallback    Callback;                                          // 0x0030(0x0020)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_325F[0x4];                                     // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.RequestTagVersioninfo
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RequestTagVersioninfo final
{
public:
	class FString                                 TagName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3260[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.RequestTagVersionInfoDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RequestTagVersionInfoDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3261[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.RequestVersioninfo
// 0x0014 (0x0014 - 0x0000)
struct PatcherSDKSubsystem_RequestVersioninfo final
{
public:
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.RequestVersionInfoDelegate__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_RequestVersionInfoDelegate__DelegateSignature final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3262[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Desc;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.ResourceCheckResult
// 0x0040 (0x0040 - 0x0000)
struct PatcherSDKSubsystem_ResourceCheckResult final
{
public:
	bool                                          Async;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3263[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Dirs;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Filters;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(int32 Code, const class FString& Desc, const class FString& Content)> Callback;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3264[0x4];                                     // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.RunCallbacks
// 0x0004 (0x0004 - 0x0000)
struct PatcherSDKSubsystem_RunCallbacks final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.SetCDN
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_SetCDN final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3265[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.SetCheckDirs
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_SetCheckDirs final
{
public:
	class FString                                 Dirs;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3266[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.SetInitialResDirMapping
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_SetInitialResDirMapping final
{
public:
	class FString                                 InitialDir;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ResDir;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomVersion;                                     // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3267[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.SetMaxSpeed
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_SetMaxSpeed final
{
public:
	int64                                         KBPerSecond;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3268[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.SetNotifyContent
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_SetNotifyContent final
{
public:
	class FString                                 JsonContent;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.SetVersion
// 0x0028 (0x0028 - 0x0000)
struct PatcherSDKSubsystem_SetVersion final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Resverse;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3269[0x4];                                     // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.SetWriteLimit
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_SetWriteLimit final
{
public:
	int64                                         bytesPerSecond;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326A[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.SetWriteLimitByTime
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_SetWriteLimitByTime final
{
public:
	int64                                         WriteTime;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         WaitTime;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326B[0x4];                                     // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.StateEndDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PatcherSDKSubsystem_StateEndDelegate__DelegateSignature final
{
public:
	EPatcherState                                 PatcherState;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.StateStartDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PatcherSDKSubsystem_StateStartDelegate__DelegateSignature final
{
public:
	EPatcherState                                 PatcherState;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagCancelUpdate
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_TagCancelUpdate final
{
public:
	int64                                         Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326C[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.TagCheckResource
// 0x0038 (0x0038 - 0x0000)
struct PatcherSDKSubsystem_TagCheckResource final
{
public:
	class FString                                 Tags;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPatcherTagCheckResourceCallback       Callback;                                          // 0x0010(0x0020)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326D[0x4];                                     // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.TagConfirmUpdate
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_TagConfirmUpdate final
{
public:
	int64                                         Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoNext;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagCreateUpdateTask
// 0x0078 (0x0078 - 0x0000)
struct PatcherSDKSubsystem_TagCreateUpdateTask final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPatcherTagResourceUpdateCallback      Callback;                                          // 0x0010(0x0050)(Parm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bAutoStart;                                        // 0x0060(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_326F[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxThreads;                                        // 0x0064(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         MaxBytesPerSecond;                                 // 0x0068(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagDestroyUpdateTask
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_TagDestroyUpdateTask final
{
public:
	int64                                         Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3270[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function PatcherSDK.PatcherSDKSubsystem.TagGetTagList
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_TagGetTagList final
{
public:
	TDelegate<void(int32 Code, const class FString& Desc, TArray<struct FPatcherResourceInfo>& ResourceInfoArray)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagGetTagName
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_TagGetTagName final
{
public:
	int64                                         Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagGetTaskByTagName
// 0x0018 (0x0018 - 0x0000)
struct PatcherSDKSubsystem_TagGetTaskByTagName final
{
public:
	class FString                                 Tag;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagGetTaskList
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_TagGetTaskList final
{
public:
	TDelegate<void(int32 Code, const class FString& Desc, TArray<struct FPatcherResourceInfo>& ResourceInfoArray)> Callback;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function PatcherSDK.PatcherSDKSubsystem.TagStartUpdate
// 0x0010 (0x0010 - 0x0000)
struct PatcherSDKSubsystem_TagStartUpdate final
{
public:
	int64                                         Task;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3271[0x4];                                     // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.UpdateFinishDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct PatcherSDKSubsystem_UpdateFinishDelegate__DelegateSignature final
{
public:
	EPatcherErr                                   PatcherErr;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction PatcherSDK.PatcherSDKSubsystem.VersionCheckDelegate__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct PatcherSDKSubsystem_VersionCheckDelegate__DelegateSignature final
{
public:
	EPatcherVerCheck                              PatcherVerCheck;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3272[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVersionInfo                           VersionInfo;                                       // 0x0008(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};

}

