#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGProvider

#include "Basic.hpp"

#include "ProceduralGeneration_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCGProvider_structs.hpp"


namespace SDK
{

// Class PCGProvider.PCGProviderObject
// 0x0018 (0x0040 - 0x0028)
class UPCGProviderObject : public UObject
{
public:
	uint8                                         Pad_4C78[0x18];                                    // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGProviderObject">();
	}
	static class UPCGProviderObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGProviderObject>();
	}
};

// Class PCGProvider.PCGModuleConfigsObject
// 0x0018 (0x0058 - 0x0040)
class UPCGModuleConfigsObject final : public UPCGProviderObject
{
public:
	TArray<struct FPBGModuleConfig>               ModuleConfigs;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPBGModuleISMSetting                   ISMSetting;                                        // 0x0050(0x0001)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C79[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGModuleConfigsObject">();
	}
	static class UPCGModuleConfigsObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGModuleConfigsObject>();
	}
};

// Class PCGProvider.PCGModuleGroupObject
// 0x0020 (0x0060 - 0x0040)
class UPCGModuleGroupObject final : public UPCGProviderObject
{
public:
	bool                                          bIsCornerModule;                                   // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsLoop;                                           // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPBGModuleMethod                              LoopMethod;                                        // 0x0042(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C7A[0x1];                                     // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopWeight;                                        // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAutoScale;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C7B[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBGModuleConfigs>              Modules;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGModuleGroupObject">();
	}
	static class UPCGModuleGroupObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGModuleGroupObject>();
	}
};

// Class PCGProvider.PCGWallModuleObject
// 0x0020 (0x0060 - 0x0040)
class UPCGWallModuleObject final : public UPCGProviderObject
{
public:
	TArray<class UPCGModuleGroupObject*>          ModuleGroups;                                      // 0x0040(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FPCGModuleGroupConfig>          ModuleGroupConfig;                                 // 0x0050(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGWallModuleObject">();
	}
	static class UPCGWallModuleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGWallModuleObject>();
	}
};

// Class PCGProvider.PCGFloorModuleObject
// 0x0040 (0x0080 - 0x0040)
class UPCGFloorModuleObject final : public UPCGProviderObject
{
public:
	int32                                         FloorNum;                                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C7C[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPCGWallModuleObject*>           WallModules;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UPCGModuleGroupObject*>          CornerModuleGroups;                                // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPBGMaterialModule>             OverrideMaterials;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          IsRoof;                                            // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C7D[0x7];                                     // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGFloorModuleObject">();
	}
	static class UPCGFloorModuleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGFloorModuleObject>();
	}
};

// Class PCGProvider.PCGBuildModuleObject
// 0x0020 (0x0060 - 0x0040)
class UPCGBuildModuleObject final : public UPCGProviderObject
{
public:
	TArray<class UPCGFloorModuleObject*>          PBGFloorModuleObjects;                             // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPBGFloorModule>                PBGFloorModules;                                   // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBuildModuleObject">();
	}
	static class UPCGBuildModuleObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBuildModuleObject>();
	}
};

}

