#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Physics_AnimLayer_Female

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Physics_AnimLayer_Female_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Physics_AnimLayer_Female.Physics_AnimLayer_Female_C
// 0xB580 (0xB910 - 0x0390)
class UPhysics_AnimLayer_Female_C final : public UHTPlayerPhysicsAnimLayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Physics_AnimLayer_Female::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0398(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_58D3[0x6];                                     // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03A8(0x0008)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x03B0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0C00(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0C20(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x0C40(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x1490(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x1CE0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x2530(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x2D80(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x35D0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x3E20(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x4670(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x4EC0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x5710(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x5F60(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x67B0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x7000(0x0850)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x7850(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x78D0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x78F8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x7978(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x79C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x79E8(0x0028)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x7A10(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x8260(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x8AB0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x9300(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x9B50(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0xA3A0(0x0850)(ContainsInstancedReference)
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0xABF0(0x0850)(ContainsInstancedReference)
	struct FHTSkirtControlAnimNode                HTAnimGraphNode_SkirtControl;                      // 0xB440(0x0200)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xB640(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xB660(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xB680(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0xB738(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0xB758(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0xB820(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xB868(0x0020)()
	struct FKawaiiPhysicsSettings                 Physics_Settings;                                  // 0xB888(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Dummy_Bone_Length;                                 // 0xB8A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Alpha;                                             // 0xB8A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 Physics_Settings_0;                                // 0xB8A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Dummy_Bone_Length_0;                               // 0xB8C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58D4[0x4];                                     // 0xB8C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Return_Value_Rotation;                             // 0xB8C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_1;                                // 0xB8E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_2;                                // 0xB8F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Physics_AnimLayer_Female(int32 EntryPoint);
	void PhysicsAnimInterface(const struct FPoseLink& InPose, struct FPoseLink* Param_PhysicsAnimInterface);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Physics_AnimLayer_Female_C">();
	}
	static class UPhysics_AnimLayer_Female_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPhysics_AnimLayer_Female_C>();
	}
};

}

