#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimplygonUObjects

#include "Basic.hpp"

#include "SimplygonUObjects_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SimplygonUObjects.SimplygonStandinPipeline
// 0x0060 (0x0088 - 0x0028)
class USimplygonStandinPipeline : public UObject
{
public:
	struct FChartAggregatorSettings               ChartAggregatorSettings;                           // 0x0028(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMaterialOutputSettings                MaterialOutputSettings;                            // 0x0060(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonStandinPipeline">();
	}
	static class USimplygonStandinPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonStandinPipeline>();
	}
};

// Class SimplygonUObjects.StandinNearPipeline
// 0x01D8 (0x0260 - 0x0088)
class UStandinNearPipeline final : public USimplygonStandinPipeline
{
public:
	struct FAggregationPipelineSettings           Settings;                                          // 0x0088(0x01D8)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StandinNearPipeline">();
	}
	static class UStandinNearPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandinNearPipeline>();
	}
};

// Class SimplygonUObjects.StandinFarPipeline
// 0x0208 (0x0290 - 0x0088)
class UStandinFarPipeline final : public USimplygonStandinPipeline
{
public:
	struct FRemeshingPipelineSettings             Settings;                                          // 0x0088(0x0208)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StandinFarPipeline">();
	}
	static class UStandinFarPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStandinFarPipeline>();
	}
};

// Class SimplygonUObjects.BillboardCloudPipeline
// 0x0130 (0x01B8 - 0x0088)
class UBillboardCloudPipeline final : public USimplygonStandinPipeline
{
public:
	struct FBillboardCloudPipelineSettings        Settings;                                          // 0x0088(0x0130)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BillboardCloudPipeline">();
	}
	static class UBillboardCloudPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBillboardCloudPipeline>();
	}
};

// Class SimplygonUObjects.SimplygonPipeline
// 0x0008 (0x0030 - 0x0028)
class USimplygonPipeline : public UObject
{
public:
	int32                                         BaseLODIndex;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DC8[0x4];                                     // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonPipeline">();
	}
	static class USimplygonPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonPipeline>();
	}
};

// Class SimplygonUObjects.FlipbookPipeline
// 0x0120 (0x0150 - 0x0030)
class UFlipbookPipeline final : public USimplygonPipeline
{
public:
	struct FFlipbookPipelineSettings              Settings;                                          // 0x0030(0x0120)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlipbookPipeline">();
	}
	static class UFlipbookPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlipbookPipeline>();
	}
};

// Class SimplygonUObjects.BillboardCloudVegetationPipeline
// 0x0130 (0x0160 - 0x0030)
class UBillboardCloudVegetationPipeline final : public USimplygonPipeline
{
public:
	struct FBillboardCloudVegetationPipelineSettings Settings;                                          // 0x0030(0x0130)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BillboardCloudVegetationPipeline">();
	}
	static class UBillboardCloudVegetationPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBillboardCloudVegetationPipeline>();
	}
};

// Class SimplygonUObjects.RemeshingPipeline
// 0x0208 (0x0238 - 0x0030)
class URemeshingPipeline final : public USimplygonPipeline
{
public:
	struct FRemeshingPipelineSettings             Settings;                                          // 0x0030(0x0208)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemeshingPipeline">();
	}
	static class URemeshingPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemeshingPipeline>();
	}
};

// Class SimplygonUObjects.HighDensityMeshReductionPipeline
// 0x0030 (0x0060 - 0x0030)
class UHighDensityMeshReductionPipeline final : public USimplygonPipeline
{
public:
	struct FHighDensityMeshReductionPipelineSettings Settings;                                          // 0x0030(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HighDensityMeshReductionPipeline">();
	}
	static class UHighDensityMeshReductionPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHighDensityMeshReductionPipeline>();
	}
};

// Class SimplygonUObjects.SimplygonMaterialCaster
// 0x0000 (0x0028 - 0x0028)
class USimplygonMaterialCaster : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonMaterialCaster">();
	}
	static class USimplygonMaterialCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonMaterialCaster>();
	}
};

// Class SimplygonUObjects.SimplygonColorCaster
// 0x0030 (0x0058 - 0x0028)
class USimplygonColorCaster : public USimplygonMaterialCaster
{
public:
	struct FColorCasterSettings                   ColorCasterSettings;                               // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonColorCaster">();
	}
	static class USimplygonColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonColorCaster>();
	}
};

// Class SimplygonUObjects.BaseColorCaster
// 0x0000 (0x0058 - 0x0058)
class UBaseColorCaster : public USimplygonColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseColorCaster">();
	}
	static class UBaseColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseColorCaster>();
	}
};

// Class SimplygonUObjects.MetallicCaster
// 0x0000 (0x0058 - 0x0058)
class UMetallicCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetallicCaster">();
	}
	static class UMetallicCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetallicCaster>();
	}
};

// Class SimplygonUObjects.SpecularCaster
// 0x0000 (0x0058 - 0x0058)
class USpecularCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpecularCaster">();
	}
	static class USpecularCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecularCaster>();
	}
};

// Class SimplygonUObjects.RoughnessCaster
// 0x0000 (0x0058 - 0x0058)
class URoughnessCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoughnessCaster">();
	}
	static class URoughnessCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoughnessCaster>();
	}
};

// Class SimplygonUObjects.SimplygonNormalCaster
// 0x0030 (0x0058 - 0x0028)
class USimplygonNormalCaster : public USimplygonMaterialCaster
{
public:
	struct FNormalCasterSettings                  NormalCasterSettings;                              // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonNormalCaster">();
	}
	static class USimplygonNormalCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonNormalCaster>();
	}
};

// Class SimplygonUObjects.NormalCaster
// 0x0000 (0x0058 - 0x0058)
class UNormalCaster final : public USimplygonNormalCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NormalCaster">();
	}
	static class UNormalCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalCaster>();
	}
};

// Class SimplygonUObjects.SimplygonOpacityCaster
// 0x0030 (0x0058 - 0x0028)
class USimplygonOpacityCaster : public USimplygonMaterialCaster
{
public:
	struct FOpacityCasterSettings                 OpacityCasterSettings;                             // 0x0028(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonOpacityCaster">();
	}
	static class USimplygonOpacityCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonOpacityCaster>();
	}
};

// Class SimplygonUObjects.OpacityCaster
// 0x0000 (0x0058 - 0x0058)
class UOpacityCaster final : public USimplygonOpacityCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpacityCaster">();
	}
	static class UOpacityCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityCaster>();
	}
};

// Class SimplygonUObjects.EmissiveCaster
// 0x0000 (0x0058 - 0x0058)
class UEmissiveCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmissiveCaster">();
	}
	static class UEmissiveCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmissiveCaster>();
	}
};

// Class SimplygonUObjects.OpacityMaskCaster
// 0x0000 (0x0058 - 0x0058)
class UOpacityMaskCaster final : public USimplygonOpacityCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpacityMaskCaster">();
	}
	static class UOpacityMaskCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMaskCaster>();
	}
};

// Class SimplygonUObjects.AmbientOcclusionMaskCaster
// 0x0000 (0x0058 - 0x0058)
class UAmbientOcclusionMaskCaster final : public UBaseColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientOcclusionMaskCaster">();
	}
	static class UAmbientOcclusionMaskCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientOcclusionMaskCaster>();
	}
};

// Class SimplygonUObjects.SimplygonVertexColorCaster
// 0x0048 (0x0070 - 0x0028)
class USimplygonVertexColorCaster : public USimplygonMaterialCaster
{
public:
	struct FVertexColorCasterSettings             VertexColorCasterSettings;                         // 0x0028(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonVertexColorCaster">();
	}
	static class USimplygonVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonVertexColorCaster>();
	}
};

// Class SimplygonUObjects.BaseColorVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UBaseColorVertexColorCaster : public USimplygonVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseColorVertexColorCaster">();
	}
	static class UBaseColorVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseColorVertexColorCaster>();
	}
};

// Class SimplygonUObjects.MetallicVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UMetallicVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MetallicVertexColorCaster">();
	}
	static class UMetallicVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetallicVertexColorCaster>();
	}
};

// Class SimplygonUObjects.SpecularVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class USpecularVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SpecularVertexColorCaster">();
	}
	static class USpecularVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpecularVertexColorCaster>();
	}
};

// Class SimplygonUObjects.RoughnessVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class URoughnessVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RoughnessVertexColorCaster">();
	}
	static class URoughnessVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<URoughnessVertexColorCaster>();
	}
};

// Class SimplygonUObjects.NormalVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UNormalVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NormalVertexColorCaster">();
	}
	static class UNormalVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalVertexColorCaster>();
	}
};

// Class SimplygonUObjects.OpacityVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UOpacityVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpacityVertexColorCaster">();
	}
	static class UOpacityVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityVertexColorCaster>();
	}
};

// Class SimplygonUObjects.EmissiveVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UEmissiveVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EmissiveVertexColorCaster">();
	}
	static class UEmissiveVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEmissiveVertexColorCaster>();
	}
};

// Class SimplygonUObjects.OpacityMaskVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UOpacityMaskVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OpacityMaskVertexColorCaster">();
	}
	static class UOpacityMaskVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOpacityMaskVertexColorCaster>();
	}
};

// Class SimplygonUObjects.AmbientOcclusionVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class UAmbientOcclusionVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientOcclusionVertexColorCaster">();
	}
	static class UAmbientOcclusionVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientOcclusionVertexColorCaster>();
	}
};

// Class SimplygonUObjects.SubSurfaceVertexColorCaster
// 0x0000 (0x0070 - 0x0070)
class USubSurfaceVertexColorCaster final : public UBaseColorVertexColorCaster
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SubSurfaceVertexColorCaster">();
	}
	static class USubSurfaceVertexColorCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubSurfaceVertexColorCaster>();
	}
};

// Class SimplygonUObjects.ReductionPipeline
// 0x0250 (0x0280 - 0x0030)
class UReductionPipeline final : public USimplygonPipeline
{
public:
	struct FReductionPipelineSettings             Settings;                                          // 0x0030(0x0250)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReductionPipeline">();
	}
	static class UReductionPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReductionPipeline>();
	}
};

// Class SimplygonUObjects.AggregationPipeline
// 0x01D8 (0x0208 - 0x0030)
class UAggregationPipeline final : public USimplygonPipeline
{
public:
	struct FAggregationPipelineSettings           Settings;                                          // 0x0030(0x01D8)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AggregationPipeline">();
	}
	static class UAggregationPipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAggregationPipeline>();
	}
};

// Class SimplygonUObjects.SimplygonDisplacementCaster
// 0x0038 (0x0060 - 0x0028)
class USimplygonDisplacementCaster final : public USimplygonMaterialCaster
{
public:
	struct FDisplacementCasterSettings            DisplacementCasterSettings;                        // 0x0028(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonDisplacementCaster">();
	}
	static class USimplygonDisplacementCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonDisplacementCaster>();
	}
};

// Class SimplygonUObjects.SimplygonAmbientOcclusionCaster
// 0x0040 (0x0068 - 0x0028)
class USimplygonAmbientOcclusionCaster final : public USimplygonMaterialCaster
{
public:
	struct FAmbientOcclusionCasterSettings        AmbientOcclusionCasterSettings;                    // 0x0028(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonAmbientOcclusionCaster">();
	}
	static class USimplygonAmbientOcclusionCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonAmbientOcclusionCaster>();
	}
};

// Class SimplygonUObjects.SimplygonGeometryDataCaster
// 0x0088 (0x00B0 - 0x0028)
class USimplygonGeometryDataCaster final : public USimplygonMaterialCaster
{
public:
	uint8                                         Pad_4DC9[0x8];                                     // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometryDataCasterSettings            GeometryDataCasterSettings;                        // 0x0030(0x0080)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonGeometryDataCaster">();
	}
	static class USimplygonGeometryDataCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonGeometryDataCaster>();
	}
};

// Class SimplygonUObjects.SimplygonComputeCaster
// 0x0038 (0x0060 - 0x0028)
class USimplygonComputeCaster final : public USimplygonMaterialCaster
{
public:
	struct FComputeCasterSettings                 ComputeCasterSettings;                             // 0x0028(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimplygonComputeCaster">();
	}
	static class USimplygonComputeCaster* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimplygonComputeCaster>();
	}
};

}

