#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplineMeshEditor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SplineMeshEditor_structs.hpp"


namespace SDK
{

// Class SplineMeshEditor.SME_Segment
// 0x00D8 (0x0100 - 0x0028)
class USME_Segment final : public UObject
{
public:
	class UStaticMeshComponent*                   NewStaticMeshComponent;                            // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineMeshComponent*                   NewSplineMeshComponent;                            // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DE9[0xC8];                                    // 0x0038(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SME_Segment">();
	}
	static class USME_Segment* GetDefaultObj()
	{
		return GetDefaultObjImpl<USME_Segment>();
	}
};

// Class SplineMeshEditor.SME_SplineLayer
// 0x0240 (0x0268 - 0x0028)
class USME_SplineLayer final : public UObject
{
public:
	class USplineComponent*                       SplineComponent;                                   // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DEA[0x1F8];                                   // 0x0030(0x01F8)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USME_Segment*>                   SplineSegments;                                    // 0x0228(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DEB[0x30];                                    // 0x0238(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SME_SplineLayer">();
	}
	static class USME_SplineLayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<USME_SplineLayer>();
	}
};

// Class SplineMeshEditor.SME_SplineMeshActor
// 0x0130 (0x03D0 - 0x02A0)
class ASME_SplineMeshActor final : public AActor
{
public:
	TArray<struct FSMEBranchData>                 Branches;                                          // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSplinePoints;                                   // 0x02B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DEC[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSMELayerData>                  SplineLayersData;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          DuplicateSegmentsPercentages;                      // 0x02D0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DED[0x17];                                    // 0x02D1(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USME_SplineLayer*>               SplineLayersRuntime;                               // 0x02E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	EComponentMobility                            Mobility;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClosedLoop;                                        // 0x02F9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESMESplinePointType                           SplinePointMode;                                   // 0x02FA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DEE[0x5];                                     // 0x02FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSMEArcSettings                        ArcSettings;                                       // 0x0300(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class AActor*                                 ExternalSplineActor;                               // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASME_SplineMeshActor*                   LinkedExternalSplineMeshActor;                     // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSMEPhysicData                         PhysicData;                                        // 0x0338(0x002C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DEF[0x4];                                     // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            DefaultAnchorMesh;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DefaultAnchorMaterial;                             // 0x0370(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ExternalEndAnchorActor;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HideDefaultAnchorInGame;                           // 0x0380(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          BreackablePhysicsConstraints;                      // 0x0381(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4DF0[0x16];                                    // 0x0382(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPhysicsConstraintComponent*>    PhysicsConstraints;                                // 0x0398(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         PreviousBranches;                                  // 0x03A8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FTransform>                     PreviousBranchesInitialTransform;                  // 0x03B8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4DF1[0x8];                                     // 0x03C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void MakeSplineArc(class USplineComponent* SplineComp, int32 NumPoints, const struct FVector2D& Radius, float RotationOffset, float Degrees, bool Closed, ESMESplinePointType PointMode);

	int32 FindBranch(class AActor* ActorToFind);
	float GetSplineUtilization();
	void OnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void SetSplineUtilization(float Value);
	void UpdateConstruction();
	void UpdateSplineAtRuntime();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SME_SplineMeshActor">();
	}
	static class ASME_SplineMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASME_SplineMeshActor>();
	}
};

}

