#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "RigVM_structs.hpp"
#include "ControlRig_structs.hpp"
#include "PBIK_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// PropertyBag Transient.PropertyBag_8b3cbc062539881
// 0x03B0 (0x03B0 - 0x0000)
struct FPropertyBag_8b3cbc062539881 final
{
public:
	struct FTransform                             OnHit___OnHit_RigUnit_GetTransform_1_Transform;    // 0x0000(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_GetTransform_1_CachedIndex;  // 0x0060(0x0010)(Edit)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_SetTransform_CachedIndex;    // 0x0070(0x0010)(Edit)
	struct FTransform                             OnHit___OnHit_RigUnit_GetTransform_5_Transform;    // 0x0080(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_GetTransform_5_CachedIndex;  // 0x00E0(0x0010)(Edit)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_SetTransform_2_CachedIndex;  // 0x00F0(0x0010)(Edit)
	struct FTransform                             OnHit___OnHit_RigUnit_GetTransform_6_Transform;    // 0x0100(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_GetTransform_6_CachedIndex;  // 0x0160(0x0010)(Edit)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_SetTransform_1_CachedIndex;  // 0x0170(0x0010)(Edit)
	struct FVector                                OnHit___OnHit_MathVectorNegate_Result;             // 0x0180(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OnHit___OnHit_MathVectorScale_Result;              // 0x0198(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OnHit___OnHit_MathVectorScale_Factor;              // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53F7[0xC];                                     // 0x01B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OnHit___OnHit_RigUnit_OffsetTransformForItem_OffsetTransform__IO; // 0x01C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_OffsetTransformForItem_CachedIndex; // 0x0220(0x0010)(Edit)
	struct FTransform                             OnHit___OnHit_RigUnit_GetTransform_Transform;      // 0x0230(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_GetTransform_CachedIndex;    // 0x0290(0x0010)(Edit)
	struct FTransform                             OnHit___OnHit_RigUnit_GetTransform_2_Transform;    // 0x02A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_GetTransform_2_CachedIndex;  // 0x0300(0x0010)(Edit)
	struct FTransform                             OnHit___OnHit_RigUnit_GetTransform_3_Transform;    // 0x0310(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              OnHit___OnHit_RigUnit_GetTransform_3_CachedIndex;  // 0x0370(0x0010)(Edit)
	TArray<struct FPBIKEffector>                  OnHit___OnHit_PBIK_Effectors__IO;                  // 0x0380(0x0010)(Edit)
	TArray<TArray<int32>>                         OnHit___OnHit_PBIK_EffectorSolverIndices;          // 0x0390(0x0010)(Edit)
	TArray<struct FPBIKWorkData>                  OnHit___OnHit_PBIK_WorkData;                       // 0x03A0(0x0010)(Edit)
};

// PropertyBag Transient.PropertyBag_335b6c50c38a42fc
// 0x0480 (0x0480 - 0x0000)
struct FPropertyBag_335b6c50c38a42fc final
{
public:
	struct FRigElementKey                         RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_3_Item__Const; // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_3_Space__Const; // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_3_bInitial__Const; // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53F8[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_2_1_Item__Const; // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53F9[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___UpdateValueNode_Greater_1_B__Const;   // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_True__Const; // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___UpdateValueNode_SetCurveValue_Curve__Const; // 0x002C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___UpdateValueNode_SetCurveValue_Value__Const; // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Less_B__Const; // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3_1___Interp_LessEqual_B__Const;            // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3_1___Interp_Clamp_1_Maximum__Const;        // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdatePelvisNode_Remap_1_bClamp__Const; // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FA[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3___Interp_LessEqual_B__Const;              // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3___Interp_Clamp_1_Maximum__Const;          // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___UpdatePelvisNode_RigUnit_SetTranslation_Item__Const; // 0x0068(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FB[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___UpdatePelvisNode_Add_2_B__Const;      // 0x0078(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_MathVectorAdd_A__Const; // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          TraceFeedOffset_2___TraceFeedOffset_GetTransform_Space__Const; // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceFeedOffset_2___TraceFeedOffset_GetTransform_bInitial__Const; // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FC[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         TraceFeedOffset_2___TraceFeedOffset_RigUnit_GetTransform_Item__Const; // 0x00AC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_MathVectorAdd_B__Const; // 0x00B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceFeedOffset_2___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_bEnabled__Const; // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  TraceFeedOffset_2___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Mode__Const; // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FD[0x2];                                     // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceFeedOffset_2___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Color__Const; // 0x00D4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceFeedOffset_2___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Thickness__Const; // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceFeedOffset_2___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Scale__Const; // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  TraceFeedOffset_2___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_1_Mode__Const; // 0x00EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               TraceFeedOffset_2___TraceFeedOffset_SphereTraceByTraceChannel_TraceChannel__Const; // 0x00ED(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FE[0x2];                                     // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceFeedOffset_2___TraceFeedOffset_AlphaInterp_Bias__Const; // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            TraceFeedOffset_2___TraceFeedOffset_AlphaInterp_InRange__Const; // 0x00F4(0x0008)(Edit, NoDestructor)
	float                                         TraceFeedOffset_2___TraceFeedOffset_AlphaInterp_InterpSpeedIncreasing__Const; // 0x00FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_InputTransform__Const; // 0x0100(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_Primary__Const; // 0x0160(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimItem_Target                TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_Secondary__Const; // 0x01A8(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_DebugSettings__Const; // 0x01F0(0x0070)(Edit, NoDestructor)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_MathVectorAdd_A__Const; // 0x0260(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          TraceFeedOffset_1_1___TraceFeedOffset_GetTransform_Space__Const; // 0x0278(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceFeedOffset_1_1___TraceFeedOffset_GetTransform_bInitial__Const; // 0x0279(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53FF[0x2];                                     // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_GetTransform_Item__Const; // 0x027C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_MathVectorAdd_B__Const; // 0x0288(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_bEnabled__Const; // 0x02A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Mode__Const; // 0x02A1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5400[0x2];                                     // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Color__Const; // 0x02A4(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Thickness__Const; // 0x02B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_Scale__Const; // 0x02B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigUnitVisualDebugPointMode                  TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_VisualDebugVectorItemSpace_1_1_Mode__Const; // 0x02BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETraceTypeQuery                               TraceFeedOffset_1_1___TraceFeedOffset_SphereTraceByTraceChannel_TraceChannel__Const; // 0x02BD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5401[0x2];                                     // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceFeedOffset_1_1___TraceFeedOffset_AlphaInterp_Bias__Const; // 0x02C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputRange                            TraceFeedOffset_1_1___TraceFeedOffset_AlphaInterp_InRange__Const; // 0x02C4(0x0008)(Edit, NoDestructor)
	float                                         TraceFeedOffset_1_1___TraceFeedOffset_AlphaInterp_InterpSpeedIncreasing__Const; // 0x02CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_InputTransform__Const; // 0x02D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_Primary__Const; // 0x0330(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimItem_Target                TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_Secondary__Const; // 0x0378(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_DebugSettings__Const; // 0x03C0(0x0070)(Edit, NoDestructor)
	bool                                          InterpConstant___InterpConstant_RigVMFunction_MathBoolOr_A__Const; // 0x0430(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5402[0x7];                                     // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpConstant___InterpConstant_IsNearlyEqual_B__Const; // 0x0438(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___UpdateFootIKLNode_SetCurveValue_1_Curve__Const; // 0x0440(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpConstant_1___InterpConstant_RigVMFunction_MathBoolOr_A__Const; // 0x0448(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5403[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpConstant_1___InterpConstant_IsNearlyEqual_B__Const; // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpConstant_1_1___InterpConstant_RigVMFunction_MathBoolOr_A__Const; // 0x0458(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5404[0x7];                                     // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpConstant_1_1___InterpConstant_IsNearlyEqual_B__Const; // 0x0460(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___UpdateFootRKLNode_SetCurveValue_2_Curve__Const; // 0x0468(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpConstant_1_1_1___InterpConstant_RigVMFunction_MathBoolOr_A__Const; // 0x0470(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5405[0x7];                                     // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpConstant_1_1_1___InterpConstant_IsNearlyEqual_B__Const; // 0x0478(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// PropertyBag Transient.PropertyBag_df2f3df540164a49
// 0x0140 (0x0140 - 0x0000)
struct FPropertyBag_df2f3df540164a49 final
{
public:
	struct FRigElementKey                         OnHit___OnHit_RigUnit_SetTransform_Item__Const;    // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          OnHit___OnHit_RigUnit_SetTransform_Space__Const;   // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnHit___OnHit_RigUnit_SetTransform_bInitial__Const; // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5406[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         OnHit___OnHit_RigUnit_GetTransform_1_Item__Const;  // 0x0010(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         OnHit___OnHit_RigUnit_SetTransform_Weight__Const;  // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnHit___OnHit_RigUnit_SetTransform_bPropagateToChildren__Const; // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5407[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         OnHit___OnHit_RigUnit_SetTransform_2_Item__Const;  // 0x0024(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         OnHit___OnHit_RigUnit_GetTransform_5_Item__Const;  // 0x0030(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         OnHit___OnHit_RigUnit_SetTransform_1_Item__Const;  // 0x003C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         OnHit___OnHit_RigUnit_GetTransform_6_Item__Const;  // 0x0048(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5408[0xC];                                     // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OnHit___OnHit_RigUnit_OffsetTransformForItem_OffsetTransform__Const; // 0x0060(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OnHit___OnHit_PBIK_Root__Const;                    // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FPBIKEffector>                  OnHit___OnHit_PBIK_Effectors__Const;               // 0x00C8(0x0010)(Edit)
	TArray<struct FPBIKBoneSetting>               OnHit___OnHit_PBIK_BoneSettings__Const;            // 0x00D8(0x0010)(Edit)
	TArray<class FName>                           OnHit___OnHit_PBIK_ExcludedBones__Const;           // 0x00E8(0x0010)(Edit)
	struct FPBIKSolverSettings                    OnHit___OnHit_PBIK_Settings__Const;                // 0x00F8(0x0040)(Edit, NoDestructor)
	struct FPBIKDebug                             OnHit___OnHit_PBIK_Debug__Const;                   // 0x0138(0x0008)(Edit, NoDestructor)
};

// PropertyBag Transient.PropertyBag_ba3203ddb48f1629
// 0x11B0 (0x11B0 - 0x0000)
struct FPropertyBag_ba3203ddb48f1629 final
{
public:
	struct FVector                                RigVMModel___UpdateFootSpeedNode_Subtract_Result;  // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5409[0x8];                                     // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_3_Transform; // 0x0020(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_3_CachedIndex; // 0x0080(0x0010)(Edit)
	struct FVector                                RigVMModel___UpdateFootSpeedNode_Subtract_A;       // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___UpdateFootSpeedNode_Subtract_1_Result; // 0x00A8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_2_1_Transform; // 0x00C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateFootSpeedNode_RigUnit_GetTransform_2_1_CachedIndex; // 0x0120(0x0010)(Edit)
	struct FVector                                RigVMModel___UpdateFootSpeedNode_Subtract_1_A;     // 0x0130(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_Greater_1_Result;     // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_540A[0x3];                                     // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_Result; // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_Less_Result; // 0x0150(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_540B[0xF];                                     // 0x0151(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_RigUnit_GetTransform_3_Transform; // 0x0160(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_RigUnit_GetTransform_3_CachedIndex; // 0x01C0(0x0010)(Edit)
	double                                        RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_Less_A; // 0x01D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_Condition; // 0x01D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_540C[0x3];                                     // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_False; // 0x01DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_1_Result; // 0x01E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_Less_1_Result; // 0x01E4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_540D[0xB];                                     // 0x01E5(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_RigUnit_GetTransform_2_1_Transform; // 0x01F0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_RigUnit_GetTransform_2_1_CachedIndex; // 0x0250(0x0010)(Edit)
	double                                        RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_Less_1_A; // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_1_Condition; // 0x0268(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_540E[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___UpdateValueNode_UpdateUpTraceOffsetNode_DISPATCH_RigVMDispatch_If_1_False; // 0x026C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateValueNode_SetCurveValue_CachedCurveIndex; // 0x0270(0x0010)(Edit)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigVMFunction_MathBoolAnd_Result; // 0x0280(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_540F[0x7];                                     // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_4077410741;                      // 0x0288(0x0050)(Edit)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Greater_Result; // 0x02D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5410[0x7];                                     // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigUnit_GetTransform_3_Transform; // 0x02E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigUnit_GetTransform_3_CachedIndex; // 0x0340(0x0010)(Edit)
	double                                        RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Greater_A; // 0x0350(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Less_Result; // 0x0358(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5411[0x7];                                     // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Less_A; // 0x0360(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_DISPATCH_RigVMDispatch_If_2_Result; // 0x0368(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigVMFunction_MathBoolNot_Result; // 0x036C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_DISPATCH_RigVMDispatch_If_2_Condition; // 0x036D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5412[0x2];                                     // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_DISPATCH_RigVMDispatch_If_2_True; // 0x0370(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigVMFunction_MathBoolAnd_1_Result; // 0x0374(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5413[0x3];                                     // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigVMInstructionSetExecuteState       BlockExecuteState_1055877575;                      // 0x0378(0x0050)(Edit)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Greater_1_Result; // 0x03C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5414[0x7];                                     // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigUnit_GetTransform_2_1_Transform; // 0x03D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigUnit_GetTransform_2_1_CachedIndex; // 0x0430(0x0010)(Edit)
	double                                        RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Greater_1_A; // 0x0440(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Less_1_Result; // 0x0448(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5415[0x7];                                     // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_Less_1_A; // 0x0450(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_DISPATCH_RigVMDispatch_If_2_1_Result; // 0x0458(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigVMFunction_MathBoolNot_1_Result; // 0x045C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_DISPATCH_RigVMDispatch_If_2_1_Condition; // 0x045D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5416[0x2];                                     // 0x045E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_DISPATCH_RigVMDispatch_If_2_1_True; // 0x0460(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5417[0x4];                                     // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              RigVMModel___UpdateValueNode_SetCurveValue_3_CachedCurveIndex; // 0x0468(0x0010)(Edit)
	class FName                                   RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigVMFunction_ControlFlowBranch_BlockToRun; // 0x0478(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___UpdateValueNode_UpdateDownTraceOffsetNode_RigVMFunction_ControlFlowBranch_1_BlockToRun; // 0x0480(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateValueNode_Multiply_Result;      // 0x0488(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateValueNode_Clamp_Result;         // 0x0490(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateValueNode_Absolute_Result;      // 0x0498(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateValueNode_Subtract_Result;      // 0x04A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateValueNode_Multiply_1_Result;    // 0x04A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___UpdatePelvisNode_Greater_1_1_Result;  // 0x04B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5418[0x7];                                     // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___UpdatePelvisNode_Interp_3_1_ReturnValue; // 0x04B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_3_1___Interp_DISPATCH_RigVMDispatch_If_Result; // 0x04C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3_1___Interp_RigVMFunction_MathBoolOr_Result; // 0x04C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3_1___Interp_LessEqual_Result;              // 0x04C5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3_1___Interp_IsNearlyEqual_Result;          // 0x04C6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5419[0x1];                                     // 0x04C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3_1___Interp_Absolute_Result;               // 0x04C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       Interp_3_1te_152515139;                            // 0x04D0(0x0050)(Edit)
	double                                        Interp_3_1___Interp_Subtract_Result;               // 0x0520(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3_1___Interp_DISPATCH_RigVMDispatch_If_Condition; // 0x0528(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541A[0x3];                                     // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Interp_3_1___Interp_DISPATCH_RigVMDispatch_If_True; // 0x052C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3_1___Interp_Add_Result;                    // 0x0530(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3_1___Interp_Multiply_1_Result;             // 0x0538(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3_1___Interp_Clamp_1_Result;                // 0x0540(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3_1___Interp_Multiply_Result;               // 0x0548(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_3_1___Interp_RigVMFunction_GetDeltaTime_1_Result; // 0x0550(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541B[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3_1___Interp_Multiply_B;                    // 0x0558(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_3_1___Interp_DISPATCH_RigVMDispatch_If_False; // 0x0560(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541C[0x4];                                     // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3_1___Interp_Clamp_Value;                   // 0x0568(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdatePelvisNode_Interp_3_ReturnValue; // 0x0570(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdatePelvisNode_Remap_1_Result;      // 0x0578(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdatePelvisNode_Subtract_2_Result;   // 0x0580(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_3___Interp_DISPATCH_RigVMDispatch_If_Result; // 0x0588(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3___Interp_RigVMFunction_MathBoolOr_Result; // 0x058C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3___Interp_LessEqual_Result;                // 0x058D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3___Interp_IsNearlyEqual_Result;            // 0x058E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541D[0x1];                                     // 0x058F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3___Interp_Absolute_Result;                 // 0x0590(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       Interp_3te_152515139;                              // 0x0598(0x0050)(Edit)
	double                                        Interp_3___Interp_Subtract_Result;                 // 0x05E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interp_3___Interp_DISPATCH_RigVMDispatch_If_Condition; // 0x05F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541E[0x3];                                     // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Interp_3___Interp_DISPATCH_RigVMDispatch_If_True;  // 0x05F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3___Interp_Add_Result;                      // 0x05F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3___Interp_Multiply_1_Result;               // 0x0600(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3___Interp_Clamp_1_Result;                  // 0x0608(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Interp_3___Interp_Multiply_Result;                 // 0x0610(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_3___Interp_RigVMFunction_GetDeltaTime_1_Result; // 0x0618(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541F[0x4];                                     // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3___Interp_Multiply_B;                      // 0x0620(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interp_3___Interp_DISPATCH_RigVMDispatch_If_False; // 0x0628(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5420[0x4];                                     // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Interp_3___Interp_Clamp_Value;                     // 0x0630(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___UpdatePelvisNode_Add_2_Result;        // 0x0638(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___UpdatePelvisNode_RigUnit_GetTransform_1_Transform; // 0x0650(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdatePelvisNode_RigUnit_GetTransform_1_CachedIndex; // 0x06B0(0x0010)(Edit)
	struct FVector                                RigVMModel___UpdatePelvisNode_Add_2_A;             // 0x06C0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___UpdatePelvisNode_Add_2_B__IO;         // 0x06D8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdatePelvisNode_RigUnit_SetTranslation_CachedIndex; // 0x06F0(0x0010)(Edit)
	class FName                                   RigVMModel___UpdatePelvisNode_Branch_1_1_1_BlockToRun; // 0x0700(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___UpdateValueNode_Branch_1_1_BlockToRun; // 0x0708(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___UpdateTraceNode_TraceFeedOffset_2_ZOffset; // 0x0710(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5421[0xC];                                     // 0x0714(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___UpdateTraceNode_TraceFeedOffset_2_HitNormalRotation; // 0x0720(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_SphereTraceByTraceChannel_HitLocation; // 0x0740(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_MathVectorAdd_Result; // 0x0758(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TraceFeedOffset_2___TraceFeedOffset_GetTransform_Transform; // 0x0770(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              TraceFeedOffset_2___TraceFeedOffset_GetTransform_CachedIndex; // 0x07D0(0x0010)(Edit)
	struct FTransform                             TraceFeedOffset_2___TraceFeedOffset_RigUnit_GetTransform_Transform; // 0x07E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              TraceFeedOffset_2___TraceFeedOffset_RigUnit_GetTransform_CachedIndex; // 0x0840(0x0010)(Edit)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_MathVectorAdd_A__IO; // 0x0850(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_MathVectorSub_Result; // 0x0868(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_MathVectorSub_A__IO; // 0x0880(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceFeedOffset_2___TraceFeedOffset_SphereTraceByTraceChannel_bHit; // 0x0898(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5422[0x7];                                     // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceFeedOffset_2___TraceFeedOffset_SphereTraceByTraceChannel_HitNormal; // 0x08A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  TraceFeedOffset_2___TraceFeedOffset_SphereTraceByTraceChannel_WorkData; // 0x08B8(0x0010)(Edit)
	float                                         TraceFeedOffset_2___TraceFeedOffset_AlphaInterp_Value; // 0x08C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5423[0x4];                                     // 0x08CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputScaleBiasClamp>           TraceFeedOffset_2___TraceFeedOffset_AlphaInterp_ScaleBiasClamp; // 0x08D0(0x0010)(Edit)
	struct FTransform                             TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_Result; // 0x08E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_Primary__IO; // 0x0940(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_PrimaryCachedSpace; // 0x0988(0x0010)(Edit)
	TArray<struct FCachedRigElement>              TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_SecondaryCachedSpace; // 0x0998(0x0010)(Edit)
	TArray<bool>                                  TraceFeedOffset_2___TraceFeedOffset_AimBoneMath_1_bIsInitialized; // 0x09A8(0x0010)(Edit)
	float                                         RigVMModel___UpdateTraceNode_TraceFeedOffset_1_1_ZOffset; // 0x09B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5424[0x4];                                     // 0x09BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___UpdateTraceNode_TraceFeedOffset_1_1_HitNormalRotation; // 0x09C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_SphereTraceByTraceChannel_HitLocation; // 0x09E0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_MathVectorAdd_Result; // 0x09F8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TraceFeedOffset_1_1___TraceFeedOffset_GetTransform_Transform; // 0x0A10(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              TraceFeedOffset_1_1___TraceFeedOffset_GetTransform_CachedIndex; // 0x0A70(0x0010)(Edit)
	struct FTransform                             TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_GetTransform_Transform; // 0x0A80(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              TraceFeedOffset_1_1___TraceFeedOffset_RigUnit_GetTransform_CachedIndex; // 0x0AE0(0x0010)(Edit)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_MathVectorAdd_A__IO; // 0x0AF0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_MathVectorSub_Result; // 0x0B08(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_MathVectorSub_A__IO; // 0x0B20(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TraceFeedOffset_1_1___TraceFeedOffset_SphereTraceByTraceChannel_bHit; // 0x0B38(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5425[0x7];                                     // 0x0B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TraceFeedOffset_1_1___TraceFeedOffset_SphereTraceByTraceChannel_HitNormal; // 0x0B40(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_SphereTrace_WorkData>  TraceFeedOffset_1_1___TraceFeedOffset_SphereTraceByTraceChannel_WorkData; // 0x0B58(0x0010)(Edit)
	float                                         TraceFeedOffset_1_1___TraceFeedOffset_AlphaInterp_Value; // 0x0B68(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5426[0x4];                                     // 0x0B6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputScaleBiasClamp>           TraceFeedOffset_1_1___TraceFeedOffset_AlphaInterp_ScaleBiasClamp; // 0x0B70(0x0010)(Edit)
	struct FTransform                             TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_Result; // 0x0B80(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_Primary__IO; // 0x0BE0(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_PrimaryCachedSpace; // 0x0C28(0x0010)(Edit)
	TArray<struct FCachedRigElement>              TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_SecondaryCachedSpace; // 0x0C38(0x0010)(Edit)
	TArray<bool>                                  TraceFeedOffset_1_1___TraceFeedOffset_AimBoneMath_1_bIsInitialized; // 0x0C48(0x0010)(Edit)
	bool                                          RigVMModel___UpdateFootIKLNode_Greater_2_Result;   // 0x0C58(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5427[0x7];                                     // 0x0C59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___UpdateFootIKLNode_Subtract_Result;    // 0x0C60(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5428[0x8];                                     // 0x0C68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___UpdateFootIKLNode_RigUnit_GetTransform_Transform; // 0x0C70(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___UpdateFootIKLNode_RigUnit_GetTransform_CachedIndex; // 0x0CD0(0x0010)(Edit)
	double                                        RigVMModel___UpdateFootIKLNode_Subtract_A;         // 0x0CE0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateFootIKLNode_InterpConstant_ReturnValue; // 0x0CE8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___UpdateFootIKLNode_InterpConstant_CurValue; // 0x0CF0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InterpConstant___InterpConstant_DISPATCH_RigVMDispatch_If_Result; // 0x0CF8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpConstant___InterpConstant_RigVMFunction_MathBoolOr_Result; // 0x0CFC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpConstant___InterpConstant_IsNearlyEqual_Result; // 0x0CFD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5429[0x2];                                     // 0x0CFE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InterpConstant___InterpConstant_Absolute_Result;   // 0x0D00(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigVMInstructionSetExecuteState       InterpConstantte_4023340656;                       // 0x0D08(0x0050)(Edit)
	double                                        InterpConstant___InterpConstant_Subtract_Result;   // 0x0D58(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InterpConstant___InterpConstant_DISPATCH_RigVMDispatch_If_Condition; // 0x0D60(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
