#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Cloud_Paint_Container_FogMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDS_Cloud_Paint_Container_FogMap.UDS_Cloud_Paint_Container_FogMap_C
// 0x00E0 (0x0380 - 0x02A0)
class AUDS_Cloud_Paint_Container_FogMap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UUDS_Cloud_Paint_Cell_C*> Cloud_Painting_Cell_Data;                          // 0x02B8(0x0050)(Edit, BlueprintVisible)
	int32                                         Cloud_Painting_Cell_Size;                          // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cloud_Painting_Cell_Resolution;                    // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UTextureRenderTarget2D*> Cell_Render_Targets;                               // 0x0310(0x0050)(Edit, BlueprintVisible)
	class UTextureRenderTarget2D*                 FogMapRenderTargetTarget;                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         FogMap_Painting_Cell_Resolution;                   // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_546B[0x4];                                     // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 EditorPaintFogMapRenderTargetTarget;               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 BlendFogMapRenderTargetTarget;                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UDS_Cloud_Paint_Container_FogMap(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UDS_Cloud_Paint_Container_FogMap_C">();
	}
	static class AUDS_Cloud_Paint_Container_FogMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUDS_Cloud_Paint_Container_FogMap_C>();
	}
};

}

