#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIExtension

#include "Basic.hpp"

#include "UIExtension_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function UIExtension.UIExtensionSubsystem.K2_RegisterExtensionAsData
// 0x0030 (0x0030 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsData final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Data;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A77[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionSubsystem.K2_RegisterExtensionAsDataForContext
// 0x0038 (0x0038 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsDataForContext final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Data;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A78[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionSubsystem.K2_RegisterExtensionAsWidget
// 0x0030 (0x0030 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsWidget final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A79[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionSubsystem.K2_RegisterExtensionAsWidgetForContext
// 0x0038 (0x0038 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionAsWidgetForContext final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ContextObject;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A7A[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIExtensionHandle                     ReturnValue;                                       // 0x0020(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionSubsystem.K2_RegisterExtensionPoint
// 0x0048 (0x0048 - 0x0000)
struct UIExtensionSubsystem_K2_RegisterExtensionPoint final
{
public:
	struct FGameplayTag                           ExtensionPointTag;                                 // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUIExtensionPointMatch                        ExtensionPointTagMatchType;                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A7B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         AllowedDataClasses;                                // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(EUIExtensionAction Action, struct FUIExtensionRequest& ExtensionRequest)> ExtensionCallback;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUIExtensionPointHandle                ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionSubsystem.UnregisterExtension
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionSubsystem_UnregisterExtension final
{
public:
	struct FUIExtensionHandle                     ExtensionHandle;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionSubsystem.UnregisterExtensionPoint
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionSubsystem_UnregisterExtensionPoint final
{
public:
	struct FUIExtensionPointHandle                ExtensionPointHandle;                              // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionHandleFunctions.IsValid
// 0x0020 (0x0020 - 0x0000)
struct UIExtensionHandleFunctions_IsValid final
{
public:
	struct FUIExtensionHandle                     Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A7C[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UIExtension.UIExtensionHandleFunctions.Unregister
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionHandleFunctions_Unregister final
{
public:
	struct FUIExtensionHandle                     Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// Function UIExtension.UIExtensionPointHandleFunctions.IsValid
// 0x0020 (0x0020 - 0x0000)
struct UIExtensionPointHandleFunctions_IsValid final
{
public:
	struct FUIExtensionPointHandle                Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A7D[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};

// Function UIExtension.UIExtensionPointHandleFunctions.Unregister
// 0x0018 (0x0018 - 0x0000)
struct UIExtensionPointHandleFunctions_Unregister final
{
public:
	struct FUIExtensionPointHandle                Handle;                                            // 0x0000(0x0018)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction UIExtension.UIExtensionPointWidget.OnConfigureWidgetForData__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIExtensionPointWidget_OnConfigureWidgetForData__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                DataItem;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// DelegateFunction UIExtension.UIExtensionPointWidget.OnGetWidgetClassForData__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIExtensionPointWidget_OnGetWidgetClassForData__DelegateSignature final
{
public:
	class UObject*                                DataItem;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

}

