#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HTButton_Skill_M

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HTButton_Skill_M.W_HTButton_Skill_M_C
// 0x0240 (0x1A70 - 0x1830)
class UW_HTButton_Skill_M_C final : public UHTUI_Button
{
public:
	uint8                                         Pad_6260[0x8];                                     // 0x1828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                ButtonBorder;                                      // 0x1838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        TextLeftRightPadding;                              // 0x1840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PressProgress;                                     // 0x1848(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x1850(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateBrush                            ButtonBorderBrush;                                 // 0x18B0(0x00D0)(Edit, BlueprintVisible)
	struct FSlateBrush                            IconBrush;                                         // 0x1980(0x00D0)(Edit, BlueprintVisible)
	ETextTransformPolicy                          TextCase;                                          // 0x1A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlipIconXDimension;                                // 0x1A51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x1A52(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseImageOverlays;                                  // 0x1A53(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseScaleChangeSpacers;                             // 0x1A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseIconOverride;                                   // 0x1A55(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          InputHorzAlignment;                                // 0x1A56(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            InputVertAlignment;                                // 0x1A57(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                InputPadding;                                      // 0x1A58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	class UTexture2D* BP_GetNormalPhoto();
	void BP_OnDeselected();
	void BP_OnDisabled();
	void BP_OnEnabled();
	void BP_OnSelected();
	void BP_SetNormalImage(const struct FSlateBrush& Img);
	void BP_SetNormalImageByTexture2D(class UTexture2D* NormalImg);
	void ExecuteUbergraph_W_HTButton_Skill_M(int32 EntryPoint);
	void GetPressProgress(double* Progress);
	void PreConstruct(bool IsDesignTime);
	void ResetMaterials();
	void SetBrush(const struct FSlateBrush& InBrush, struct FSlateBrush& CurBrush);
	void UpdateButtonStyles();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_HTButton_Skill_M_C">();
	}
	static class UW_HTButton_Skill_M_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_HTButton_Skill_M_C>();
	}
};

}

