#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LevelSequencePlayer

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_ButtonBackward_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_ButtonBackward_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_ButtonBackward_K2Node_ComponentBoundEvent_17_OnUIButtonPressedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_ButtonBackward_K2Node_ComponentBoundEvent_17_OnUIButtonPressedDelegate__DelegateSignature final
{
public:
	class UHTUI_Button*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_ButtonBackward_K2Node_ComponentBoundEvent_18_OnUIButtonReleasedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_ButtonBackward_K2Node_ComponentBoundEvent_18_OnUIButtonReleasedDelegate__DelegateSignature final
{
public:
	class UHTUI_Button*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_ButtonForward_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_ButtonForward_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_ButtonForward_K2Node_ComponentBoundEvent_15_OnUIButtonPressedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_ButtonForward_K2Node_ComponentBoundEvent_15_OnUIButtonPressedDelegate__DelegateSignature final
{
public:
	class UHTUI_Button*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_ButtonForward_K2Node_ComponentBoundEvent_16_OnUIButtonReleasedDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_ButtonForward_K2Node_ComponentBoundEvent_16_OnUIButtonReleasedDelegate__DelegateSignature final
{
public:
	class UHTUI_Button*                           Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.BndEvt__WB_LevelSequencePlayer_W_BoundActionButton_Close_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_LevelSequencePlayer_C_BndEvt__WB_LevelSequencePlayer_W_BoundActionButton_Close_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};

// Function WB_LevelSequencePlayer.WB_LevelSequencePlayer_C.ExecuteUbergraph_WB_LevelSequencePlayer
// 0x0070 (0x0070 - 0x0000)
struct WB_LevelSequencePlayer_C_ExecuteUbergraph_WB_LevelSequencePlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2E[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHTUI_Button*                           K2Node_ComponentBoundEvent_Button_5;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTUI_Button*                           K2Node_ComponentBoundEvent_Button_4;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTUI_Button*                           K2Node_ComponentBoundEvent_Button_3;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHTUI_Button*                           K2Node_ComponentBoundEvent_Button_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}

