#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Skia_a_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "HTGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Weapon_Skia_a_AnimBP.Weapon_Skia_a_AnimBP_C
// 0x00D0 (0x05E0 - 0x0510)
class UWeapon_Skia_a_AnimBP_C final : public UHTSneakProbeAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0518(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0520(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0528(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0570(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0590(0x0048)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_Weapon_Skia_a_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Weapon_Skia_a_AnimBP_C">();
	}
	static class UWeapon_Skia_a_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeapon_Skia_a_AnimBP_C>();
	}
};

}

